{
  "title": {
    "english": "Chandi Homam",
    "telugu": "చండీ హోమం",
    "hindi": "चंडी होम"
  },
  "author": {
    "english": "P V R Narasimha Rao",
    "telugu": "P V R Narasimha Rao",
    "hindi": "P V R Narasimha Rao"
  },
  "sections": [
     {
      "id": 0,
      "source": "https://vedicastrologer.org/homa/regular/chandi_r_sans-.pdf",
      "title": {
        "english": "Introduction",
        "telugu": "పరిచయం",
        "hindi": "परिचय"
      },
      "instructions": {
        "english": [
          "Welcome to the Chandi Homam manual. This guide provides a simplified procedure for performing a traditional Chandi Homam.",
          "A homam (fire ritual) is a sacred Vedic practice where offerings are made to the fire while chanting mantras. The fire acts as a medium to carry our prayers and offerings to the divine.",
          "Chandi is a very fierce and powerful deity, the primordial energy responsible for the creation, sustenance, and destruction of the universe. This homam is a powerful tool for spiritual progress.",
          "This manual contains detailed sections to guide you step-by-step through the entire process, from initial preparations to the final conclusion.",
          "This procedure is intended for spiritual upliftment, viewing the Divine Mother with devotion. Please proceed with an attitude of surrender."
        ],
        "telugu": [
          "చండీ హోమం మార్గదర్శినికి స్వాగతం. ఈ గైడ్ సాంప్రదాయ చండీ హోమం నిర్వహించడానికి సరళీకృత విధానాన్ని అందిస్తుంది.",
          "హోమం (అగ్ని యజ్ఞం) అనేది మంత్రాలను జపిస్తూ అగ్నికి నైవేద్యాలు సమర్పించే ఒక పవిత్ర వైదిక ఆచారం. అగ్ని మన ప్రార్థనలను మరియు నైవేద్యాలను దైవానికి చేరవేసే మాధ్యమంగా పనిచేస్తుంది.",
          "చండీ చాలా ఉగ్రమైన మరియు శక్తివంతమైన దేవత, విశ్వం యొక్క సృష్టి, స్థితి మరియు లయకు కారణమైన ఆదిశక్తి. ఈ హోమం ఆధ్యాత్మిక పురోగతికి ఒక శక్తివంతమైన సాధనం.",
          "ఈ మార్గదర్శినిలో ప్రాథమిక సన్నాహాల నుండి చివరి ముగింపు వరకు మొత్తం ప్రక్రియ ద్వారా దశలవారీగా మీకు మార్గనిర్దేశం చేసే వివరణాత్మక విభాగాలు ఉన్నాయి.",
          "ఈ విధానం ఆధ్యాత్మిక ఉన్నతి కోసం ఉద్దేశించబడింది, దివ్య మాతను భక్తితో చూడాలి. దయచేసి సమర్పణ భావంతో ముందుకు సాగండి."
        ],
        "hindi": [
          "चंडी होम नियमावली में आपका स्वागत है। यह गाइड पारंपरिक चंडी होम करने के लिए एक सरलीकृत प्रक्रिया प्रदान करता है।",
          "होम (अग्नि अनुष्ठान) एक पवित्र वैदिक प्रथा है जिसमें मंत्रों का जाप करते हुए अग्नि को आहुति दी जाती है। अग्नि हमारी प्रार्थनाओं और आहुतियों को परमात्मा तक पहुंचाने का माध्यम बनती है।",
          "चंडी एक बहुत ही उग्र और शक्तिशाली देवी हैं, जो ब्रह्मांड के निर्माण, पालन और विनाश के लिए जिम्मेदार आदिकालीन ऊर्जा हैं। यह होम आध्यात्मिक प्रगति के लिए एक शक्तिशाली साधन है।",
          "इस नियमावली में प्रारंभिक तैयारियों से लेकर अंतिम निष्कर्ष तक पूरी प्रक्रिया में आपका चरण-दर-चरण मार्गदर्शन करने के लिए विस्तृत खंड हैं।",
          "यह प्रक्रिया आध्यात्मिक उत्थान के लिए है, जिसमें देवी माँ को भक्ति के साथ देखा जाता है। कृपया समर्पण की भावना के साथ आगे बढ़ें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om Sri MahaaGanapathaye Namah | Om Sri Gurubhyo Namah | Om Rishibhyo Namah |",
        "telugu": "ఓం శ్రీ మహా గణపతయే నమః | ఓం శ్రీ గురుభ్యో నమః | ఓం ఋషిభ్యో నమః |",
        "devanagari": "ॐ श्री महागणपतये नमः । ॐ श्री गुरुभ्यो नमः । ॐ ऋषिभ्यो नमः ।"
      }
    },
    {
      "id": 1,
      "title": {
        "english": "Permission",
        "telugu": "అనుజ్ఞ",
        "hindi": "अनुज्ञा"
      },
      "instructions": {
        "english": [
          "Before starting the homam, think of Mother Earth, Lord Ganesha, your favorite deity, your parents, the rishis of your lineage, all rishis, and all your gurus.",
          "Mentally request all the gods to cooperate with your homam while reciting the sloka."
        ],
        "telugu": [
          "హోమం ప్రారంభించే ముందు, భూదేవి, గణేశుడు, మీ ఇష్ట దైవం, మీ తల్లిదండ్రులు, మీ గోత్ర ఋషులు, సర్వ ఋషులు మరియు మీ గురువులందరినీ స్మరించుకోండి.",
          "శ్లోకాన్ని పఠిస్తూ, మీ హోమానికి సహకరించమని దేవతలందరినీ మానసికంగా ప్రార్థించండి."
        ],
        "hindi": [
          "होम शुरू करने से पहले, पृथ्वी माता, भगवान गणेश, अपने इष्ट देवता, अपने माता-पिता, अपने गोत्र के ऋषियों, सभी ऋषियों और अपने सभी गुरुओं का ध्यान करें।",
          "श्लोक का पाठ करते समय मानसिक रूप से सभी देवताओं से अपने होम में सहयोग करने का अनुरोध करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
              "english": "Om R^iddhyaasma havyairnamasopasadya |\n mitram devam mitradheyam no astu |\n  anooraadhaan havishaa vardhayantah |\n  shatam jeevema sharadah saveeraah |",
              "telugu": "ఓం ఋద్ధ్యాస్మ హవ్యైర్నమసోపసద్య |\n  మిత్రం దేవం మిత్రధేయం నో అస్తు |\n  అనూరాధాన్ హవిషా వర్ధయంతః |\n  శతం జీవేమ శరదః సవీరాః |",
              "devanagari": "ॐ ऋद्धयास्म हव्यैर्नमसोपसद्य |\n  मित्रं देवं मित्रधेयं नो अस्तु |\n  अनूराधान् हविषा वर्धयन्तः |\n  शतं जीवेम शरदः सवीराः |"
            }
    },
    {
      "id": 2,
      "title": {
        "english": "Purificatory Sipping of Water",
        "telugu": "ఆచమనం",
        "hindi": "आचमन"
      },
      "instructions": {
        "english": [
          "Take a little water from the tumbler into your right hand with a spoon and drink it after saying the first mantra.",
          "Repeat the process for the second mantra.",
          "Repeat the process for the third mantra, imagining that Vishnu within you is receiving the water."
        ],
        "telugu": [
          "ఒక చెంచాతో గ్లాసు నుండి కొద్దిగా నీటిని మీ కుడి చేతిలోకి తీసుకుని మొదటి మంత్రాన్ని చెప్పిన తర్వాత త్రాగండి.",
          "రెండవ మంత్రం కోసం అదే విధానాన్ని పునరావృతం చేయండి.",
          "మూడవ మంత్రం కోసం అదే విధానాన్ని పునరావృతం చేయండి, మీలోని విష్ణువు ఆ నీటిని స్వీకరిస్తున్నాడని భావించండి."
        ],
        "hindi": [
          "चम्मच से गिलास से थोड़ा सा पानी अपने दाहिने हाथ में लें और पहला मंत्र बोलने के बाद उसे पी लें।",
          "दूसरे मंत्र के लिए भी यही प्रक्रिया दोहराएं।",
          "तीसरे मंत्र के लिए भी यही प्रक्रिया दोहराएं, यह कल्पना करते हुए कि आपके भीतर मौजूद विष्णु उस जल को ग्रहण कर रहे हैं।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om Keshavaaya swaahaa |\nOm Naaraayanaaya swaahaa |\nOm Maadhavaaya swaahaa |",
        "telugu": "ఓం కేశవాయ స్వాహా |\nఓం నారాయణాయ స్వాహా |\nఓం మాధవాయ స్వాహా |",
        "devanagari": "ॐ केशवाय स्वाहा।\nॐ नारायणाय स्वाहा ।\nॐ माधवाय स्वाहा ।"
      }
    },
    {
      "id": 3,
      "title": {
        "english": "Worship of Vighneswara",
        "telugu": "విఘ్నేశ్వర పూజ",
        "hindi": "विघ्नेश्वर पूजा"
      },
      "instructions": {
        "english": [
          "To ensure there are no obstacles in the pooja, pray to Lord Ganesha by reciting the following verses.",
          "Pray mentally to Ganesha to remove all obstacles from your homam."
        ],
        "telugu": [
          "పూజలో ఎలాంటి ఆటంకాలు కలగకుండా ఉండేందుకు, ఈ క్రింది శ్లోకాలను పఠిస్తూ గణేశుడిని ప్రార్థించండి.",
          "మీ హోమం నుండి అన్ని ఆటంకాలను తొలగించమని గణేశుడిని మనస్సులో ప్రార్థించండి."
        ],
        "hindi": [
          "पूजा में कोई बाधा न आए, इसके लिए निम्नलिखित श्लोकों का पाठ करके भगवान गणेश की प्रार्थना करें।",
          "अपने होम से सभी बाधाओं को दूर करने के लिए गणेश जी से मानसिक रूप से प्रार्थना करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Shuklaambaradharam vishnum shashivarnam chaturbhujam | Prasannavadanam dhyaayet sarva vighnopashaantaye ||\nAgajaanana padmaarkam gajaananamaharnisham | Anekadam tam bhaktaanaam ekadantam upaasmahe ||\nVakratunda mahaakaaya kotisooryasamaprabha | Nirvighnam kuru me deva sarvakaaryeshu sarvadaa ||",
        "telugu": "శుక్లాంబరధరం విష్ణుం శశివర్ణం చతుర్భుజం । ప్రసన్నవదనం ధ్యాయేత్ సర్వ విఘ్నోపశాంతయే ॥\nఅగజానన పద్మార్కం గజాననమహర్నిశం । అనేకదం తం భక్తానాం ఏకదంతం ఉపాస్మహే ॥\nవక్రతుండ మహాకాయ కోటిసూర్యసమప్రభ । నిర్విఘ్నం కురు మే దేవ సర్వకార్యేషు సర్వదా ॥",
        "devanagari": "शुक्लांबरधरं विष्णुं शशिवर्णं चतुर्भुजं। प्रसन्नवदनं ध्यायेत् सर्व विघ्नोपशान्तये ॥\nअगजानन पद्मार्क गजाननमहर्निशं । अनेकदं तं भक्तानां एकदन्तं उपास्महे ॥\nवक्रतुंड महाकाय कोटिसूर्यसमप्रभ । निर्विघ्नं कुरु मे देव सर्वकार्येषु सर्वदा ॥"
      }
    },
    {
      "id": 4,
      "title": {
        "english": "Restraining the Life Force",
        "telugu": "ప్రాణాయామం",
        "hindi": "प्राणायाम"
      },
      "instructions": {
        "english": [
          "Take some akshatas in the left palm and place it on your left lap.",
          "Hold your nostrils with your right hand (little and ring finger on the left, thumb on the right).",
          "Close the left nostril, and while gently breathing in through the right nostril, mentally chant the Gayatri mantra (or an alternative).",
          "Close the right nostril, retain the breath, and mentally chant the mantra again.",
          "Open the left nostril, breathe out, and mentally chant the mantra for a third time.",
          "Breathe in through the left nostril, chanting the mantra.",
          "Close the left nostril, retain breath, and chant the mantra for the fifth time.",
          "Breathe out through the right nostril, chanting the mantra for the sixth time.",
          "Contemplate the formless supreme Brahman during the process."
        ],
        "telugu": [
          "ఎడమ అరచేతిలో కొన్ని అక్షతలు తీసుకుని మీ ఎడమ ఒడిలో ఉంచండి.",
          "మీ కుడి చేతితో మీ ముక్కుపుటాలను పట్టుకోండి (చిటికెన మరియు ఉంగరపు వేలు ఎడమ వైపు, బొటనవేలు కుడి వైపు).",
          "ఎడమ ముక్కుపుటాన్ని మూసి, కుడి ముక్కుపుటం ద్వారా మెల్లగా శ్వాస తీసుకుంటూ, గాయత్రీ మంత్రాన్ని (లేదా ప్రత్యామ్నాయ మంత్రాన్ని) మానసికంగా జపించండి.",
          "కుడి ముక్కుపుటాన్ని మూసి, శ్వాసను నిలిపి, మంత్రాన్ని మళ్ళీ మానసికంగా జపించండి.",
          "ఎడమ ముక్కుపుటాన్ని తెరిచి, శ్వాసను వదులుతూ, మంత్రాన్ని మూడవసారి మానసికంగా జపించండి.",
          "ఎడమ ముక్కుపుటం ద్వారా శ్వాస తీసుకుంటూ, మంత్రాన్ని జపించండి.",
          "ఎడమ ముక్కుపుటాన్ని మూసి, శ్వాసను నిలిపి, ఐదవసారి మంత్రాన్ని జపించండి.",
          "కుడి ముక్కుపుటం ద్వారా శ్వాసను వదులుతూ, ఆరవసారి మంత్రాన్ని జపించండి.",
          "ఈ ప్రక్రియ సమయంలో నిరాకార పరబ్రహ్మాన్ని ధ్యానించండి."
        ],
        "hindi": [
          "बाईं हथेली में कुछ अक्षत लें और उसे अपनी बाईं गोद में रखें।",
          "अपने दाहिने हाथ से अपनी नासिका को पकड़ें (छोटी और अनामिका उंगली बाईं ओर, अंगूठा दाईं ओर)।",
          "बाईं नासिका को बंद करें, और दाहिनी नासिका से धीरे-धीरे सांस लेते हुए, मानसिक रूप से गायत्री मंत्र (या एक विकल्प) का जाप करें।",
          "दाहिनी नासिका को बंद करें, सांस रोकें, और फिर से मानसिक रूप से मंत्र का जाप करें।",
          "बाईं नासिका खोलें, सांस छोड़ें, और तीसरी बार मानसिक रूप से मंत्र का जाप करें।",
          "बाईं नासिका से सांस लेते हुए मंत्र का जाप करें।",
          "बाईं नासिका को बंद करें, सांस रोकें, और पांचवीं बार मंत्र का जाप करें।",
          "दाहिनी नासिका से सांस छोड़ते हुए, छठी बार मंत्र का जाप करें।",
          "प्रक्रिया के दौरान निराकार परब्रह्म का चिंतन करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om namo bhagavate vaasudevaaya | Om namashshivaaya | Om gam ganapataye namah | (Use one of these if Gayatri mantra is not known)",
        "telugu": "ఓం నమో భగవతే వాసుదేవాయ । ఓం నమశ్శివాయ । ఓం గం గణపతయే నమః । (గాయత్రీ మంత్రం తెలియకపోతే వీటిలో ఒకటి ఉపయోగించండి)",
        "devanagari": "ॐ नमो भगवते वासुदेवाय । ॐ नमश्शिवाय। ॐ गं गणपतये नमः । (यदि गायत्री मंत्र ज्ञात न हो तो इनमें से किसी एक का प्रयोग करें)"
      }
    },
    {
      "id": 5,
      "title": {
        "english": "Taking the Vow",
        "telugu": "సంకల్పం",
        "hindi": "संकल्प"
      },
      "instructions": {
        "english": [
          "Transfer the akshatas from your left hand to your right hand.",
          "Place the empty left palm on your right lap.",
          "Place the closed right palm containing akshatas on top of the left palm.",
          "Recite the Sankalpam mantra, mentally affirming your intention to perform the homam to please Chandi.",
          "After reciting, leave the akshatas in front of the homa kundam and sprinkle a little water on your palms."
        ],
        "telugu": [
          "మీ ఎడమ చేతి నుండి అక్షతలను మీ కుడి చేతికి మార్చండి.",
          "ఖాళీ ఎడమ అరచేతిని మీ కుడి ఒడిలో ఉంచండి.",
          "అక్షతలు ఉన్న మూసివున్న కుడి అరచేతిని ఎడమ అరచేతిపై ఉంచండి.",
          "చండీ దేవిని ప్రసన్నం చేసుకోవడానికి హోమం చేయాలనే మీ ఉద్దేశ్యాన్ని మానసికంగా ధృవీకరిస్తూ సంకల్ప మంత్రాన్ని పఠించండి.",
          "పఠించిన తరువాత, హోమ కుండం ముందు అక్షతలను ఉంచి, మీ అరచేతులపై కొద్దిగా నీరు చల్లుకోండి."
        ],
        "hindi": [
          "अपने बाएं हाथ से अक्षत को अपने दाहिने हाथ में स्थानांतरित करें।",
          "खाली बाईं हथेली को अपनी दाहिनी गोद में रखें।",
          "अक्षत वाली बंद दाहिनी हथेली को बाईं हथेली के ऊपर रखें।",
          "संकल्प मंत्र का पाठ करें, चंडी को प्रसन्न करने के लिए होम करने के अपने इरादे की मानसिक रूप से पुष्टि करें।",
          "पाठ के बाद, अक्षत को होम कुंड के सामने छोड़ दें और अपनी हथेलियों पर थोड़ा पानी छिड़कें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om mamopaatta samasta duritakshayadwaaraa sree parameshwara preetyartham sree mahaakaalee mahaalakshmee mahaasaraswatee prasaada siddhayartham adya shubhadine shubhamuhoorte sree chandee homakarma yathaashakti karishye |",
        "telugu": "ఓం మమోపాత్త సమస్త దురితక్షయద్వారా శ్రీ పరమేశ్వర ప్రీత్యర్థం శ్రీ మహాకాళీ మహాలక్ష్మీ మహాసరస్వతీ ప్రసాద సిద్ధ్యర్థం అద్య శుభదినే శుభముహూర్తే శ్రీ చండీ హోమకర్మ యథాశక్తి కరిష్యే ।",
        "devanagari": "ॐ ममोपात्त समस्त दुरितक्षयद्वारा श्री परमेश्वर प्रीत्यर्थम् श्री महाकाळी महालक्ष्मी महासरस्वती प्रसाद सिद्धयर्थम् अद्य शुभदिने शुभमुहूर्ते श्री चण्डी होमकर्म यथाशक्ति करिष्ये ।"
      }
    },
  {
      "id": 6,
      "title": {
        "english": "Water Purification",
        "telugu": "కలశ శుద్ధి",
        "hindi": "कलश शुद्धि"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Place a few akshatas and a flower into the tumbler of water.",
              "Chant the syllable 'vam' (वं) 11 times to purify the water."
            ],
            "telugu": [
              "నీటి గ్లాసులో కొన్ని అక్షతలు మరియు ఒక పువ్వు ఉంచండి.",
              "నీటిని శుద్ధి చేయడానికి 'వం' అనే అక్షరాన్ని 11 సార్లు జపించండి."
            ],
            "hindi": [
              "पानी के गिलास में कुछ अक्षत और एक फूल डालें।",
              "पानी को शुद्ध करने के लिए 'वं' अक्षर का 11 बार जाप करें।"
            ]
          },
          "slokas": {
            "english": "Vam",
            "telugu": "వం",
            "devanagari": "वं"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the Ganga river invocation mantra to invite the essence of all sacred rivers into the water.",
              "Sprinkle the purified water on yourself, the homa kundam, the idol, and all other materials for the homam."
            ],
            "telugu": [
              "అన్ని పవిత్ర నదుల సారాంశాన్ని నీటిలోకి ఆహ్వానించడానికి గంగా నది ఆవాహన మంత్రాన్ని పఠించండి.",
              "శుద్ధి చేసిన నీటిని మీ మీద, హోమ కుండం మీద, విగ్రహం మీద మరియు హోమం కోసం ఉపయోగించే ఇతర వస్తువులన్నింటిపై చల్లుకోండి."
            ],
            "hindi": [
              "सभी पवित्र नदियों के सार को जल में आमंत्रित करने के लिए गंगा नदी के आह्वान मंत्र का पाठ करें।",
              "शुद्ध जल को अपने ऊपर, होम कुंड पर, मूर्ति पर और होम के लिए अन्य सभी सामग्रियों पर छिड़कें।"
            ]
          },
          "slokas": {
            "english": "Gange cha yamune chaiva godaavari saraswati | Narmade sindhu kaaveri jalesmin sannidhim kuru || Amrutam bhavatu",
            "telugu": "గంగే చ యమునే చైవ గోదావరి సరస్వతి । నర్మదే సింధు కావేరి జలేస్మిన్ సన్నిధిం కురు ॥ అమృతం భవతు",
            "devanagari": "गंगे च यमुने चैव गोदावरि सरस्वति । नर्मदे सिन्धु कावेरि जलेऽस्मिन् सन्निधिं कुरु ॥ अमृतं भवतु"
          }
        }
      ]
    },
    {
      "id": 7,
      "title": {
        "english": "Fire Installation",
        "telugu": "అగ్ని ప్రతిష్ఠాపన",
        "hindi": "अग्नि प्रतिष्ठापना"
      },
      "instructions": {
        "english": [
          "Draw 6 lines on the base of the homakundam with a darbha grass, in the order shown in the diagram, while reciting the six corresponding mantras.",
          "Place one darbha east-west and another north-south on the base of the kundam.",
          "Light a piece of camphor from the lamp and place it in the middle of the homa kundam while chanting 'Om bhoorbhuvassuvarom'.",
          "Place dry coconut pieces or wood over the camphor to build the fire.",
          "Pray to the fire god with the 'Kravyaadamagnim' mantra to send away the inauspicious fire and welcome the auspicious fire.",
          "Pour 8 drops of ghee into the fire, chanting 'Om bhoorbhuvassuvah swaahaa' each time.",
          "Place darbhas or twigs along the four outer boundaries of the homa kundam.",
          "Sprinkle water on the four outer boundaries in the order and direction shown in the diagram, while reciting the four corresponding mantras.",
          "Pray to Agni (fire god) with the 'Chatvaari shrungaah' mantra."
        ],
        "telugu": [
          "చిత్రంలో చూపిన క్రమంలో, ఆరు సంబంధిత మంత్రాలను పఠిస్తూ, ఒక దర్భ గడ్డితో హోమకుండం పునాదిపై 6 గీతలను గీయండి.",
          "కుండం పునాదిపై ఒక దర్భను తూర్పు-పడమరగా మరియు మరొకటి ఉత్తర-దక్షిణంగా ఉంచండి.",
          "'ఓం భూర్భువస్సువరోం' అని జపిస్తూ దీపం నుండి ఒక కర్పూరం ముక్కను వెలిగించి హోమ కుండం మధ్యలో ఉంచండి.",
          "నిప్పును పెంచడానికి కర్పూరం మీద ఎండిన కొబ్బరి ముక్కలు లేదా కలపను ఉంచండి.",
          "అశుభకరమైన అగ్నిని పంపి, శుభకరమైన అగ్నిని స్వాగతించడానికి 'క్రవ్యాదమగ్నిం' మంత్రంతో అగ్ని దేవుడిని ప్రార్థించండి.",
          "ప్రతిసారీ 'ఓం భూర్భువస్సువః స్వాహా' అని జపిస్తూ, అగ్నిలో 8 చుక్కల నెయ్యి పోయండి.",
          "హోమ కుండం యొక్క నాలుగు బయటి సరిహద్దుల వెంట దర్భలు లేదా కొమ్మలను ఉంచండి.",
          "చిత్రంలో చూపిన క్రమంలో మరియు దిశలో, నాలుగు సంబంధిత మంత్రాలను పఠిస్తూ, నాలుగు బయటి సరిహద్దులపై నీటిని చల్లుకోండి.",
          "'చత్వారి శృంగాః' మంత్రంతో అగ్ని దేవుడిని ప్రార్థించండి."
        ],
        "hindi": [
          "चित्र में दिखाए गए क्रम में, छह संबंधित मंत्रों का पाठ करते हुए, एक दर्भ घास से होमकुंड के आधार पर 6 रेखाएँ खींचें।",
          "कुंड के आधार पर एक दर्भ पूर्व-पश्चिम और दूसरा उत्तर-दक्षिण में रखें।",
          "'ॐ भूर्भुवस्सुवरोम्' का जाप करते हुए दीपक से कपूर का एक टुकड़ा जलाएं और उसे होम कुंड के बीच में रखें।",
          "आग बनाने के लिए कपूर के ऊपर सूखे नारियल के टुकड़े या लकड़ी रखें।",
          "अशुभ अग्नि को दूर भेजने और शुभ अग्नि का स्वागत करने के लिए 'क्रव्यादमग्निम्' मंत्र से अग्नि देव से प्रार्थना करें।",
          "प्रत्येक बार 'ॐ भूर्भुवस्सुवः स्वाहा' का जाप करते हुए आग में घी की 8 बूँदें डालें।",
          "होम कुंड की चार बाहरी सीमाओं के साथ दर्भ या टहनियाँ रखें।",
          "चित्र में दिखाए गए क्रम और दिशा में, चार संबंधित मंत्रों का पाठ करते हुए, चार बाहरी सीमाओं पर पानी छिड़कें।",
          "'चत्वारि शृङ्गाः' मंत्र से अग्नि देव से प्रार्थना करें।"
        ]
      },
      "diagram": "/diagrams/agni-pratisthapana-6-devata.svg",
      "slokas": {
        "english": "For drawing lines: Om brahmane namah | Om yamaaya namah | Om somaaya namah | Om rudraaya namah | Om vishnave namah | Om indraaya namah |\nFor fire installation: Om bhoorbhuvassuvarom | Kravyaadamagnim prahinomi dooram yamaraajno gachchatu ripravaahah | ihaivaayamitaro jaatavedaa devebhyo havyam vahatu prajaanan |\nFor refinement: Om bhoorbhuvassuvah swaahaa |\nFor sprinkling water: Aditenumanyasva | anumatenu-manyasva | sarasvatenumanyasva | deva savitah prasuva |\nPrayer to Agni: Chatvaari shrungaastrayo asya paadaa dwe sheershe saptahastaaso asya | tridhaa baddho vishabho roraveeti maho devo martyaa aavivesha | Esha hi devah pradisho nu sarvaah poorvo hi jaatah sa u garbhe antah | sa vijaayamaanah sa janishyamaanah pratyangmukhaastishthati vishwatomukhah | praangmukho deva | he agne | mamaabhimukho bhava |",
        "telugu": "గీతలు గీయడానికి: ఓం బ్రహ్మణే నమః | ఓం యమాయ నమః | ఓం సోమాయ నమః | ఓం రుద్రాయ నమః | ఓం విష్ణవే నమః | ఓం ఇంద్రాయ నమః |\nఅగ్ని ప్రతిష్ఠాపనకు: ఓం భూర్భువస్సువరోం | క్రవ్యాదమగ్నిం ప్రహిణోమి దూరం యమరాజ్ఞో గచ్ఛతు రిప్రవాహః । ఇహైవాయమితరో జాతవేదా దేవేభ్యో హవ్యం వహతు ప్రజానన్ |\nశుద్ధి కోసం: ఓం భూర్భువస్సువః స్వాహా |\nనీరు చల్లడానికి: అదితేऽనుమన్యస్వ । అనుమతేऽనుమన్యస్వ । సరస్వతేऽనుమన్యస్వ । దేవ సవితః ప్రసువ ।\nఅగ్ని ప్రార్థన: చత్వారి శృంగాస్త్రయో అస్య పాదా ద్వే శీర్షే సప్తహస్తాసో అస్య । త్రిధా బద్ధో వృషభో రోరవీతి మహో దేవో మర్త్యా ఆవివేశ । ఏష హి దేవః ప్రదిశో ను సర్వాః పూర్వో హి జాతః స ఉ గర్భే అంతః । స విజాయమానః స జనిష్యమాణః ప్రత్యఙ్ముఖాస్తిష్ఠతి విశ్వతోముఖః । ప్రాఙ్ముఖో దేవ । హే అగ్నే । మమాభిముఖో భవ ।",
        "devanagari": "रेखाओं के लिए: ॐ ब्रह्मणे नमः । ॐ यमाय नमः । ॐ सोमाय नमः । ॐ रुद्राय नमः। ॐ विष्णवे नमः । ॐ इन्द्राय नमः ।\nअग्नि प्रतिष्ठापना के लिए: ॐ भूर्भुवस्सुवरोम्। क्रव्यादमग्निं प्रहिणोमि दूरं यमराज्ञो गच्छतु रिप्रवाहः । इहैवायमितरो जातवेदा देवेभ्यो हव्यं वहतु प्रजानन् ।\nसंस्कार के लिए: ॐ भूर्भुवस्सुवः स्वाहा।\nजल छिड़कने के लिए: अदितेऽनुमन्यस्व । अनुमतेऽनुमन्यस्व । सरस्वतेऽनुमन्यस्व । देव सवितः प्रसुव ।\nअग्नि से प्रार्थना: चत्वारि शृंगास्त्रयो अस्य पादा द्वे शीर्षे सप्तहस्तासो अस्य । त्रिधा बद्धो वृषभो रोरवीति महो देवो मर्त्या आविवेश । एष हि देवः प्रदिशो नु सर्वाः पूर्वो हि जातः स उ गर्भे अन्तः । स विजायमानः स जनिष्यमाणः प्रत्यङ्‌मुखास्तिष्ठति विश्वतोमुखः । प्राङ्‌मुखो देव । हे अग्ने। ममाभिमुखो भव ।"
      }
    },
    {
      "id": 8,
      "title": {
        "english": "Worship of Direction Rulers",
        "telugu": "దిక్పాలక పూజ",
        "hindi": "दिक्पालक पूजा"
      },
      "instructions": {
        "english": [
          "Take akshatas and flowers and offer them to the rulers of the directions.",
          "Starting from the East, go clockwise offering for the eight directions (East, Southeast, South, Southwest, West, Northwest, North, Northeast).",
          "Offer for Brahma (upward direction) between Northeast and East.",
          "Offer for Sesha (downward direction) between Southwest and West.",
          "Offer to Agni in the middle of the homa kundam.",
          "Finally, touch your heart and offer respect to the self (Atman).",
          "Recite the 12 corresponding mantras for each of the 12 offerings."
        ],
        "telugu": [
          "అక్షతలు, పువ్వులు తీసుకుని దిక్పాలకులకు సమర్పించండి.",
          "తూర్పు నుండి ప్రారంభించి, ఎనిమిది దిక్కులకు (తూర్పు, ఆగ్నేయం, దక్షిణం, నైరుతి, పడమర, వాయువ్యం, ఉత్తరం, ఈశాన్యం) ప్రదక్షిణంగా సమర్పించండి.",
          "ఈశాన్యం మరియు తూర్పు మధ్య బ్రహ్మకు (ఊర్ధ్వ దిశ) సమర్పించండి.",
          "నైరుతి మరియు పడమర మధ్య శేషునికి (అధో దిశ) సమర్పించండి.",
          "హోమ కుండం మధ్యలో అగ్నికి సమర్పించండి.",
          "చివరగా, మీ హృదయాన్ని తాకి, ఆత్మకు నమస్కరించండి.",
          "12 సమర్పణలలో ప్రతిదానికి సంబంధించిన 12 మంత్రాలను పఠించండి."
        ],
        "hindi": [
          "अक्षत और फूल लेकर दिशाओं के शासकों को अर्पित करें।",
          "पूर्व से शुरू करते हुए, आठ दिशाओं (पूर्व, दक्षिण-पूर्व, दक्षिण, दक्षिण-पश्चिम, पश्चिम, उत्तर-पश्चिम, उत्तर, उत्तर-पूर्व) के लिए दक्षिणावर्त अर्पित करें।",
          "उत्तर-पूर्व और पूर्व के बीच ब्रह्मा (ऊर्ध्व दिशा) के लिए अर्पित करें।",
          "दक्षिण-पश्चिम और पश्चिम के बीच शेष (अधो दिशा) के लिए अर्पित करें।",
          "होम कुंड के मध्य में अग्नि को अर्पित करें।",
          "अंत में, अपने हृदय को स्पर्श करें और स्वयं (आत्मा) को सम्मान अर्पित करें।",
          "12 प्रसादों में से प्रत्येक के लिए 12 संगत मंत्रों का पाठ करें।"
        ]
      },
      "diagram": "/diagrams/dikpalakas.svg",
      "slokas": {
        "english": "Om indraaya namah | Om agnaye namah | Om yamaaya namah | Om nirr^itaye namah | Om varunaaya namah | Om vaayave namah | Om somaaya namah | Om eeshaanaaya namah | Om brahmane namah | Om sheshaaya namah | Om agnaye namah | Om aatmane namah |",
        "telugu": "ఓం ఇంద్రాయ నమః। ఓం అగ్నయే నమః। ఓం యమాయ నమః। ఓం నిరృతయే నమః। ఓం వరుణాయ నమః। ఓం వాయవే నమః। ఓం సోమాయ నమః। ఓం ఈశానాయ నమః। ఓం బ్రహ్మణే నమః । ఓం శేషాయ నమః। ఓం అగ్నయే నమః । ఓం ఆత్మనే నమః ।",
        "devanagari": "ॐ इन्द्राय नमः। ॐ अग्नये नमः। ॐ यमाय नमः। ॐ निर्ऋतये नमः। ॐ वरुणाय नमः। ॐ वायवे नमः। ॐ सोमाय नमः। ॐ ईशानाय नमः। ॐ ब्रह्मणे नमः । ॐ शेषाय नमः। ॐ अग्नये नमः । ॐ आत्मने नमः ।"
      }
    },
    {
      "id": 9,
      "title": {
        "english": "Preliminary Offerings",
        "telugu": "పూర్వాంగం",
        "hindi": "पूर्वांगम्"
      },
      "instructions": {
        "english": [
          "Holding a wooden ladle, offer a drop of ghee for Prajapati, pointing from Northwest to Southeast.",
          "Offer a drop of ghee for Indra, pointing from Southwest to Northeast.",
          "Offer ghee to Agni in the middle of the fire.",
          "Offer ghee to Soma in the upper half of the northern side of the homa kundam.",
          "Make a 'forgiveness offering' to Prajapati for any mistakes made up to this point."
        ],
        "telugu": [
          "చెక్క గరిటెను పట్టుకుని, వాయువ్యం నుండి ఆగ్నేయం వైపు చూపిస్తూ ప్రజాపతికి ఒక చుక్క నెయ్యిని సమర్పించండి.",
          "నైరుతి నుండి ఈశాన్యం వైపు చూపిస్తూ ఇంద్రునికి ఒక చుక్క నెయ్యిని సమర్పించండి.",
          "అగ్ని మధ్యలో అగ్నికి నెయ్యిని సమర్పించండి.",
          "హోమ కుండం యొక్క ఉత్తర భాగపు పై అర్ధభాగంలో సోమునికి నెయ్యిని సమర్పించండి.",
          "ఇప్పటివరకు జరిగిన ఏవైనా తప్పులకు ప్రజాపతికి 'క్షమాపణ నైవేద్యం' సమర్పించండి."
        ],
        "hindi": [
          "एक लकड़ी का करछुल पकड़कर, प्रजापति के लिए घी की एक बूंद अर्पित करें, जो उत्तर-पश्चिम से दक्षिण-पूर्व की ओर इंगित हो।",
          "इंद्र के लिए घी की एक बूंद अर्पित करें, जो दक्षिण-पश्चिम से उत्तर-पूर्व की ओर इंगित हो।",
          "अग्नि के मध्य में अग्नि को घी अर्पित करें।",
          "होम कुंड के उत्तरी भाग के ऊपरी आधे हिस्से में सोम को घी अर्पित करें।",
          "इस बिंदु तक की गई किसी भी गलती के लिए प्रजापति को 'क्षमा अर्पण' करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om prajaapataye swaahaa | Prajaapataya idam na mama ||\nOm indraaya swaahaa | Indraayedam na mama ||\nOm agnaye swaahaa | Agnaye idam na mama ||\nOm somaaya swaahaa | Somaayedam na mama ||\nAarambhaprabhr^iti etat-kshana-paryantam madhye sambhaavita samasta dosha praayashchittaartham sarva praayashchittam hosyaami | Om bhoorbhuvassuvah swaahaa | Prajaapataya idam na mama ||",
        "telugu": "ఓం ప్రజాపతయే స్వాహా। ప్రజాపతయ ఇదం న మమ ॥\nఓం ఇంద్రాయ స్వాహా। ఇంద్రాయేదం న మమ ॥\nఓం అగ్నయే స్వాహా। అగ్నయ ఇదం న మమ ॥\nఓం సోమాయ స్వాహా । సోమాయేదం న మమ ॥\nఆరంభప్రభృతి ఏతత్క్షణపర్యంతం మధ్యే సంభාවිත సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తం హోష్యామి। ఓం భూర్భువస్సువః స్వాహా । ప్రజాపతయ ఇదం న మమ ॥",
        "devanagari": "ॐ प्रजापतये स्वाहा। प्रजापतय इदं न मम ।\nॐ इन्द्राय स्वाहा। इन्द्रायेदं न मम ।\nॐ अग्नये स्वाहा। अग्नय इदं न मम ।\nॐ सोमाय स्वाहा । सोमायेदं न मम ।\nआरंभप्रभृति एतत्क्षणपर्यन्तं मध्ये संभावित समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्तं होष्यामि। ॐ भूर्भुवस्सुवः स्वाहा । प्रजापतय इदं न मम ।"
      }
    },
    {
      "id": 10,
      "title": {
        "english": "Quick Homam for Mahaganapathi",
        "telugu": "మహాగణపతికి శీఘ్ర హోమం",
        "hindi": "महागणपति के लिए त्वरित होम"
      },
      "instructions": {
        "english": [
          "Invoke Mahaganapathi into the fire with the invocation mantra.",
          "Offer five services (Panchopachara Pooja): sandalwood powder (Gandham), a flower (Pushpam), incense (Dhoopam), a lamp (Deepam), and food (Naivedyam).",
          "Offer akshatas for 'all services' (Sarvopacharan).",
          "Offer ghee into the fire with the Mahaganapathi mantra, repeating 4, 8, or 12 times."
        ],
        "telugu": [
          "ఆవాహన మంత్రంతో మహాగణపతిని అగ్నిలోకి ఆహ్వానించండి.",
          "ఐదు సేవలను (పంచోపచార పూజ) సమర్పించండి: గంధపు పొడి (గంధం), ఒక పువ్వు (పుష్పం), ధూపం (ధూపం), ఒక దీపం (దీపం), మరియు ఆహారం (నైవేద్యం).",
          "'సర్వ సేవలకు' (సర్వోపచారాన్) అక్షతలను సమర్పించండి.",
          "మహాగణపతి మంత్రంతో అగ్నిలో నెయ్యిని సమర్పించండి, 4, 8, లేదా 12 సార్లు పునరావృతం చేయండి."
        ],
        "hindi": [
          "आवाहन मंत्र के साथ महागणपति को अग्नि में आमंत्रित करें।",
          "पांच सेवाएं (पंचोपचार पूजा) अर्पित करें: चंदन पाउडर (गंधम), एक फूल (पुष्पम), धूप (धूपम), एक दीपक (दीपम), और भोजन (नैवेद्यम)।",
          "'सभी सेवाओं' (सर्वोपचारान्) के लिए अक्षत अर्पित करें।",
          "महागणपति मंत्र के साथ अग्नि में घी अर्पित करें, 4, 8, या 12 बार दोहराएं।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om gam ganapataye namah | Asunee te punarasmaasu chakshuh punah praanamiha no dehi bhogam | Jyokpashyema sooryamuchcharantamanumate mrilayaa nah swasti | Om sree mahaaganapati praanashaktyai namah | Atra aagachha | Aavaahito bhava | Sthaapito bhava | Sannihito bhava | Sanniruddho bhava | Avakunthito bhava | Praseeda praseeda ||\nLam prithivyaatmane namah | Gandham samarpayaami ||\nHam aakaashaatmane namah | Pushpam samarpayaami ||\nYam vaayvaatmane namah | Dhoopam aaghraapayaami ||\nRam agnyaatmane namah | Deepam darshayaami ||\nVam amritaatm ane namah | Naivedyam samarpayaami ||\nSam sarvaatmane namah | Sarvopachaaraan samarpayaami ||\nOm gam ganapataye namah swaahaa ||",
        "telugu": "ఓం గం గణపతయే నమః। అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం। జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి । ఓం శ్రీ మహాగణపతి ప్రాణశక్త్యై నమః। అత్ర ఆగఛ । ఆవాహితో భవ । స్థాపితో భవ । సన్నిహితో భవ । సన్నిరుద్ధో భవ । అవకుంఠితో భవ । ప్రసీద ప్రసీద ॥\nలం పృథివ్యాత్మనే నమః। గంధం సమర్పయామి ॥\nహం ఆకాశాత్మనే నమః । పుష్పం సమర్పయామి ॥\nయం వాయ్వాత్మనే నమః। ధూపం ఆఘ్రాపయామి ॥\nరం అగ్న్యాత్మనే నమః । దీపం దర్శయామి ॥\nవం అమృతాత్మనే నమః । నైవేద్యం సమర్పయామి ॥\nసం సర్వాత్మనే నమః । సర్వోపచారాన్ సమర్పయామి ॥\nఓం గం గణపతయే నమః స్వాహా ॥",
        "devanagari": "ॐ गं गणपतये नमः। असुनी ते पुनरस्मासु चक्षुः पुनः प्राणमिह नो देहि भोगं। ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति । ॐ श्री महागणपति प्राणशक्त्यै नमः। अत्र आगछ । आवाहितो भव । स्थापितो भव । सन्निहितो भव । सन्निरुद्धो भव । अवकुंठितो भव । प्रसीद प्रसीद ॥\nलं पृथिव्यात्मने नमः। गन्धं समर्पयामि ॥\nहं आकाशात्मने नमः । पुष्पं समर्पयामि ॥\nयं वाय्वात्मने नमः। धूपं आघ्रापयामि ॥\nरं अग्न्यात्मने नमः । दीपं दर्शयामि ॥\nवं अमृतात्मने नमः । नैवेद्यं समर्पयामि ॥\nसं सर्वात्मने नमः । सर्वोपचारान् समर्पयामि ॥\nॐ गं गणपतये नमः स्वाहा ॥"
      }
    },
    {
      "id": 11,
      "title": {
        "english": "Invocation of Main Deity",
        "telugu": "ప్రాణ ప్రతిష్ఠాపన",
        "hindi": "प्राण प्रतिष्ठापना"
      },
      "instructions": {
        "english": [
          "Perform nyasas (ritual hand gestures) if you know them while reciting the first part of the mantra.",
          "Recite the dhyana sloka (meditation verse) describing the form of the Goddess.",
          "Invoke the deity into the fire and idol with the main invocation mantra, imagining Chandi from your heart entering the fire.",
          "Recite the final verses and perform mudras (if known) to request the Goddess to be established, present, and pleased until the end of the homam."
        ],
        "telugu": [
          "మంత్రం యొక్క మొదటి భాగాన్ని పఠిస్తూ మీకు తెలిస్తే న్యాసాలు (ఆచార చేతి సంజ్ఞలు) చేయండి.",
          "దేవత రూపాన్ని వర్ణించే ధ్యాన శ్లోకాన్ని పఠించండి.",
          "మీ హృదయం నుండి చండీ అగ్నిలోకి ప్రవేశిస్తున్నట్లు ఊహించుకుంటూ, ప్రధాన ఆవాహన మంత్రంతో దేవతను అగ్నిలోకి మరియు విగ్రహంలోకి ఆహ్వానించండి.",
          "హోమం ముగిసే వరకు దేవతను స్థాపించమని, హాజరుకావాలని మరియు ప్రసన్నం చేసుకోమని కోరుతూ చివరి శ్లోకాలను పఠించండి మరియు ముద్రలు (తెలిస్తే) చేయండి."
        ],
        "hindi": [
          "मंत्र के पहले भाग का पाठ करते समय यदि आप जानते हैं तो न्यास (अनुष्ठानिक हाथ के इशारे) करें।",
          "देवी के रूप का वर्णन करने वाले ध्यान श्लोक का पाठ करें।",
          "अपने हृदय से चंडी को अग्नि में प्रवेश करने की कल्पना करते हुए, मुख्य आवाहन मंत्र के साथ देवता को अग्नि और मूर्ति में आमंत्रित करें।",
          "अंतिम श्लोकों का पाठ करें और होम की समाप्ति तक देवी से स्थापित, उपस्थित और प्रसन्न रहने का अनुरोध करने के लिए मुद्राएं (यदि ज्ञात हो) करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Asya shree praanapratishthaapana mantrasya brahma vishnu maheshwaraa rishayah rigyajussaamaatharvaani chhandaansi shree chandikaa devataa | Aim beejam | Hreem shaktih | Kleem keelakam | Aim angushthaabhyaam namah | Hreem tarjaneebhyaam namah | Kleem madhyamaabhyaam namah | Aim anaamikaabhyaam namah | Hreem kanishthikaabhyaam namah | Kleem karatala karaprishthaabhyaam namah | Aim hridayaaya namah | Hreem shirase swaahaa | Kleem shikhaayai vashat | Aim kavachaaya hum | Hreem netratrayaaya vaushat | Kleem astraaya phat | Bhoorbhuvassuvaromiti digbandhah ||\nShwetaananaa neelabhujaa sushweta stana mandalaa | Rakta madhyaa rakta paadaa neelajanghorurunmadaa || Suchitra jaghanaa chitra maalyaambara vibhooshanaa | Chitraanulepanaa kaanti roopa saubhaagyashaalinee || Ashtaadasha bhujaa poojyaa saa sahasrabhujaa satee | Aayudhaanyatra vakshyante dakshinaadhahkara kramaat || Akshamaalaa cha kamalam baanosih kulisham gadaa | Chakram trishoolam parashuh shankho ghantaa cha paashakah || Shaktirdandashcharma chaapam paanapaatram kamandaluh ||\nOm aim hreem kleem yam ram lam vam sham sham sam hamlam ksham | Om hamsah so'ham so'ham hamsah | Shree chandikaayaah praana iha praanah | Jeeva iha sthitah | Sarvendriyaani vaangmanastwak chakshuh shrotra jihwaaghraana praanaapaanavyaanodaana samaanaah ihaivaagatya sukham chiram tishthantu swaahaa | Saannidhyam kurvantu swaahaa | Asunee te punarasmaasu chakshuh punah praanamiha no dehi bhogam | Jyokpashyema sooryamuchcharantamanumate mrilayaa nah swasti | Aim hreem kleem | Kleem hreem aim | Om sree chandikaa praanashaktyai namah | Atra aagachha ||\nAavaahitaa bhava | Sthaapitaa bhava | Sannihitaa bhava | Sanniruddhaa bhava | Avakunthitaa bhava | Devi praseeda praseeda | Devi sarva jagannaayaki yaavaddhomaavasaanakam | Taavattvam preetibhaavena moortaavagnau cha sannidhim kuru ||",
        "telugu": "అస్య శ్రీ ప్రాణప్రతిష్ఠాపన మంత్రస్య బ్రహ్మ విష్ణు మహేశ్వరా ఋషయః ఋగ్యజుస్సామాథర్వాణి ఛందాంసి శ్రీ చండికా దేవతా । ఐం బీజం। హ్రీం శక్తిః। క్లీం కీలకం । ఐం అంగుష్ఠాభ్యాం నమః। హ్రీం తర్జనీభ్యాం నమః। క్లీం మధ్యమాభ్యాం నమః। ఐం అనామికాభ్యాం నమః । హ్రీం కనిష్ఠికాభ్యాం నమః। క్లీం కరతల కరపృష్ఠాభ్యాం నమః। ఐం హృదయాయ నమః। హ్రీం శిరసే స్వాహా। క్లీం శిఖాయై వషట్ । ఐం కవచాయ హుం । హ్రీం నేత్రత్రయాయ వౌషట్ । క్లీం అస్త్రాయ ఫట్ । భూర్భువస్సువరోమితి దిగ్బంధః ॥\nశ్వేతాననా నీలభుజా సుశ్వేత స్తన మండలా । రక్త మధ్యా రక్త పాదా నీలజంఘోరురున్మదా ॥ సుచిత్ర జఘనా చిత్ర మాల్యాంబర విభూషణా । చిత్రానులేపనా కాంతి రూప సౌభాగ్యశాలినీ ॥ అష్టాదశ భుజా పూజ్యా సా సహస్రభుజా సతీ। ఆయుధాన్యత్ర వక్ష్యంతే దక్షిణాధఃకర క్రమాత్ ॥ అక్షమాలా చ కమలం బాణోऽసిః కులిశం గదా । చక్రం త్రిశూలం పరశుః శంఖో ఘంటా చ పాశకః ॥ శక్తిర్దండశ్చర్మ చాపం పానపాత్రం కమండలుః ॥\nఓం ఐం హ్రీం క్లీం యం రం లం వం శం షం సం హంళం క్షం। ఓం హంసః సోऽహం సోऽహం హంసః । శ్రీ చండికాయాః ప్రాణ ఇహ ప్రాణః। జీవ ఇహ స్థితః । సర్వేంద్రియాణి వాఙ్మనస్త్వక్ చక్షుః శ్రోత్ర జిహ్వాఘ్రాణ ప్రాణాపానవ్యానోదానసమానాః ఇహైవాగత్య సుఖం చిరం తిష్ఠन्तु స్వాహా। సాన్నిధ్యం కుర్వంతు స్వాహా। అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం। జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి। ఐం హ్రీం క్లీం। క్లీం హ్రీం ఐం । ఓం శ్రీ చండికా ప్రాణశక్త్యై నమః। అత్ర ఆగచ్ఛ ॥\nఆవాహితా భవ । స్థాపితా భవ। సన్నిహితా భవ। సన్నిరుద్ధా భవ। అవకుంఠితా భవ । దేవి ప్రసీద ప్రసీద । దేవి సర్వ జగన్నాయకి యావద్ధోమావసానకమ్ । తావత్త్వం ప్రీతిభావేన మూర్తౌ అగ్నౌ చ సన్నిధిం కురు ॥",
        "devanagari": "अस्य श्री प्राणप्रतिष्ठापन मंत्रस्य ब्रह्म विष्णु महेश्वरा ऋषयः ऋग्यजुस्सामाथर्वाणि छन्दासि श्री चण्डिका देवता । ऐं बीजं। ह्रीं शक्तिः। क्लीं कीलकं । ऐं अंगुष्ठाभ्यां नमः। ह्रीं तर्जनीभ्यां नमः। क्लीं मध्यमाभ्यां नमः। ऐं अनामिकाभ्यां नमः । ह्रीं कनिष्ठिकाभ्यां नमः। क्लीं करतल करपृष्ठाभ्यां नमः। ऐं हृदयाय नमः। ह्रीं शिरसे स्वाहा। क्लीं शिखायै वषट् । ऐं कवचाय हुं । ह्रीं नेत्रत्रयाय वौषट् । क्लीं अस्त्राय फट् । भूर्भुवस्सुवरोमिति दिग्बंधः ॥\nश्वेतानना नीलभुजा सुश्वेत स्तन मण्डला । रक्त मध्या रक्त पादा नीलजंघोरुरुन्మदा ॥ सुचित्र जघना चित्र माल्याम्बर विभूषणा । चित्रानुलेपना कान्ति रूप सौभाग्यशालिनी ॥ अष्टादश भुजा पूज्या सा सहस्रभुजा सती। आयुधान्यत्र वक्ष्यन्ते दक्षिणाधःकर क्रमात् ॥ अक्षमाला च कमलं बाणोऽसिः कुलिशं गदा । चक्रं त्रिशूलं परशुः शंखो घण्टा च पाशकः ॥ शक्तिर्दण्डश्चर्म चापं पानपात्रं कमण्डलुः ॥\nॐ ऐं ह्रीं क्लीं यं रं लं वंशं षं सं हंळं क्षं। ॐ हंसः सोऽहं सोऽहं हंसः । श्री चण्डिकायाः प्राण इह प्राणः। जीव इह स्थितः । सर्वेन्द्रियाणि वाङ्मनस्त्वक् चक्षुः श्रोत्र जिह्वाघ्राण प्राणापानव्यानोदानसमानाः इहैवागत्य सुखं चिरं तिष्ठन्तु स्वाहा। सान्निध्यं कुर्वन्तु स्वाहा। असुनी ते पुनरस्మాसु चक्षुः पुनः प्राणमिह नो देहि भोगं। ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति। ऐं ह्रीं क्लीं। क्लीं ह्रीं ऐं । ॐ श्री चण्डिका प्राणशक्त्यै नमः। अत्र आगच्छ ॥\nआवाहिता भव । स्थापिता भव। सन्निहिता भव। सन्निरुद्धा भव। अवकुंठिता भव । देवि प्रसीद प्रसीद । देवि सर्व जगन्नायकि यावद्धोमावसानकम् । तावत्त्वं प्रीतिभावेन मूर्तों अग्नौ च सन्निधिं कुरु ।"
      }
    },
    {
      "id": 12,
      "title": {
        "english": "Five-Service Worship",
        "telugu": "పంచోపచార పూజ",
        "hindi": "पंचोपचार पूजा"
      },
      "instructions": {
        "english": [
          "Offer five services (Panchopachara Pooja) to Chandi in the fire and the idol:",
          "1. Offer sandalwood powder/paste (Gandham). You can also offer turmeric and kumkum.",
          "2. Offer a flower or flower petal (Pushpam).",
          "3. Offer incense smoke (Dhoopam).",
          "4. Show the light from the lamp (Deepam).",
          "5. Offer some food (Naivedyam).",
          "Finally, offer akshatas, representing 'all services' (Sarvopacharan)."
        ],
        "telugu": [
          "అగ్నిలో మరియు విగ్రహంలో చండీకి ఐదు సేవలను (పంచోపచార పూజ) సమర్పించండి:",
          "1. గంధపు పొడి/పేస్ట్ (గంధం) సమర్పించండి. మీరు పసుపు మరియు కుంకుమ కూడా సమర్పించవచ్చు.",
          "2. ఒక పువ్వు లేదా పువ్వు రేకు (పుష్పం) సమర్పించండి.",
          "3. ధూపం పొగను (ధూపం) సమర్పించండి.",
          "4. దీపం నుండి కాంతిని (దీపం) చూపండి.",
          "5. కొంత ఆహారాన్ని (నైవేద్యం) సమర్పించండి.",
          "చివరగా, 'అన్ని సేవలను' (సర్వోపచారన్) సూచిస్తూ అక్షతలను సమర్పించండి."
        ],
        "hindi": [
          "अग्नि और मूर्ति में चंडी को पांच सेवाएं (पंचोपचार पूजा) अर्पित करें:",
          "1. चंदन पाउडर/पेस्ट (गंधम) अर्पित करें। आप हल्दी और कुमकुम भी चढ़ा सकते हैं।",
          "2. एक फूल या फूल की पंखुड़ी (पुष्पम) अर्पित करें।",
          "3. धूप का धुआं (धूपम) अर्पित करें।",
          "4. दीपक से प्रकाश (दीपम) दिखाएं।",
          "5. कुछ भोजन (नैवेद्यम) अर्पित करें।",
          "अंत में, 'सभी सेवाओं' (सर्वोपचारान्) का प्रतिनिधित्व करते हुए अक्षत अर्पित करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Lam prithivyaatmikaayai namah | Gandham samarpayaami ||\nHam aakaashaatmikaayai namah | Pushpam samarpayaami ||\nYam vaayvaatmikaayai namah | Dhoopam aaghraapayaami ||\nRam agnyaatmikaayai namah | Deepam darshayaami ||\nVam amritaatmikaayai namah | Naivedyam samarpayaami ||\nSam sarvaatmikaayai namah | Sarvopachaaraan samarpayaami ||",
        "telugu": "లం పృథివ్యాత్మికాయై నమః । గంధం సమర్పయామి ॥\nహం ఆకాశాత్మికాయై నమః । పుష్పం సమర్పయామి ॥\nయం వాయ్వాత్మికాయై నమః। ధూపం ఆఘ్రాపయామి ॥\nరం అగ్న్యాత్మికాయై నమః । దీపం దర్శయామి ॥\nవం అమృతాత్మికాయై నమః । నైవేద్యం సమర్పయామి ॥\nసం సర్వాత్మికాయై నమః । సర్వోపచారాన్ సమర్పయామి ॥",
        "devanagari": "लं पृथिव्यात्मिकायै नमः । गन्धं समर्पयामि ॥\nहं आकाशात्मिकायै नमः । पुष्पं समर्पयामि ॥\nयं वाय्वात्मिकायै नमः। धूपं आघ्रापयामि ॥\nरं अग्न्यात्मिकायै नमः । दीपं दर्शयामि ॥\nवं अमृतात्मिकायै नमः । नैवेद्यं समर्पयामि ॥\nसं सर्वात्मिकायै नमः । सर्वोपचारान् समर्पयामि ॥"
      }
    },
    {
      "id": 13,
      "title": {
        "english": "Parivaara Devata Aahutis (Offerings to Associates)",
        "telugu": "పరివార దేవతా ఆహుతులు",
        "devanagari": "परिवार देवता आहुति"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "If you are in a hurry, you can make a single offering of ghee for all of Chandi's associate deities with the following short mantra."
            ],
            "telugu": [
              "మీరు తొందరలో ఉన్నట్లయితే, ఈ చిన్న మంత్రంతో చండీ పరివార దేవతలందరికీ నెయ్యితో ఒకే ఆహుతిని సమర్పించవచ్చు."
            ],
            "hindi": [
              "यदि आप जल्दी में हैं, तो आप निम्नलिखित संक्षिप्त मंत्र के साथ चंडी के सभी सहयोगी देवताओं के लिए घी की एक ही आहुति दे सकते हैं।"
            ]
          },
          "slokas": {
            "english": "Om yoginyaadibhyah chandikaa parivaara devataabhyo namah swaahaa ||",
            "telugu": "ఓం యోగిన్యాదిభ్యః చండికా పరివార దేవతాభ్యో నమః స్వాహా ॥",
            "devanagari": "ॐ योगिन्यादिभ्यः चण्डिका परिवार देवताभ्यो नमः स्वाहा ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "If you have more time, make individual offerings of ghee for each deity listed below, offering ghee each time 'swaahaa' is chanted."
            ],
            "telugu": [
              "మీకు ఎక్కువ సమయం ఉన్నట్లయితే, 'స్వాహా' అని జపించిన ప్రతిసారీ నెయ్యిని సమర్పిస్తూ, క్రింద ఇవ్వబడిన ప్రతి దేవతకు వ్యక్తిగత ఆహుతులను సమర్పించండి."
            ],
            "hindi": [
              "यदि आपके पास अधिक समय है, तो नीचे सूचीबद्ध प्रत्येक देवता के लिए घी की अलग-अलग आहुतियां दें, हर बार 'स्वाहा' का जाप करने पर घी अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "Om sooryaaya namah swaahaa | Om agnaye namah swaahaa | Om rudraaya namah swaahaa | Om chandraaya namah swaahaa | Om abbhyo namah swaahaa | Om gauryai namah swaahaa | Om mangalaaya namah swaahaa | Om prithivyai namah swaahaa | Om kshetrapaalakaaya namah swaahaa | Om budhaaya namah swaahaa | Om vishnave namah swaahaa | Om naaraayanaaya namah swaahaa | Om brihaspataye namah swaahaa | Om brahmane namah swaahaa | Om indraaya namah swaahaa | Om shukraaya namah swaahaa | Om indraanyai namah swaahaa | Om indramarutvantaaya namah swaahaa | Om shanaishcharaaya namah swaahaa | Om prajaapataye namah swaahaa | Om yamadharma raajaaya namah swaahaa | Om raahave namah swaahaa | Om gomaatre namah swaahaa | Om sarvebhyo namah swaahaa | Om ketave namah swaahaa | Om chitraguptaaya namah swaahaa | Om brahmane namah swaahaa | Om saraswatee brahmaabhyaam namah swaahaa | Om gauree rudraabhyaam namah swaahaa | Om lakshmee hrisheekeshaabhyaam namah swaahaa | Om ashtaadashabhujaayai mahaalakshmyai namah swaahaa | Om dashaananaayai mahaakaalyai namah swaahaa | Om ashtabhujaayai mahaasaraswatyai namah swaahaa | Nam nandaayai namah swaahaa | Ram raktadantikaayai namah swaahaa | Shaam shaakambharye namah swaahaa | Dum durgaayai namah swaahaa | Bheem bheemaayai namah swaahaa | Bhraam bhraamaryai namah swaahaa | Jam jayaayai namah swaahaa | Vim vijayaayai namah swaahaa | Jam jayantyai namah swaahaa | Am aparaajitaayai namah swaahaa | Om simhaaya namah swaahaa | Om mahishaaya namah swaahaa | Braam braahmyai namah swaahaa | Maam maaheshwaryai namah swaahaa | Kaum kaumaryai namah swaahaa | Vaim vaishnavyai namah swaahaa | Vaam vaaraahyai namah swaahaa | Naam naarasimhyai namah swaahaa | Aim aindryai namah swaahaa | Chaam chaamundaayai namah swaahaa | Am asitaanga bhairavaaya namah swaahaa | Rum ruru bhairavaaya namah swaahaa | Cham chanda bhairavaaya namah swaahaa | Krodham krodhana bhairavaaya namah swaahaa | Um unmatta bhairavaaya namah swaahaa | Kam kapaala bhairavaaya namah swaahaa | Bheem bheeshana bhairavaaya namah swaahaa | Sam samhaara bhairavaaya namah swaahaa | Om vishnumaayaayai namah swaahaa | Om chetanaayai namah swaahaa | Om buddhyai namah swaahaa | Om nidraayai namah swaahaa | Om kshudhaayai namah swaahaa | Om chhaayaayai namah swaahaa | Om shaktyai namah swaahaa | Om trishnaayai namah swaahaa | Om kshaantyai namah swaahaa | Om jaatyai namah swaahaa | Om lajjaayai namah swaahaa | Om shaantyai namah swaahaa | Om shraddhaayai namah swaahaa | Om kaantyai namah swaahaa | Om lakshmyai namah swaahaa | Om dhrityai namah swaahaa | Om vrittyai namah swaahaa | Om smrityai namah swaahaa | Om dayaayai namah swaahaa | Om tushtyai namah swaahaa | Om pushtyai namah swaahaa | Om maatre namah swaahaa | Om bhraantyai namah swaahaa | Om chityai namah swaahaa | Lam indraaya namah swaahaa | Ram agnyaye namah swaahaa | Mam yamaaya namah swaahaa | Ksham nirritaye namah swaahaa | Vam varunaaya namah swaahaa | Yam vaayave namah swaahaa | Sam somaaya namah swaahaa | Ham rudraaya namah swaahaa | Aam brahmane namah swaahaa | Hreem sheshaaya namah swaahaa | Vam vajraaya namah swaahaa | Sham shaktyai namah swaahaa | Dam dandaaya namah swaahaa | Kham khadgaaya namah swaahaa | Paam paashaaya namah swaahaa | Am ankushaaya namah swaahaa | Gam gadaayai namah swaahaa | Trim trishoolaaya namah swaahaa | Pam padmaaya namah swaahaa | Cham chakraaya namah swaahaa | Gam ganapataye namah swaahaa | Kshe kshetrapaalakaaya namah swaahaa | Vam vatukaaya namah swaahaa | Yom yogineebhyo namah swaahaa |",
            "telugu": "ఓం సూర్యాయ నమః స్వాహా। ఓం అగ్నయే నమః స్వాహా। ఓం రుద్రాయ నమః స్వాహా। ఓం చంద్రాయ నమః స్వాహా। ఓం అద్భ్యో నమః స్వాహా। ఓం గౌర్యై నమః స్వాహా। ఓం మంగళాయ నమః స్వాహా। ఓం పృథివ్యై నమః స్వాహా। ఓం క్షేత్రపాలకాయ నమః స్వాహా। ఓం బుధాయ నమః స్వాహా। ఓం విష్ణవే నమః స్వాహా। ఓం నారాయణాయ నమః స్వాహా। ఓం బృహస్పతయే నమః స్వాహా। ఓం బ్రహ్మణే నమః స్వాహా। ఓం ఇంద్రాయ నమః స్వాహా। ఓం శుక్రాయ నమః స్వాహా। ఓం ఇంద్రాణ్యై నమః స్వాహా। ఓం ఇంద్రమరుత్వంతాయ నమః స్వాహా। ఓం శనైశ్చరాయ నమః స్వాహా। ఓం ప్రజాపతయే నమః స్వాహా। ఓం యమధర్మరాజాయ నమః స్వాహా । ఓం రాహవే నమః స్వాహా। ఓం గోమాత్రే నమః స్వాహా। ఓం సర్వేభ్యో నమః స్వాహా । ఓం కేతవే నమః స్వాహా। ఓం చిత్రగుప్తాయ నమః స్వాహా। ఓం బ్రహ్మణే నమః స్వాహా। ఓం సరస్వతీ బ్రహ్మభ్యాం నమః స్వాహా। ఓం గౌరీరుద్రాభ్యాం నమః స్వాహా। ఓం లక్ష్మీ హృషీకేశాభ్యాం నమః స్వాహా। ఓం అష్టాదశభుజాయై మహాలక్ష్మ్యై నమః స్వాహా। ఓం దశాననాయై మహాకాళ్యై నమః స్వాహా। ఓం అష్టభుజాయై మహాసరస్వత్యై నమః స్వాహా । నం నందాయై నమః స్వాహా। రం రక్తదంతికాయై నమః స్వాహా। శాం శాకంభర్యే నమః స్వాహా। దుం దుర్గాయై నమః స్వాహా। భీం భీమాయై నమః స్వాహా। భ్రాం భ్రామర్యై నమః స్వాహా । జం జయాయై నమః స్వాహా। విం విజయాయై నమః స్వాహా। జం జయంత్యై నమః స్వాహా। అం అపరాజితాయై నమః స్వాహా। ॐ సింహాయ నమః స్వాహా। ॐ మహిషాయ నమః స్వాహా । బ్రాం బ్రాహ్మ్యై నమః స్వాహా। మాం మాహేశ్వర్యై నమః స్వాహా। కౌం కౌమార్యై నమః స్వాహా। వైం వైష్ణవ్యై నమః స్వాహా। వాం వారాహ్యై నమః స్వాహా। నాం నారసింహ్యై నమః స్వాహా। ఐం ఐంద్ర్యై నమః స్వాహా। చాం చాముండాయై నమః స్వాహా । అం అసిత్గాం భైరవాయ నమః స్వాహా। రం రురు భైరవాయ నమః స్వాహా। చం చండ భైరవాయ నమః స్వాహా। క్రోధం క్రోధన భైరవాయ నమః స్వాహా। ఉం ఉన్మత్త భైరవాయ నమః స్వాహా। కం కపాల భైరవాయ నమః స్వాహా। భీం భీషణ భైరవాయ నమః స్వాహా। సం సంహార భైరవాయ నమః స్వాహా । ఓం విష్ణుమాయాయై నమః స్వాహా। ఓం చేతనాయై నమః స్వాహా। ఓం బుద్ధ్యై నమః స్వాహా। ఓం నిద్రాయై నమః స్వాహా। ఓం క్షుధాయై నమః స్వాహా। ఓం ఛాయాయై నమః స్వాహా। ఓం శక్త్యై నమః స్వాహా। ఓం తృష్ణాయై నమః స్వాహా। ఓం క్షాంత్యై నమః స్వాహా। ఓం జాత్యై నమః స్వాహా। ఓం లజ్జాయై నమః స్వాహా। ఓం శాంత్యై నమః స్వాహా। ఓం శ్రద్ధాయై నమః స్వాహా। ఓం కాంత్యై నమః స్వాహా। ఓం లక్ష్మ్యై నమః స్వాహా। ఓం ధృత్యై నమః స్వాహా। ఓం వృత్త్యై నమః స్వాహా। ఓం స్మృత్యై నమః స్వాహా। ఓం దయాయై నమః స్వాహా। ఓం తుష్ట్యై నమః స్వాహా। ఓం పుష్ట్యై నమః స్వాహా। ఓం మాత్రే నమః స్వాహా। ఓం భ్రాంత్యై నమః స్వాహా। ఓం చిత్యై నమః స్వాహా । లం ఇంద్రాయ నమః స్వాహా। రం అగ్నయే నమః స్వాహా। మం యమాయ నమః స్వాహా। క్షం నిరృతయే నమః స్వాహా। వం వరుణాయ నమః స్వాహా। యం వాయవే నమః స్వాహా। సం సోమాయ నమః స్వాహా। హం రుద్రాయ నమః స్వాహా। ఆం బ్రహ్మణే నమః స్వాహా। హ్రీం శేషాయ నమః స్వాహా । వం వజ్రాయ నమః స్వాహా। శం శక్త్యై నమః స్వాహా। దం దండాయ నమః స్వాహా। ఖం ఖడ్గాయ నమః స్వాహా। పాం పాశాయ నమః స్వాహా। అం అంకుశాయ నమః స్వాహా। గం గదాయై నమః స్వాహా। త్రిం త్రిశూలాయ నమః స్వాహా। పం పద్మాయ నమః స్వాహా। చం చక్రాయ నమః స్వాహా । గం గణపతయే నమః స్వాహా। క్షే క్షేత్రపాలకాయ నమః స్వాహా। వం వటుకాయ నమః స్వాహా। యోం యోగినీభ్యో నమః స్వాహా।",
            "devanagari": "ॐ सूर्याय नमः स्वाहा। ॐ अग्नये नमः स्वाहा। ॐ रुद्राय नमः स्वाहा। ॐ चन्द्राय नमः स्वाहा। ॐ अब्भ्यो नमः स्वाहा। ॐ गौर्यै नमः स्वाहा। ॐ मंगळाय नमः स्वाहा। ॐ पृथिव्यै नमः स्वाहा। ॐ क्षेत्रपालकाय नमः स्वाहा। ॐ बुधाय नमः स्वाहा। ॐ विष्णवे नमः स्वाहा। ॐ नारायणाय नमः स्वाहा। ॐ बृहस्पतये नमः स्वाहा। ॐ ब्रह्मणे नमः स्वाहा। ॐ इन्द्राय नमः स्वाहा। ॐ शुक्राय नमः स्वाहा। ॐ इन्द्राण्यै नमः स्वाहा। ॐ इन्द्रमरुत्वन्ताय नमः स्वाहा। ॐ शनैश्चराय नमः स्वाहा। ॐ प्रजापतये नमः स्वाहा। ॐ यमधर्मराजाय नमः स्वाहा । ॐ राहवे नमः स्वाहा। ॐ गोमात्रे नमः स्वाहा। ॐ सर्वेभ्यो नमः स्वाहा । ॐ केतवे नमः स्वाहा। ॐ चित्रगुप्ताय नमः स्वाहा। ॐ ब्रह्मणे नमः स्वाहा। ॐ सरस्वती ब्रह्मभ्यां नमः स्वाहा। ॐ गौरीरुद्राभ्यां नमः स्वाहा। ॐ लक्ष्मी हृषीकेशाभ्यां नमः स्वाहा। ॐ अष्टादशभुजायै महालक्ष्म्यै नमः स्वाहा। ॐ दशाननायै महाकाळ्यै नमः स्वाहा। ॐ अष्टभुजायै महासरस्वत्यै नमः स्वाहा । नं नन्दायै नमः स्वाहा। रं रक्तदन्तिकायै नमः स्वाहा। शां शाकंभर्ये नमः स्वाहा। दुं दुर्गायै नमः स्वाहा। भीं भीमायै नमः स्वाहा। भ्रां भ्रामर्यै नमः स्वाहा । जं जयायै नमः स्वाहा। विं विजयायै नमः स्वाहा। जं जयंत्यै नमः स्वाहा। अं अपराजितायै नमः स्वाहा। ॐ सिंहाय नमः स्वाहा। ॐ महिषाय नमः स्वाहा । ब्रां ब्राह्मयै नमः स्वाहा। मां माहेश्वर्यै नमः स्वाहा। कौं कौमार्यै नमः स्वाहा। वैं वैष्णव्यै नमः स्वाहा। वां वाराद्यै नमः स्वाहा। नां नारसिंधै नमः स्वाहा। ऐं ऐंयै नमः स्वाहा। चां चामुण्डायै नमः स्वाहा । अं असितांग भैरवाय नमः स्वाहा। रुं रुरु भैरवाय नमः स्वाहा। चं चण्ड भैरवाय नमः स्वाहा। क्रोधं क्रोधन भैरवाय नमः स्वाहा। उं उन्मत्त भैरवाय नमः स्वाहा। कं कपाल भैरवाय नमः स्वाहा। भीं भीषण भैरवाय नमः स्वाहा। सं संहार भैरवाय नमः स्वाहा । ॐ विष्णुमायायै नमः स्वाहा। ॐ चेतनायै नमः स्वाहा। ॐ बुद्धयै नमः स्वाहा। ॐ निद्रायै नमः स्वाहा। ॐ क्षुधायै नमः स्वाहा। ॐ छायायै नमः स्वाहा। ॐ शत्क्त्यै नमः स्वाहा। ॐ तृष्णायै नमः स्वाहा। ॐ क्षांत्यै नमः स्वाहा। ॐ जात्यै नमः स्वाहा। ॐ लज्जायै नमः स्वाहा। ॐ शांत्यै नमः स्वाहा। ॐ श्रद्धायै नमः स्वाहा। ॐ कांत्यै नमः स्वाहा। ॐ लक्ष्म्यै नमः स्वाहा। ॐ धृत्यै नमः स्वाहा। ॐ वृत्यै नमः स्वाहा। ॐ स्मृत्यै नमः स्वाहा। ॐ दयायै नमः स्वाहा। ॐ तुष्टयै नमः स्वाहा। ॐ पुष्टयै नमः स्वाहा। ॐ मात्रे नमः स्वाहा। ॐ भ्रांत्यै नमः स्वाहा। ॐ चित्यै नमः स्वाहा । लं इंद्राय नमः स्वाहा। रं अग्न्यये नमः स्वाहा। मं यमाय नमः स्वाहा। क्षं निर्ऋतये नमः स्वाहा। वं वरुणाय नमः स्वाहा। यं वायवे नमः स्वाहा। सं सोमाय नमः स्वाहा। हं रुद्राय नमः स्वाहा। आं ब्रह्मणे नमः स्वाहा। ह्रीं शेषाय नमः स्वाहा । वं वज्राय नमः स्वाहा। शं शत्क्त्यै नमः स्वाहा। दं दण्डाय नमः स्वाहा। खं खड्गाय नमः स्वाहा। पां पाशाय नमः स्वाहा। अं अंकुशाय नमः स्वाहा। गं गदायै नमः स्वाहा। त्रिं त्रिशूलाय नमः स्वाहा। पं पद्माय नमः स्वाहा। चं चक्राय नमः स्वाहा । गं गणपतये नमः स्वाहा। क्षे क्षेत्रपालकाय नमः स्वाहा। वं वटुकाय नमः स्वाहा। यों योगिनीभ्यो नमः स्वाहा।"
          }
        }
      ]
    },
    {
      "id": 14,
      "title": {
        "english": "Main Homam",
        "telugu": "ప్రధాన హోమం",
        "hindi": "प्रधान होम"
      },
      "instructions": {
        "english": [
          "Introductory Parts: Read Kavacham without offerings. Read Argala and Keelakam, offering ghee with 'swaahaa' at the end of each verse. Read Ratri Sooktam without offerings. Optionally, chant the Moola Mantram (Navaarna Mantram) 12 to 108 times with ghee offerings.",
          "Thirteen Chapters: Read the 13 chapters of Durga Saptashati. At the end of each numbered verse, add 'swaahaa' and make an offering (ghee, sesame seeds, puffed rice, etc.).",
          "Concluding Formalities: After the 13 chapters, you may again chant the Moola Mantram with ghee offerings. Read Devi Sooktam without offerings. You can also offer mantras of other deities at this point."
        ],
        "telugu": [
          "పరిచయ భాగాలు: నైవేద్యాలు లేకుండా కవచం చదవండి. ప్రతి పద్యం చివర 'స్వాహా'తో నెయ్యిని సమర్పిస్తూ అర్గళ మరియు కీలకమ్ చదవండి. నైవేద్యాలు లేకుండా రాత్రి సూక్తం చదవండి. ఐచ్ఛికంగా, మూల మంత్రాన్ని (నవవర్ణ మంత్రం) 12 నుండి 108 సార్లు నెయ్యి నైవేద్యాలతో జపించండి.",
          "పదమూడు అధ్యాయాలు: దుర్గా సప్తశతిలోని 13 అధ్యాయాలను చదవండి. ప్రతి సంఖ్య గల పద్యం చివర, 'స్వాహా' అని చెప్పి నైవేద్యం (నెయ్యి, నువ్వులు, మరమరాలు మొదలైనవి) సమర్పించండి.",
          "ముగింపు లాంఛనాలు: 13 అధ్యాయాల తర్వాత, మీరు మళ్లీ నెయ్యి నైవేద్యాలతో మూల మంత్రాన్ని జపించవచ్చు. నైవేద్యాలు లేకుండా దేవి సూక్తం చదవండి. ఈ సమయంలో మీరు ఇతర దేవతల మంత్రాలను కూడా సమర్పించవచ్చు."
        ],
        "hindi": [
          "परिचयात्मक भाग: बिना आहुति के कवच पढ़ें। प्रत्येक श्लोक के अंत में 'स्वाहा' के साथ घी चढ़ाते हुए अर्गला और कीलकम् पढ़ें। बिना आहुति के रात्रि सूक्तम् पढ़ें। वैकल्पिक रूप से, घी की आहुति के साथ मूल मंत्र (नवार्ण मंत्र) का 12 से 108 बार जाप करें।",
          "तेरह अध्याय: दुर्गा सप्तशती के 13 अध्याय पढ़ें। प्रत्येक क्रमांकित श्लोक के अंत में, 'स्वाहा' जोड़ें और एक आहुति (घी, तिल, मुरमुरे, आदि) दें।",
          "समापन औपचारिकताएं: 13 अध्यायों के बाद, आप फिर से घी की आहुति के साथ मूल मंत्र का जाप कर सकते हैं। बिना आहुति के देवी सूक्तम् पढ़ें। आप इस समय अन्य देवताओं के मंत्र भी अर्पित कर सकते हैं।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "The slokas for this section are from the Durga Saptashati text (including Kavacham, Argala, Keelakam, Ratri Sooktam, the 13 chapters, and Devi Sooktam). Offerings are made as per the instructions.",
        "telugu": "ఈ విభాగానికి సంబంధించిన శ్లోకాలు దుర్గా సప్తశతి గ్రంథం నుండి తీసుకోబడ్డాయి (కవచం, అర్గళ, కీలకమ్, రాత్రి సూక్తం, 13 అధ్యాయాలు, మరియు దేవి సూక్తంతో సహా). సూచనల ప్రకారం నైవేద్యాలు సమర్పించబడతాయి.",
        "devanagari": "इस खंड के लिए श्लोक दुर्गा सप्तशती पाठ (कवचम्, अर्गला, कीलकम्, रात्रि सूक्तम्, 13 अध्याय और देवी सूक्तम् सहित) से हैं। निर्देशों के अनुसार आहुतियाँ दी जाती हैं।"
      }
    },
    {
      "id": 15,
      "title": {
        "english": "Worship Again",
        "telugu": "పునః పూజ",
        "hindi": "पुनः पूजा"
      },
      "instructions": {
        "english": [
          "After all mantra offerings, perform a quick worship again.",
          "Offer food (Naivedyam) to Chandi in the fire and idol.",
          "Offer camphor light (Neerajanam) by lighting a camphor piece and showing it to the fire.",
          "Get up and perform one or three clockwise circumambulations (pradakshinas) around the homa kundam."
        ],
        "telugu": [
          "అన్ని మంత్ర సమర్పణల తర్వాత, మళ్ళీ శీఘ్ర పూజ చేయండి.",
          "అగ్నిలో మరియు విగ్రహంలో చండీకి ఆహారాన్ని (నైవేద్యం) సమర్పించండి.",
          "ఒక కర్పూరం ముక్కను వెలిగించి అగ్నికి చూపడం ద్వారా కర్పూర కాంతిని (నీరాజనం) సమర్పించండి.",
          "లేచి హోమ కుండం చుట్టూ ఒకటి లేదా మూడు ప్రదక్షిణలు (ప్రదక్షిణలు) చేయండి."
        ],
        "hindi": [
          "सभी मंत्र आहुतियों के बाद, फिर से एक त्वरित पूजा करें।",
          "अग्नि और मूर्ति में चंडी को भोजन (नैवेद्य) अर्पित करें।",
          "कपूर का एक टुकड़ा जलाकर और उसे अग्नि को दिखाकर कपूर की रोशनी (नीराजनम्) अर्पित करें।",
          "उठो और होम कुंड के चारों ओर एक या तीन दक्षिणावर्त परिक्रमा (प्रदक्षिणा) करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om namashchandikaayai | Naivedyam samarpayaami ||\nOm namashchandikaayai | Neeraajanam samarpayaami ||",
        "telugu": "ఓం నమశ్చండికాయై । నైవేద్యం సమర్పయామి ॥\nఓం నమశ్చండికాయై । నీరాజనం సమర్పయామి ॥",
        "devanagari": "ॐ नमश्चण्डिकायै । नैवेद्यं समर्पयामि ॥\nॐ नमश्चण्डिकायै । नीराजनं समर्पयामि ॥"
      }
    },
    {
      "id": 16,
      "title": {
        "english": "Concluding Offerings",
        "telugu": "ఉత్తరాంగం",
        "hindi": "उत्तरांगम्"
      },
      "instructions": {
        "english": [
          "This section serves as a vote of thanks and seeks forgiveness for errors. Offer a drop of ghee at each 'swaahaa'.",
          "Offerings are made to Prajapati, the controllers of the three worlds (Agni for Bhuh, Vayu for Bhuvah, Surya for Suvah), and Agni Svishtakrit (the maker of good offerings).",
          "Perform praanaayaamam again.",
          "Make three more offerings to Agni for forgiveness.",
          "Make final offerings to Vishnu and Rudra.",
          "A shorter version is also provided for when you are in a hurry."
        ],
        "telugu": [
          "ఈ విభాగం కృతజ్ఞతలు తెలియజేయడానికి మరియు తప్పులకు క్షమాపణ కోరడానికి ఉపయోగపడుతుంది. ప్రతి 'స్వాహా' వద్ద ఒక చుక్క నెయ్యిని సమర్పించండి.",
          "ప్రజాపతికి, మూడు లోకాల నియంత్రకులకు (భూః కోసం అగ్ని, భువః కోసం వాయువు, సువః కోసం సూర్యుడు), మరియు అగ్ని స్విష్టకృత్‌కు (మంచి నైవేద్యాలు చేసేవాడు) నైవేద్యాలు సమర్పించబడతాయి.",
          "మళ్ళీ ప్రాణాయామం చేయండి.",
          "క్షమాపణ కోసం అగ్నికి మరో మూడు నైవేద్యాలు సమర్పించండి.",
          "విష్ణువు మరియు రుద్రునికి చివరి నైవేద్యాలు సమర్పించండి.",
          "మీరు తొందరలో ఉన్నప్పుడు ఒక చిన్న వెర్షన్ కూడా అందించబడింది."
        ],
        "hindi": [
          "यह खंड धन्यवाद ज्ञापन और त्रुटियों के लिए क्षमा मांगने का कार्य करता है। प्रत्येक 'स्वाहा' पर घी की एक बूंद अर्पित करें।",
          "प्रजापति, तीनों लोकों के नियंत्रकों (भूः के लिए अग्नि, भुवः के लिए वायु, सुवः के लिए सूर्य), और अग्नि स्विष्टकृत् (अच्छी आहुति देने वाले) को आहुति दी जाती है।",
          "फिर से प्राणायाम करें।",
          "क्षमा के लिए अग्नि को तीन और आहुतियाँ दें।",
          "विष्णु और रुद्र को अंतिम आहुति दें।",
          "जल्दी में होने पर एक छोटा संस्करण भी प्रदान किया गया है।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Long Version: Om prajaapate na tvadetaanyanyo vishwaa jaataani pari taa babhoova | yatkaamaaste juhumastanno astu vayam syaama patayo rayeenaam | swaahaa | prajaapataya idam na mama || Om bhooh swaahaa | agnaya idam na mama || Om bhuvah swaahaa | vaayava idam na mama || Om suvah swaahaa | sooryaayedam na mama || yadasya karmano'tyareericham yadvaanyoonamihaakaram | agnishtat svishtakridvidwaan sarvam svishtam suhutam karotu swaahaa | agnaye svishtakrita idam na mama || Om bhoorbhuvassuvah swaahaa | prajaapataya idam na mama || anaajnyaatam yadaajnyaatam yajnyasya kriyate mithu | agne tadasya kalpaya tvam hi vettha yathaatatham | swaahaa | agnaya idam na mama || purushasammito yajnyo yajnyah purushasammitah | agne tadasya kalpaya tvam hi vettha yathaatatham | swaahaa | agnaya idam na mama || yatpaakatraa manasaa deenadakshaa na | yajnyasya manvate martaasah | agnishtaddhotaa kratuvidvijaanan | yajishtho devaan ritusho yajaati | swaahaa | agnaya idam na mama || Om bhooh swaahaa | agnaya idam na mama || Om bhuvah swaahaa | vaayava idam na mama || Om suvah swaahaa | sooryaayedam na mama || asmin homakarmani madhye sambhaavita samasta mantralopa tantralopa kriyaalopa bhaktilopa shraddhaalopa niyamlopa nishthaalopa dravyalopaadi samasta dosha praayashchittaartham sarva praayashchittaahutim hoshyaami | Om bhoorbhuvassuvah swaahaa | prajaapataya idam na mama || Om shree vishnave swaahaa | vishnave paramaatmana idam na mama || Om namo rudraaya pashupataye swaahaa | rudraaya pashupataya idam na mama ||\nShort Version: Om bhooh swaahaa | agnaya idam na mama || Om bhuvah swaahaa | vaayava idam na mama || Om suvah swaahaa | sooryaayedam na mama || Om bhoorbhuvassuvah swaahaa | prajaapataya idam na mama || Om shree vishnave swaahaa | vishnave paramaatmana idam na mama || Om namo rudraaya pashupataye swaahaa | rudraaya pashupataya idam na mama ||",
        "telugu": "దీర్ఘ పద్ధతి: ఓం ప్రజాపతే న త్వదేతాన్యన్యో విశ్వా జాతాని పరి తా బభూవ । యత్కామాస్తే జుహుమస్తన్నో అస్తు వయం స్యామ పతయో రయీణాం। స్వాహా। ప్రజాపతయ ఇదం న మమ ॥ ఓం భూః స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా। వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా। సూర్యాయేదం న మమ ॥ యదస్య కర్మణోऽత్యరీరిచం యద్వాన్యూనమిహాకరం । అగ్నిష్టత్ స్విష్టకృద్విద్వాన్ సర్వం స్విష్టం సుహుతం కరోతు స్వాహా। అగ్నయే స్విష్టకృత ఇదం న మమ ॥ ఓం భూర్భువస్సువః స్వాహా। ప్రజాపతయ ఇదం న మమ ॥ అనాజ్ఞాతం యదాజ్ఞాతం యజ్ఞస్య క్రియతే మిథు। అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ । స్వాహా। అగ్నయ ఇదం న మమ ॥ పురుషసంమితో యజ్ఞో యజ్ఞః పురుషసంమితః। అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్। స్వాహా। అగ్నయ ఇదం న మమ ॥ యత్పాకత్రా మనసా దీనదక్షా న। యజ్ఞస్య మన్వతే మర్తాసః। అగ్నిష్టద్ధోతా క్రతువిద్విజానన్ । యజిష్ఠో దేవాన్  ऋतुशो యజాతి । స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భూః స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా । వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా। సూర్యాయేదం న మమ ॥ అస్మిన్ హోమకర్మణి మధ్యే సంభාවිත సమస్త మంత్రలోప తంత్రలోప క్రియాలోప భక్తిలోప శ్రద్ధాలోప నియమలోప నిష్ఠాలోప ద్రవ్యలోపాది సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తాహుతిం హోష్యామి। ఓం భూర్భువస్సువః స్వాహా। ప్రజాపతయ ఇదం న మమ ॥ ఓం శ్రీ విష్ణవే స్వాహా। విష్ణవే పరమాత్మన ఇదం న మమ ॥ ఓం నమో రుద్రాయ పశుపతయే స్వాహా। రుద్రాయ పశుపతయ ఇదం న మమ ॥\nచిన్న వెర్షన్: ఓం భూః స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా। వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా। సూర్యాయేదం న మమ ॥ ఓం భూర్భువస్సువః స్వాహా । ప్రజాపతయ ఇదం న మమ ॥ ఓం శ్రీ విష్ణవే స్వాహా। విష్ణవే పరమాత్మన ఇదం న మమ ॥ ఓం నమో రుద్రాయ పశుపతయే స్వాహా। రుద్రాయ పశుపతయ ఇదం న మమ ॥",
        "devanagari": "लंबा संस्करण: ॐ प्रजापते न त्वदेतान्यन्यो विश्वा जातानि परि ता बभूव । यत्कामास्ते जुहुमस्तन्नो अस्तु वयः स्याम पतयो रयीणाम्। स्वाहा। प्रजापतय इदं न मम ॥ ॐ भूः स्वाहा। अग्नय इदं न मम ॥ ॐ भुवः स्वाहा। वायव इदं न मम ॥ ॐ सुवः स्वाहा। सूययिदं न मम ॥ यदस्य कर्मणोऽत्यरीरिचं यद्वान्यूनमिहाकरम् । अग्निष्टत् स्विष्टकृद्विद्वान् सर्वं स्विष्टं सुहुतं करोतु स्वाहा। अग्नये स्विष्टकृत इदं न मम ॥ ॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥ अनाज्ञातं यदाज्ञातं यज्ञस्य क्रियते मिथु। अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम् । स्वाहा। अग्नय इदं न मम ॥ पुरुषसंमितो यज्ञो यज्ञः पुरुषसंमितः। अग्ने तदस्य कल्पय त्वং हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥ यत्पाकत्रा मनसा दीनदक्षा न। यज्ञस्य मन्वते मर्तासः। अग्निष्टद्धोता क्रतुविद्विजानन् । यजिष्ठो देवान् ऋतुशो यजाति । स्वाहा। अग्नय इदं न मम ॥ ॐ भूः स्वाहा। अग्नय इदं न मम ॥ ॐ भुवः स्वाहा । वायव इदं न मम ॥ ॐ सुवः स्वाहा। सूययिदं न मम ॥ अस्मिन् होमकर्मणि मध्ये संभावित समस्त मंत्रलोप तंत्रलोप क्रियालोप भक्तिलोप श्रद्धालोप नियमलोप निष्ठालोप द्रव्यलोपादि समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्ताहुतिं होष्यामि। ॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥ ॐ श्री विष्णवे स्वाहा। विष्णवे परमात्मन इदं न मम ॥ ॐ नμο रुद्राय पशुपतये स्वाहा। रुद्राय पशुपतय इदं न मम ॥\nसंक्षिप्त संस्करण: ॐ भूः स्वाहा। अग्नय इदं न मम ॥ ॐ भुवः स्वाहा। वायव इदं न मम ॥ ॐ सुवः स्वाहा। सूययिदं न मम ॥ ॐ भूर्भुवस्सुवः स्वाहा । प्रजापतय इदं न मम ॥ ॐ श्री विष्णवे स्वाहा। विष्णवे परमात्मन इदं न मम ॥ ॐ नμο रुद्राय पशुपतये स्वाहा। रुद्राय पशुपतय इदं न मम ॥"
      }
    },
    {
      "id": 17,
      "title": {
        "english": "Pure Rice Sacrifice",
        "telugu": "శుద్ధాన్న బలి",
        "hindi": "शुद्धान्न बलि"
      },
      "instructions": {
        "english": [
          "Offer a sacrifice (bali) to associated beings (paarshadas).",
          "Use cooked white rice, banana slices, or fruit slices.",
          "Place a small amount of the offering in six different places outside the homa kundam, following the order in the diagram.",
          "The offering locations are: East, West, North, South, and two more on the East side (north of the first one).",
          "Recite the mantra while offering the bali.",
          "The remaining rice/fruit used for bali should be thrown away and not consumed."
        ],
        "telugu": [
          "సంబంధిత జీవులకు (పార్షదులకు) బలి (త్యాగం) సమర్పించండి.",
          "ఉడికించిన తెల్ల అన్నం, అరటి ముక్కలు లేదా పండ్ల ముక్కలను ఉపయోగించండి.",
          "చిత్రంలోని క్రమాన్ని అనుసరించి, హోమ కుండం వెలుపల ఆరు వేర్వేరు ప్రదేశాలలో చిన్న మొత్తంలో నైవేద్యాన్ని ఉంచండి.",
          "నైవేద్య స్థానాలు: తూర్పు, పడమర, ఉత్తరం, దక్షిణం మరియు తూర్పు వైపు మరో రెండు (మొదటి దాని ఉత్తరాన).",
          "బలిని సమర్పిస్తున్నప్పుడు మంత్రాన్ని పఠించండి.",
          "బలి కోసం ఉపయోగించిన మిగిలిన అన్నం/పండ్లను పారవేయాలి మరియు తినకూడదు."
        ],
        "hindi": [
          "संबद्ध प्राणियों (पार्षदों) को बलि (बलिदान) अर्पित करें।",
          "पके हुए सफेद चावल, केले के टुकड़े या फलों के टुकड़ों का उपयोग करें।",
          "आरेख में दिए गए क्रम का पालन करते हुए, होम कुंड के बाहर छह अलग-अलग स्थानों पर थोड़ी मात्रा में प्रसाद रखें।",
          "प्रसाद के स्थान हैं: पूर्व, पश्चिम, उत्तर, दक्षिण, और पूर्व की ओर दो और (पहले वाले के उत्तर में)।",
          "बलि चढ़ाते समय मंत्र का जाप करें।",
          "बलि के लिए उपयोग किए गए शेष चावल/फल को फेंक देना चाहिए और उसका सेवन नहीं करना चाहिए।"
        ]
      },
      "slokas": {
        "english": "Om paarshadebhyo namah | Balim samarpayaami |",
        "telugu": "ఓం పార్షదేభ్యో నమః। బలిం సమర్పయామి ।",
        "devanagari": "ॐ पार्षदेभ्यो नमः। बलिं समर्पयामि ।"
      },
      "diagram": "/diagrams/parsha-bali.svg"
    },
    {
      "id": 18,
      "title": {
        "english": "Stream of Excellence",
        "telugu": "వసోర్ధారా",
        "hindi": "वसोर्धारा"
      },
      "instructions": {
        "english": [
          "Take a ladleful of ghee and pour it in a slow, continuous stream onto the burning coconut pieces in the homa kundam.",
          "While pouring the ghee, recite the third verse from 'Rudra Chamakam'."
        ],
        "telugu": [
          "ఒక గరిటెడు నెయ్యి తీసుకుని, హోమ కుండంలోని కాలుతున్న కొబ్బరి ముక్కలపై నెమ్మదిగా, నిరంతరాయంగా ధారగా పోయండి.",
          "నెయ్యి పోస్తున్నప్పుడు, 'రుద్ర చమకం' నుండి మూడవ శ్లోకాన్ని పఠించండి."
        ],
        "hindi": [
          "एक करछुल घी लें और उसे होम कुंड में जलते हुए नारियल के टुकड़ों पर धीमी, निरंतर धारा में डालें।",
          "घी डालते समय, 'रुद्र चमकम्' से तीसरे श्लोक का पाठ करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om sham cha me mayashcha me priyam cha me'nukaamashcha me kaamashcha me saumanasashcha me bhadram cha me shreyashcha me vasyashcha me yashashcha me bhagashcha me dravinam cha me yantaa cha me dhartaa cha me kshemashcha me dhritishcha me vishvam cha me mahashcha me samvichcha me jnaatram cha me sooshcha me prasooshcha me seeram cha me layashcha ma ritam cha me'mritam cha me'yakshmam cha me'naamayamcha me jeevaatushcha me deerghaayutvam cha me'namitram cha me'bhayam cha me sugam cha me shayanam cha me sooshaa cha me sudinam cha me ||",
        "telugu": "ఓం శం చ మే మయశ్చ మే ప్రియం చ మేऽనుకామశ్చ మే కామశ్చ మే సౌమనసశ్చ మే భద్రం చ మే శ్రేయశ్చ మే వస్యశ్చ మే యశశ్చ మే భగశ్చ మే ద్రవిణం చ మే యంతా చ మే ధర్తా చ మే క్షేమశ్చ మే ధృతిశ్చ మే విశ్వం చ మే మహశ్చ మే సంవిచ్చ మే జ్ఞాత్రం చ మే సూశ్చ మే ప్రసూశ్చ మే సీరం చ మే లయశ్చ మఋతం చ మేऽమృతం చ మేऽయక్ష్మం చ మేऽనామయచ్చ మే జీవాతుశ్చ మే దీర్ఘాయుత్వం చ మేऽనమిత్రం చ మేऽభయం చ మే సుగం చ మే శయనం చ మే సూషా చ మే సుదినం చ మే ॥",
        "devanagari": "ॐ शं च मे मयश्च मे प्रियं च मेऽनुकामश्च मे कामश्च मे सौमनसश्च मे भद्रं च मे श्रेयश्च मे वस्यश्च मे यशश्च मे भगश्च मे द्रविणं च मे यन्ता च मे धर्ता च मे क्षेमश्च मे धृतिश्च मे विश्वं च मे महश्च मे संविच्च मे ज्ञात्रं च मे सूश्च मे प्रसूश्च मे सीरं च मे लयश्च मऋतं च मेऽमृतं च मेऽयक्ष्मं च मेऽनामयच्च मे जीवातुश्च मे दीर्घायुत्वं च मेऽनमित्रं च मेऽभयं च मे सुगं च मे शयनं च मे सूषा च मे सुदिनं च मे ॥"
      }
    },
    {
      "id": 19,
      "title": {
        "english": "Complete Offering",
        "telugu": "పూర్ణాహుతి",
        "hindi": "पूर्णाहुति"
      },
      "instructions": {
        "english": [
          "Prepare the 'poornaahuti' (complete offering). This is typically a dry coconut half (or a full coconut) filled with a coin, turmeric, sandalwood, kumkum, akshatas, and samples of other offered materials.",
          "Place the poornaahuti on a wooden ladle.",
          "Recite the mantras for poornaahuti.",
          "Carefully place the poornaahuti into the fire. This act symbolizes the complete surrender of one's ego.",
          "While or after placing it, recite the 'Brahmaarpanam' mantra, contemplating complete surrender to the Divine."
        ],
        "telugu": [
          "'పూర్ణాహుతి' (పూర్తి నైవేద్యం) సిద్ధం చేయండి. ఇది సాధారణంగా ఒక నాణెం, పసుపు, గంధం, కుంకుమ, అక్షతలు మరియు ఇతర సమర్పించిన వస్తువుల నమూనాలతో నింపిన ఎండిన కొబ్బరి సగం (లేదా పూర్తి కొబ్బరికాయ).",
          "పూర్ణాహుతిని చెక్క గరిటెపై ఉంచండి.",
          "పూర్ణాహుతి కోసం మంత్రాలను పఠించండి.",
          "పూర్ణాహుతిని జాగ్రత్తగా అగ్నిలో ఉంచండి. ఈ చర్య ఒకరి అహంకారం యొక్క పూర్తి సమర్పణను సూచిస్తుంది.",
          "దానిని ఉంచుతున్నప్పుడు లేదా ఉంచిన తర్వాత, దైవానికి పూర్తి సమర్పణను ధ్యానిస్తూ 'బ్రహ్మార్పణం' మంత్రాన్ని పఠించండి."
        ],
        "hindi": [
          "'पूर्णाहुति' (पूर्ण आहुति) तैयार करें। यह आम तौर पर एक सूखा नारियल का आधा हिस्सा (या एक पूरा नारियल) होता है जिसमें एक सिक्का, हल्दी, चंदन, कुमकुम, अक्षत और अन्य अर्पित सामग्रियों के नमूने भरे होते हैं।",
          "पूर्णाहुति को एक लकड़ी के करछुल पर रखें।",
          "पूर्णाहुति के लिए मंत्रों का पाठ करें।",
          "पूर्णाहुति को सावधानी से अग्नि में रखें। यह क्रिया किसी के अहंकार के पूर्ण समर्पण का प्रतीक है।",
          "इसे रखते समय या रखने के बाद, परमात्मा के प्रति पूर्ण समर्पण का चिंतन करते हुए 'ब्रह्मार्पणम्' मंत्र का पाठ करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om poornaahutimuttamaam juhoti | Sarvam vai poornaahutih | Sarvamevaapnoti | Atho iyam vai poornaahutih | Asyaameva pratitishthati ||\nOm poornamadah poornamidam poornaatpoornamudachyate | Poornasya poornamaadaaya poornamevaavashishyate ||\nOm aim hreem kleem chaamundaayai vichche vaushat ||\nOm brahmaarpanam brahmahavir brahmaagnau brahmanaa hutam | Brahmaiva tena gantavyam brahma karma samaadhinaa ||",
        "telugu": "ఓం పూర్ణాహుతిముత్తమాం జుహోతి । సర్వం వై పూర్ణాహుతిః । సర్వమేవాప్నోతి । అథో ఇయం వై పూర్ణాహుతిః । అస్యామేవ ప్రతితిష్ఠతి ॥\nఓం పూర్ణమదః పూర్ణమిదం పూర్ణాత్పూర్ణముదచ్యతే । పూర్ణస్య పూర్ణమాదాయ పూర్ణమేవావశిష్యతే ॥\nఓం ఐం హ్రీం క్లీం చాముండాయై విచ్చే వౌషట్ ॥\nఓం బ్రహ్మార్పణం బ్రహ్మహవిర్ బ్రహ్మాగ్నౌ బ్రహ్మణా హుతం । బ్రహ్మైవ తేన గంతవ్యం బ్రహ్మ కర్మ సమాధినా ॥",
        "devanagari": "ॐ पूर्णाहुतिमुत्तमां जुहोति । सर्वं वै पूर्णाहुतिः । सर्वमेवाप्नोति । अथो इयं वै पूर्णाहुतिः । अस्यामेव प्रतितिष्ठति ॥\nॐ पूर्णमदः पूर्णमिदं पूर्णात्पूर्णमुदच्यते । पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते ॥\nॐ ऐं ह्रीं क्लीं चामुण्डायै विच्चे वौषट् ॥\nॐ ब्रह्मार्पणं ब्रह्महविर् ब्रह्माग्नौ ब्रह्मणा हुतं । ब्रह्मैव तेन गन्तव्यм ब्रह्म कर्म समाधिना ॥"
      }
    },
    {
      "id": 20,
      "title": {
        "english": "Winding Up and Meditation",
        "telugu": "ముగింపు మరియు ధ్యానం",
        "hindi": "समापन और ध्यान"
      },
      "instructions": {
        "english": [
          "Make one final offering of ghee to Agni with the 'Sapta te agne' mantra.",
          "Sprinkle water around the homa kundam again as you did at the beginning, but using the four new 'Anvamansthaah' mantras.",
          "As the poornaahuti burns, sit still with a straight back and meditate. This is considered the most potent time for meditation during the ritual.",
          "Focus on your favorite deity or mantra for at least 5-10 minutes."
        ],
        "telugu": [
          "'సప్త తే అగ్నే' మంత్రంతో అగ్నికి చివరిగా నెయ్యిని సమర్పించండి.",
          "ప్రారంభంలో చేసినట్లుగా మళ్ళీ హోమ కుండం చుట్టూ నీటిని చల్లుకోండి, కానీ నాలుగు కొత్త 'అన్వమంస్థాః' మంత్రాలను ఉపయోగించి.",
          "పూర్ణాహుతి కాలుతున్నప్పుడు, నిటారుగా కూర్చుని ధ్యానం చేయండి. ఆచార సమయంలో ధ్యానానికి ఇది అత్యంత శక్తివంతమైన సమయంగా పరిగణించబడుతుంది.",
          "కనీసం 5-10 నిమిషాల పాటు మీకు ఇష్టమైన దేవత లేదా మంత్రంపై దృష్టి పెట్టండి."
        ],
        "hindi": [
          "'सप्त ते अग्ने' मंत्र के साथ अग्नि को घी की एक अंतिम आहुति दें।",
          "होम कुंड के चारों ओर फिर से पानी छिड़कें जैसा कि आपने शुरुआत में किया था, लेकिन चार नए 'अन्वमंस्थाः' मंत्रों का उपयोग करते हुए।",
          "जैसे ही पूर्णाहुति जलती है, सीधी पीठ करके बैठें और ध्यान करें। इसे अनुष्ठान के दौरान ध्यान के लिए सबसे शक्तिशाली समय माना जाता है।",
          "कम से कम 5-10 मिनट के लिए अपने पसंदीदा देवता या मंत्र पर ध्यान केंद्रित करें।"
        ]
      },
      "diagram": "/diagrams/agni-pratisthapana-4-dirs.svg",
      "slokas": {
        "english": "Sapta te agne samidhah saptajihvaah sapta rishayassaptah dhaama priyaani | Sapta hotraa sapta dhaatvaa yajantisaptayoneeraaprinaswaa ghritena swaahaa | Agnaye saptavata idam na mama ||\nAdite'nvamansthaah | Anumate'nvamansthaah | Sarasvate'nvamansthaah | Deva savitah praasaaveeh |",
        "telugu": "సప్త తే అగ్నే సమిధః సప్తజిహ్వాః సప్త ఋషయస్సప్తః ధామ ప్రియాణి । సప్త హోత్రా సప్త ధాత్వా యజంతిసప్తయోనీరాపృణస్వా ఘృతేన స్వాహా। అగ్నయే సప్తవత ఇదం న మమ ॥\nఅదితేऽన్వమంస్థాః। అనుమతేऽన్వమంస్థాః। సరస్వతేऽన్వమంస్థాః। దేవ సవితః ప్రాసావీః ।",
        "devanagari": "सप्त ते अग्ने समिधः सप्तजिह्वाः सप्त ऋषयस्सप्तः धाम प्रियाणि । सप्त होत्रा सप्त धात्वा यजन्तिसप्तयोनीरापृणस्वा घृतेन स्वाहा। अग्नये सप्तवत इदं न मम ॥\nअदितेऽन्वमंस्थाः। अनुमतेऽन्वमंस्थाः। सरस्वतेऽन्वमंस्थाः। देव सवितः प्रासावीः ।"
      }
    },
    {
      "id": 21,
      "title": {
        "english": "Protection Ash",
        "telugu": "రక్షా",
        "hindi": "रक्षा"
      },
      "instructions": {
        "english": [
          "Take the darbhas that were placed on the western boundary of the homa kundam.",
          "Apply a little ghee to them and light their tips in the fire.",
          "Remove them from the fire and let them burn completely in a separate container.",
          "The resulting black ash is called 'rakshaa' (protection).",
          "Apply a little rakshaa to the idol's forehead, then to your own forehead and others for protection. It can be stored for future use."
        ],
        "telugu": [
          "హోమ కుండం యొక్క పశ్చిమ సరిహద్దులో ఉంచిన దర్భలను తీసుకోండి.",
          "వాటికి కొద్దిగా నెయ్యి రాసి, వాటి చివరలను అగ్నిలో వెలిగించండి.",
          "వాటిని అగ్ని నుండి తీసివేసి, వేరే పాత్రలో పూర్తిగా కాలిపోయేలా చేయండి.",
          "ఫలితంగా వచ్చే నల్ల బూడిదను 'రక్ష' (రక్షణ) అంటారు.",
          "విగ్రహం యొక్క నుదుటిపై, ఆపై రక్షణ కోసం మీ నుదుటిపై మరియు ఇతరుల నుదుటిపై కొద్దిగా రక్షను పూయండి. భవిష్యత్ ఉపయోగం కోసం నిల్వ చేయవచ్చు."
        ],
        "hindi": [
          "होम कुंड की पश्चिमी सीमा पर रखे गए दर्भों को लें।",
          "उन पर थोड़ा घी लगाएं और उनके सिरों को आग में जलाएं।",
          "उन्हें आग से हटा दें और उन्हें एक अलग पात्र में पूरी तरह से जलने दें।",
          "परिणामी काली राख को 'रक्षा' (सुरक्षा) कहा जाता है।",
          "मूर्ति के माथे पर, फिर सुरक्षा के लिए अपने माथे और दूसरों के माथे पर थोड़ी रक्षा लगाएं। इसे भविष्य में उपयोग के लिए संग्रहीत किया जा सकता है।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "No specific slokas are mentioned for this step.",
        "telugu": "ఈ దశకు నిర్దిష్ట శ్లోకాలు పేర్కొనబడలేదు.",
        "hindi": "इस चरण के लिए किसी विशिष्ट श्लोक का उल्लेख नहीं किया गया है।"
      }
    },
    {
      "id": 22,
      "title": {
        "english": "Farewell",
        "telugu": "ఉద్వాసన",
        "hindi": "उद्वासन"
      },
      "instructions": {
        "english": [
          "Take darbhas and flowers/akshatas in your hands.",
          "Touch the sides of the homakundam, then touch the idol, transferring the energy from the fire to the idol.",
          "Recite the mantra to send Sri Mahaganapathi from the fire back into your heart.",
          "Recite the mantra to send Sri Chandika from the fire and idol back into your heart.",
          "Recite the final mantra to say goodbye to Agni, the fire god, and bow to him."
        ],
        "telugu": [
          "చేతుల్లో దర్భలు మరియు పువ్వులు/అక్షతలు తీసుకోండి.",
          "హోమకుండం యొక్క వైపులా తాకి, ఆపై విగ్రహాన్ని తాకి, అగ్ని నుండి శక్తిని విగ్రహానికి బదిలీ చేయండి.",
          "శ్రీ మహాగణపతిని అగ్ని నుండి మీ హృదయంలోకి తిరిగి పంపడానికి మంత్రాన్ని పఠించండి.",
          "శ్రీ చండికను అగ్ని మరియు విగ్రహం నుండి మీ హృదయంలోకి తిరిగి పంపడానికి మంత్రాన్ని పఠించండి.",
          "అగ్ని దేవుడైన అగ్నికి వీడ్కోలు చెప్పడానికి చివరి మంత్రాన్ని పఠించి, అతనికి నమస్కరించండి."
        ],
        "hindi": [
          "अपने हाथों में दर्भ और फूल/अक्षत लें।",
          "होमकुंड के किनारों को स्पर्श करें, फिर मूर्ति को स्पर्श करें, अग्नि से ऊर्जा को मूर्ति में स्थानांतरित करें।",
          "श्री महागणपति को अग्नि से अपने हृदय में वापस भेजने के लिए मंत्र का पाठ करें।",
          "श्री चंडिका को अग्नि और मूर्ति से अपने हृदय में वापस भेजने के लिए मंत्र का पाठ करें।",
          "अग्नि देव को विदाई देने के लिए अंतिम मंत्र का पाठ करें और उन्हें प्रणाम करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Asmaadagneh shreemahaaganapatim yathaasthanam pratishthaapayaami ||\nAsmaanmoorteshcha agneshcha shree chandikaadeveem yathaasthanam pratishthaapayaami ||\nAgne naya supathaa raaye asmaan vishwaani deva vayunaani vidwaan | Yuyodhyasmajjuhuraanameno bhooyishthaam te nama uktim vidhema | Agnaye namah ||",
        "telugu": "అస్మాదగ్నేః శ్రీమహాగణపతిం యథాస్థానం ప్రతిష్ఠాపయామి ॥\nఅస్మాన్మూర్తేశ్చ అగ్నేశ్చ శ్రీ చండికాదేవీం యథాస్థానం ప్రతిష్ఠాపయామి ॥\nఅగ్నే నయ సుపథా రాయే అస్మాన్ విశ్వాని దేవ వయునాని విద్వాన్ । యుయోధ్యస్మజ్జుహురాణమేనో భూయిష్ఠాం తే నమ ఉక్తిం విధేమ । అగ్నయే నమః ॥",
        "devanagari": "अस्मादग्नेः श्रीमहागणपतिं यथास्थानं प्रतिष्ठापयामि ॥\nअस्मान्मूर्तेश्च अग्नेश्च श्री चण्डिकादेवीं यथास्थानं प्रतिष्ठापयामि ॥\nअग्ने नय सुपथा राये अस्मान् विश्वानि देव वयुनानि विद्वान् । युयोध्यस्मज्जुहुराणमेनो भूयिष्ठां ते नम उक्तिं विधेम । अग्नये नमः ॥"
      }
    },
    {
      "id": 23,
      "title": {
        "english": "Conclusion",
        "telugu": "ముగింపు",
        "hindi": "निष्कर्ष"
      },
      "instructions": {
        "english": [
          "Recite the verses to ask for forgiveness for any deficiencies in mantra, action, or devotion, praying that the homam be considered complete.",
          "Remember that remembering Sri Krishna is the greatest penance for all shortcomings.",
          "Surrender all actions performed by body, speech, mind, senses, intellect, or nature to the Supreme Being, Narayana.",
          "Recite the final prayer that the Divine Mother, Sri Chandika, be pleased with the homam.",
          "Surrender the entire act to Sri Krishna and conclude with three peace chants (Shantih)."
        ],
        "telugu": [
          "మంత్రం, చర్య లేదా భక్తిలో ఏవైనా లోపాలకు క్షమాపణ కోరుతూ శ్లోకాలను పఠించండి, హోమం సంపూర్ణంగా పరిగణించబడాలని ప్రార్థించండి.",
          "అన్ని లోపాలకు శ్రీ కృష్ణుడిని స్మరించుకోవడమే గొప్ప తపస్సు అని గుర్తుంచుకోండి.",
          "శరీరం, వాక్కు, మనస్సు, ఇంద్రియాలు, బుద్ధి లేదా ప్రకృతి ద్వారా చేసిన అన్ని చర్యలను పరమాత్మ నారాయణునికి సమర్పించండి.",
          "ఈ హోమంతో దివ్య మాత శ్రీ చండిక ప్రసన్నం కావాలని చివరి ప్రార్థనను పఠించండి.",
          "మొత్తం చర్యను శ్రీ కృష్ణునికి సమర్పించి, మూడు శాంతి మంత్రాలతో (శాంతిః) ముగించండి."
        ],
        "hindi": [
          "मंत्र, क्रिया या भक्ति में किसी भी कमी के लिए क्षमा मांगने के लिए श्लोकों का पाठ करें, यह प्रार्थना करते हुए कि होम को पूर्ण माना जाए।",
          "याद रखें कि सभी कमियों के लिए श्री कृष्ण का स्मरण सबसे बड़ा तप है।",
          "शरीर, वाणी, मन, इंद्रियों, बुद्धि या प्रकृति द्वारा किए गए सभी कार्यों को परमात्मा, नारायण को समर्पित करें।",
          "अंतिम प्रार्थना का पाठ करें कि दिव्य माता, श्री चंडिका, होम से प्रसन्न हों।",
          "संपूर्ण कार्य श्री कृष्ण को समर्पित करें और तीन शांति मंत्रों (शांतिः) के साथ समाप्त करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Mantraheenam kriyaaheenam bhaktiheenam hutaashana | Yadhbhutam tu mayaa deva paripoorna tadastu te ||\nPraayashchittaanyasheshaani tapah karmaatmakaani vai | Yaani teshaamasheshaanaam shree krishnasmaranam param || Shree krishna krishna krishna ||\nKaayena vaachaa manasendriyairvaa buddhyaatmanaa vaa prakriteh swabhaavaat | Karomi yadyat sakalam parasmai naaraayanaayeti samarpayaami ||\nAnena divya mangala homena bhagavatee sarvaatmikaa shree chandikaadevee preeyataam | Om tatsat | Sarvam shree krishnaarpanamastu | Om shaantih shaantih shaantih ||",
        "telugu": "మంత్రహీనం క్రియాహీనం భక్తిహీనం హుతాశన । యద్భుతం తు మయా దేవ పరిపూర్ణ తదస్తు తే ॥\nప్రాయశ్చిత్తాన్యశేషాణి తపః కర్మాత్మకాని వై। యాని తేషామశేషాణాం శ్రీ కృష్ణస్మరణం పరం ॥ శ్రీ కృష్ణ కృష్ణ కృష్ణ ॥\nకాయేన వాచా మనసేంద్రియైర్వా బుద్ధ్యాత్మనా వా ప్రకృతేః స్వభావాత్। కరోమి యద్యత్ సకలం పరస్మై నారాయణాయేతి సమర్పయామి ॥\nఅనేన దివ్య మంగళ హోమేన భగవతీ సర్వాత్మికా శ్రీ చండికాదేవీ ప్రీయతామ్ । ఓం తత్సత్। సర్వం శ్రీ కృష్ణార్పణమస్తు । ఓం శాంతిః శాంతిః శాంతిః ॥",
        "devanagari": "मंत्रहीनं क्रियाहीनं भक्तिहीनं हुताशन । यद्भुतं तु मया देव परिपूर्ण तदस्तु ते ॥\nप्रायश्चित्तान्यशेषाणि तपः कर्मात्मकानि वै। यानि तेषामशेषाणां श्री कृष्णस्मरणं परं ॥ श्री कृष्ण कृष्ण कृष्ण ।\nकायेन वाचा मनसेन्द्रियैर्वा बुद्ध्यात्मना वा प्रकृतेः स्वभावात्। करोमि यद्यत् सकलं परस्मै नारायणायेति समर्पयामि ॥\nअनेन दिव्य मंगळ होमेन भगवती सर्वात्मिका श्री चण्डिकादेवी प्रीयताम् । ॐ तत्सत्। सर्वम् श्री कृष्णार्पणमस्तु । ॐ शान्तिः शान्तिः शान्तिः ।"
      }
    },
    {
      "id": 24,
      "title": {
        "english": "Sixteen-Service Worship",
        "telugu": "షోడశోపచార పూజ (అనుబంధం ఎ)",
        "hindi": "षोडशोपचार पूजा (परिशिष्ट ए)"
      },
      "instructions": {
        "english": [
          "This is an elaborate, optional worship with 16 services. Perform each step by reciting the mantra and imagining the action.",
          "1. Asanam: Offer a seat.",
          "2. Paadyam: Wash the feet.",
          "3. Arghyam: Wash the hands.",
          "4. Aachamaniyam: Offer water for sipping.",
          "5. Snanam: Give a bath.",
          "6. Vastraani: Offer clothes.",
          "7. Yajnopaveetam: Offer the sacred thread.",
          "8. Aabharanaani: Offer jewelry.",
          "9. Gandhaan: Offer scents (sandalwood, turmeric, kumkum).",
          "10. Pushpaani: Offer flowers.",
          "11. Dhoopam: Offer incense.",
          "12. Deepam: Offer a lamp.",
          "13. Naivedyam: Offer food and taamboolam (paan).",
          "14. Karpoora Neerajanam: Offer camphor light.",
          "15. Mantrapushpam: Offer a flower with mantras.",
          "16. Pradakshina Namaskaran: Offer circumambulation and prostrations."
        ],
        "telugu": [
          "ఇది 16 సేవలతో కూడిన విస్తృతమైన, ఐచ్ఛిక పూజ. మంత్రాన్ని పఠిస్తూ, చర్యను ఊహించుకుంటూ ప్రతి దశను చేయండి.",
          "1. ఆసనం: ఆసనాన్ని సమర్పించండి.",
          "2. పాద్యం: పాదాలను కడగండి.",
          "3. అర్ఘ్యం: చేతులను కడగండి.",
          "4. ఆచమనీయం: ఆచమనం కోసం నీటిని సమర్పించండి.",
          "5. స్నానం: స్నానం చేయించండి.",
          "6. వస్త్రాణి: వస్త్రాలను సమర్పించండి.",
          "7. యజ్ఞోపవీతం: యజ్ఞోపవీతాన్ని సమర్పించండి.",
          "8. ఆభరణాని: ఆభరణాలను సమర్పించండి.",
          "9. గంధాన్: సుగంధాలను (గంధం, పసుపు, కుంకుమ) సమర్పించండి.",
          "10. పుష్పాణి: పువ్వులను సమర్పించండి.",
          "11. ధూపం: ధూపాన్ని సమర్పించండి.",
          "12. దీపం: దీపాన్ని సమర్పించండి.",
          "13. నైవేద్యం: ఆహారం మరియు తాంబూలం (పాన్) సమర్పించండి.",
          "14. కర్పూర నీరాజనం: కర్పూర కాంతిని సమర్పించండి.",
          "15. మంత్రపుష్పం: మంత్రాలతో పువ్వును సమర్పించండి.",
          "16. ప్రదక్షిణ నమస్కారాన్: ప్రదక్షిణ మరియు నమస్కారాలను సమర్పించండి."
        ],
        "hindi": [
          "यह 16 सेवाओं के साथ एक विस्तृत, वैकल्पिक पूजा है। प्रत्येक चरण को मंत्र का पाठ करके और क्रिया की कल्पना करके करें।",
          "1. आसनम्: आसन अर्पित करें।",
          "2. पाद्यम्: पैर धोएं।",
          "3. अर्घ्यम्: हाथ धोएं।",
          "4. आचमनीयम्: आचमन के लिए जल अर्पित करें।",
          "5. स्नानम्: स्नान कराएं।",
          "6. वस्त्राणि: वस्त्र अर्पित करें।",
          "7. यज्ञोपवीतम्: यज्ञोपवीत अर्पित करें।",
          "8. आभरणानि: आभूषण अर्पित करें।",
          "9. गन्धान्: सुगंध (चंदन, हल्दी, कुमकुम) अर्पित करें।",
          "10. पुष्पाणि: फूल अर्पित करें।",
          "11. धूपम्: धूप अर्पित करें।",
          "12. दीपम्: दीपक अर्पित करें।",
          "13. नैवेद्यम्: भोजन और ताम्बूलम् (पान) अर्पित करें।",
          "14. कर्पूर नीराजनम्: कपूर की रोशनी अर्पित करें।",
          "15. मंत्रपुष्पम्: मंत्रों के साथ फूल अर्पित करें।",
          "16. प्रदक्षिण नमस्कारान्: परिक्रमा और प्रणाम अर्पित करें।"
        ]
      },
      "diagram_placeholder": "No diagram for this section.",
      "slokas": {
        "english": "Om namashchandikaayai | Aasanam samarpayaami ||\nOm namashchandikaayai | Paadayoh paadyam samarpayaami ||\nOm namashchandikaayai | Hastayoh arghyam samarpayaami ||\nOm namashchandikaayai | Mukhe shuddhaachamaneeyam samarpayaami ||\nOm namashchandikaayai | Snapayaami | Snaanaanantaram aachamaneeyam samarpayaami ||\nOm namashchandikaayai | Vastraani dhaarayaami ||\nOm namashchandikaayai | Yajnopaveetam samarpayaami ||\nOm namashchandikaayai | Aabharanaani samarpayaami ||\nOm namashchandikaayai | Gandhaan dhaarayaami | Haridraa kunkumam samarpayaami | Akshataan samarpayaami ||\nOm namashchandikaayai | Pushpaani samarpayaami ||\nOm namashchandikaayai | Dhoopam aaghraapayaami ||\nOm namashchandikaayai | Deepam darshayaami | Aachamaneeyam samarpayaami ||\nOm namashchandikaayai | Naivedyam samarpayaami | Taamboolam samarpayaami ||\nOm namashchandikaayai | Karpooraneeraajanam samarpayaami ||\nOm namashchandikaayai | Mantrapushpam samarpayaami ||\nOm namashchandikaayai | Pradakshina namaskaaraan samarpayaami ||",
        "telugu": "ఓం నమశ్చండికాయై । ఆసనం సమర్పయామి ॥\nఓం నమశ్చండికాయై । పాదయోః పాద్యం సమర్పయామి ॥\nఓం నమశ్చండికాయై । హస్తయోః అర్ఘ్యం సమర్పయామి ॥\nఓం నమశ్చండికాయై । ముఖే శుద్ధాచమనీయం సమర్పయామి ॥\nఓం నమశ్చండికాయై । స్నపయామి। స్నానానంతరం ఆచమనీయం సమర్పయామి ॥\nఓం నమశ్చండికాయై । వస్త్రాణి ధారయామి ॥\nఓం నమశ్చండికాయై । యజ్ఞోపవీతం సమర్పయామి ॥\nఓం నమశ్చండికాయై । ఆభరణాని సమర్పయామి ॥\nఓం నమశ్చండికాయై । గంధాన్ ధారయామి। హరిద్రా కుంకుమం సమర్పయామి। అక్షతాన్ సమర్పయామి ॥\nఓం నమశ్చండికాయై । పుష్పాణి సమర్పయామి ॥\nఓం నమశ్చండికాయై । ధూపం ఆఘ్రాపయామి।\nఓం నమశ్చండికాయై । దీపం దర్శయామి। ఆచమనీయం సమర్పయామి ॥\nఓం నమశ్చండికాయై । నైవేద్యం సమర్పయామి । తాంబూలం సమర్పయామి ॥\nఓం నమశ్చండికాయై । కర్పూరనీరాజనం సమర్పయామి ॥\nఓం నమశ్చండికాయై । మంత్రపుష్పం సమర్పయామి ॥\nఓం నమశ్చండికాయై । ప్రదక్షిణ నమస్కారాన్ సమర్పయామి ॥",
        "devanagari": "ॐ नमश्चण्डिकायै । आसनं समर्पयामि ॥\nॐ नमश्चण्डिकायै । पादयोः पाद्यं समर्पयामि ॥\nॐ नमश्चण्डिकायै । हस्तयोः अर्घ्यं समर्पयामि ॥\nॐ नमश्चण्डिकायै । मुखे शुद्धाचमनीयं समर्पयामि ॥\nॐ नमश्चण्डिकायै । स्नपयामि। स्नानानन्तरं आचमनीयं समर्पयामि ॥\nॐ नमश्चण्डिकायै । वस्त्राणि धारयामि ॥\nॐ नमश्चण्डिकायै । यज्ञोपवीतं समर्पयामि ॥\nॐ नमश्चण्डिकायै । आभरणानि समर्पयामि ॥\nॐ नमश्चण्डिकायै । गन्धान् धारयामि। हरिद्रा कुंकुमं समर्पयामि। अक्षतान् समर्पयामि ॥\nॐ नमश्चण्डिकायै । पुष्पाणि समर्पयामि ॥\nॐ नमश्चण्डिकायै । धूपं आघ्रापयामि।\nॐ नमश्चण्डिकायै । दीपं दर्शयामि। आचमनीयं समर्पयामि ॥\nॐ नमश्चण्डिकायै । नैवेद्यं समर्पयामि । ताम्बूलं समर्पयामि ॥\nॐ नमश्चण्डिकायै । कर्पूरनीराजनं समर्पयामि ॥\nॐ नमश्चण्डिकायै । मन्त्रपुष्पं समर्पयामि ॥\nॐ नमश्चण्डिकायै । प्रदक्षिण नमस्कारान् समर्पयामि ॥"
      }
    }
  ]
}

