{
  "title": {
    "english": "MahaGanapathi Homam",
    "telugu": "మహాగణపతి హోమం",
    "hindi": "शिव होम"
  },
  "author": {
    "english": "P V R Narasimha Rao",
    "telugu": "P V R Narasimha Rao",
    "hindi": "P V R Narasimha Rao"
  },
  "source": "https://vedicastrologer.org/homa/regular/ganapati_r_sans-.pdf",
  "sections": [
      {
      "id": 0,
      "title": {
        "english": "Introduction",
        "telugu": "పరిచయం",
        "devanagari": "परिचय"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Welcome to the Sri Maha Ganapathi Homam manual. This guide provides a simplified procedure suitable for everyone.",
              "A homam (fire ritual) is a sacred Vedic practice where offerings are made to the fire while chanting mantras. The fire acts as a medium to carry our prayers and offerings to the divine.",
              "Lord Ganesha resides in the mooladhara chakra, governing material prosperity, and is also the gatekeeper to higher spiritual realms. For this reason, it is recommended to pray to Ganesha before any other deity.",
              "This homam is highly beneficial as it facilitates spiritual progress while protecting the material aspects of one's life.",
              "This procedure is intended for spiritual upliftment. Please proceed with an attitude of surrender."
            ],
            "telugu": [
              "శ్రీ మహాగణపతి హోమం మార్గదర్శినికి స్వాగతం. ఈ గైడ్ అందరికీ అనువైన సరళీకృత విధానాన్ని అందిస్తుంది.",
              "హోమం అనేది మంత్రాలను జపిస్తూ అగ్నికి నైవేద్యాలు సమర్పించే ఒక పవిత్ర వైదిక ఆచారం. అగ్ని మన ప్రార్థనలను మరియు నైవేద్యాలను దైవానికి చేరవేసే మాధ్యమంగా పనిచేస్తుంది.",
              "గణేశుడు మూలాధార చక్రంలో నివసిస్తాడు, భౌతిక శ్రేయస్సును పాలిస్తాడు మరియు ఉన్నత ఆధ్యాత్మిక రంగాలకు కూడా ద్వారపాలకుడు. ఈ కారణంగా, ఏ ఇతర దేవతను ప్రార్థించే ముందు గణేశుడిని ప్రార్థించాలని శాస్త్రములలో ఘంటాపథముగా చెప్పబడి ఉంది.",
              "ఈ హోమం చాలా ప్రయోజనకరమైనది, ఎందుకంటే ఇది ఒకరి జీవితంలోని భౌతిక అంశాలను కాపాడుతూ ఆధ్యాత్మిక పురోగతిని సులభతరం చేస్తుంది.",
              "ఈ విధానం ఆధ్యాత్మిక ఉన్నతి కోసం ఉద్దేశించబడింది. మీరు పూర్తి భక్తి భావంతో ఈ మార్గంలో ముందుకు సాగండి."
            ],
            "hindi": [
              "श्री महा गणपति होम नियमावली में आपका स्वागत है। यह गाइड सभी के लिए उपयुक्त एक सरलीकृत प्रक्रिया प्रदान करता है।",
              "होम एक पवित्र वैदिक प्रथा है जिसमें मंत्रों का जाप करते हुए अग्नि को आहुति दी जाती है। अग्नि हमारी प्रार्थनाओं और आहुतियों को परमात्मा तक पहुंचाने का माध्यम बनती है।",
              "भगवान गणेश मूलाधार चक्र में निवास करते हैं, जो भौतिक समृद्धि को नियंत्रित करता है, और उच्च आध्यात्मिक क्षेत्रों के द्वारपाल भी हैं। इसी कारण से, किसी भी अन्य देवता की प्रार्थना करने से पहले गणेश की प्रार्थना करने की सिफारिश की जाती है।",
              "यह होम अत्यधिक लाभकारी है क्योंकि यह व्यक्ति के जीवन के भौतिक पहलुओं की रक्षा करते हुए आध्यात्मिक प्रगति की सुविधा प्रदान करता है।",
              "यह प्रक्रिया आध्यात्मिक उत्थान के लिए है। कृपया समर्पण की भावना के साथ आगे बढ़ें।"
            ]
          },
          "slokas": {
            "english": "Om Sri MahaaGanapathaye Namah ।Om Sri Gurubhyo Namah ।Om Rishibhyo Namah ।",
            "telugu": "ఓం శ్రీ మహాగణపతయే నమః ।ఓం శ్రీ గురుభ్యో నమః ।ఓం ఋషిభ్యో నమః ।",
            "devanagari": "ॐ श्री महागणपतये नमः ।ॐ श्री गुरुभ्यो नमः ।ॐ ऋषिभ्यो नमः ।"
          }
        }
      ]
    },
      {
        "id": 1,
        "title": {
          "english": "Anujnaa",
          "telugu": "అనుజ్ఞ",
          "devanagari": "अनुज्ञा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Before starting the homam, think in your mind of Mother Earth who is bearing you, Lord Ganesha who removes obstacles, your ishta devata (favorite deity), your parents, the rishis of your gothra (if you know them), all the rishis and all your gurus.",
                "Then say the following, while mentally requesting all the gods to co-operate with your homam."
              ],
              "telugu": [
                "హోమం ప్రారంభించే ముందు, మిమ్మల్ని భరిస్తున్న భూమి తల్లి, అడ్డంకులను తొలగించే గణేశుడు, మీ ఇష్ట దేవత, మీ తల్లిదండ్రులు, మీ గోత్ర ఋషులు (మీకు తెలిస్తే), ఋషులందరూ మరియు మీ గురువులందరినీ మనస్సులో స్మరించుకోండి.",
                "ఆ తర్వాత, మీ హోమానికి సహకరించమని దేవతలందరినీ మానసికంగా అభ్యర్థిస్తూ ఈ క్రింది వాటిని చెప్పండి."
              ],
              "hindi": [
                "होम शुरू करने से पहले, अपने मन में पृथ्वी माता का ध्यान करें जो आपको धारण करती है, भगवान गणेश जो बाधाओं को दूर करते हैं, आपके इष्ट देवता, आपके माता-पिता, आपके गोत्र के ऋषि (यदि आप उन्हें जानते हैं), सभी ऋषि और आपके सभी गुरु।",
                "फिर, अपने होम में सहयोग करने के लिए सभी देवताओं से मानसिक रूप से अनुरोध करते हुए निम्नलिखित कहें।"
              ]
            },
            "slokas": {
              "english": "Om R^iddhyaasma havyairnamasopasadya ।mitram devam mitradheyam no astu । anooraadhaan havishaa vardhayantah । shatam jeevema sharadah saveeraah ।",
              "telugu": "ఓం ఋద్ధ్యాస్మ హవ్యైర్నమసోపసద్య । మిత్రం దేవం మిత్రధేయం నో అస్తు । అనూరాధాన్ హవిషా వర్ధయంతః । శతం జీవేమ శరదః సవీరాః ।",
              "devanagari": "ॐ ऋद्धयास्म हव्यैर्नमसोपसद्य । मित्रं देवं मित्रधेयं नो अस्तु । अनूराधान् हविषा वर्धयन्तः । शतं जीवेम शरदः सवीराः ।"
            }
          },
          {
            "instructions": {
              "english": [
                "If you have a 'pavitram' (a ring made of darbha or a special metal ring), wear it now on your right hand ring finger. If not, you can use any ring you have after praying to your ishta devata, or simply move on."
              ],
              "telugu": [
                "మీ దగ్గర 'పవిత్రం' (దర్భతో చేసిన ఉంగరం లేదా ప్రత్యేక లోహపు ఉంగరం) ఉంటే, దానిని ఇప్పుడు మీ కుడి చేతి ఉంగరపు వేలికి ధరించండి. లేకపోతే, మీ ఇష్ట దేవతను ప్రార్థించిన తర్వాత మీ దగ్గర ఉన్న ఏదైనా ఉంగరాన్ని ఉపయోగించవచ్చు, లేదా ఏమీ లేకుండా కొనసాగించవచ్చు."
              ],
              "hindi": [
                "यदि आपके पास 'पवित्रम्' (दर्भ से बनी अंगूठी या एक विशेष धातु की अंगूठी) है, तो इसे अब अपने दाहिने हाथ की अनामिका उंगली में पहनें।यदि नहीं, तो आप अपने इष्ट देवता से प्रार्थना करने के बाद अपनी किसी भी अंगूठी का उपयोग कर सकते हैं, या बस आगे बढ़ सकते हैं।"
              ]
            }
          }
        ]
      },
      {
        "id": 2,
        "title": {
          "english": "Aachamanam",
          "telugu": "ఆచమనం",
          "devanagari": "आचमनम्"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Take a little water from the tumbler into your right hand with a spoon and drink it after saying the first mantra.",
                "Repeat this for the second and third mantras.",
                "Imagine that Vishnu, who is within you, is receiving the water."
              ],
              "telugu": [
                "గ్లాసు నుండి కొద్దిగా నీటిని చెంచాతో మీ కుడి చేతిలోకి తీసుకుని మొదటి మంత్రాన్ని చెప్పిన తర్వాత త్రాగండి.",
                "రెండవ మరియు మూడవ మంత్రాల కోసం దీనిని పునరావృతం చేయండి.",
                "మీలో ఉన్న విష్ణువు ఆ నీటిని స్వీకరిస్తున్నట్లుగా భావించండి."
              ],
              "hindi": [
                "गिलास से थोड़ा सा जल चम्मच से अपने दाहिने हाथ में लें और पहला मंत्र बोलने के बाद उसे पी लें।",
                "दूसरे और तीसरे मंत्र के लिए इसे दोहराएं।",
                "कल्पना करें कि आपके भीतर जो विष्णु हैं, वे उस जल को ग्रहण कर रहे हैं।"
              ]
            },
            "slokas": {
              "english": "om keśavāya svāhā ।om nārāyaṇāya svāhā ।om mādhavāya svāhā ।",
              "telugu": "ఓం కేశవాయ స్వాహా ।ఓం నారాయణాయ స్వాహా ।ఓం మాధవాయ స్వాహా ।",
              "devanagari": "ॐ केशवाय स्वाहा ।\nॐ नारायणाय स्वाहा ।\nॐ माधवाय स्वाहा ।"
            }
          }
        ]
      },
      {
        "id": 3,
        "title": {
          "english": "Vighneswara Pooja",
          "telugu": "విఘ్నేశ్వర పూజ",
          "devanagari": "विघ्नेश्वर पूजा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "To ensure there are no obstacles in the pooja, we must pray to Ganesha at the beginning. Read the following verses."
              ],
              "telugu": [
                "పూజలో ఎలాంటి ఆటంకాలు కలగకుండా ఉండాలంటే ముందుగా గణేశుడిని ప్రార్థించాలి. ఈ క్రింది శ్లోకాలను చదవండి."
              ],
              "hindi": [
                "पूजा में कोई बाधा न आए, इसके लिए हमें शुरुआत में गणेश जी की प्रार्थना करनी होगी।निम्नलिखित श्लोकों को पढ़ें।"
              ]
            },
            "slokas": {
              "english": "śuklāmbaradharam vişnum śaśivarņam caturbhujam prasannavadanam dhyāyet sarva vighnopaśāntaye॥agajānana padmärkam gajānanamaharniśam anekadam tam bhaktānām ekadantam upāsmahe॥vakratunda mahākāya koțisūryasamaprabha nirvighnam kuru me deva sarvakāryeşu sarvadā ॥",
              "telugu": "శుక్లాంబరధరం విష్ణుం శశివర్ణం చతుర్భుజం ప్రసన్నవదనం ధ్యాయేత్ సర్వ విఘ్నోపశాంతయే॥ అగజానన పద్మార్కం గజాననమహర్నిశం అనేకదం తం భక్తానాం ఏకదంతం ఉపాస్మహే॥ వక్రతుండ మహాకాయ కోటిసూర్యసమప్రభ నిర్విఘ్నం కురు మే దేవ సర్వకార్యేషు సర్వదా ॥",
              "devanagari": "शुक्लाम्बरधरं विष्णुं शशिवर्णं चतुर्भुजम् प्रसन्नवदनं ध्यायेत् सर्वविघ्नोपशान्तये॥\nअगजाननपद्मार्कं गजाननमहर्निशम् अनेकदं तं भक्तानामेकदन्तमुपास्महे॥\nवक्रतुण्ड महाकाय कोटिसूर्यसमप्रभ निर्विघ्नं कुरु मे देव सर्वकार्येषु सर्वदा ॥"
            }
          },
          {
            "instructions": {
              "english": [
                "Pray within your mind to Ganesha to remove all obstacles from your homam."
              ],
              "telugu": [
                "మీ హోమం నుండి అన్ని అడ్డంకులను తొలగించమని మీ మనస్సులో గణేశుడిని ప్రార్థించండి."
              ],
              "hindi": [
                "अपने मन में गणेश जी से प्रार्थना करें कि वे आपके होम से सभी बाधाओं को दूर करें।"
              ]
            }
          }
        ]
      },
      {
        "id": 4,
        "title": {
          "english": "Praanaayaamam",
          "telugu": "ప్రాణాయామం",
          "devanagari": "प्राणायाम"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Take some akshatas in your left palm and place it on your left lap. Hold your nostrils with your right hand.",
                "Close the left nostril, and while gently breathing in through the right nostril, mentally recite one of the mantras below.",
                "Close the right nostril, retain the breath, and mentally recite the mantra again.",
                "Open the left nostril and recite the mantra a third time while breathing out.",
                "Breathe in through the left nostril while reciting the mantra a fourth time.",
                "Close the left nostril, retain the breath, and recite the mantra a fifth time.",
                "Finally, open the right nostril and breathe out while reciting the mantra a sixth time."
              ],
              "telugu": [
                "కొన్ని అక్షతలను మీ ఎడమ అరచేతిలో తీసుకుని దానిని మీ ఎడమ ఒడిలో ఉంచండి. మీ కుడి చేతితో ముక్కును పట్టుకోండి.",
                "ఎడమ నాసికను మూసి, కుడి నాసిక ద్వారా నెమ్మదిగా శ్వాస తీసుకుంటూ, క్రింది మంత్రాలలో ఒకదాన్ని మానసికంగా జపించండి.",
                "కుడి నాసికను మూసి, శ్వాసను నిలిపి, మళ్ళీ మంత్రాన్ని మానసికంగా జపించండి.",
                "ఎడమ నాసికను తెరిచి, శ్వాసను వదులుతూ మూడవసారి మంత్రాన్ని జపించండి.",
                "ఎడమ నాసిక ద్వారా శ్వాస తీసుకుంటూ నాలుగవసారి మంత్రాన్ని జపించండి.",
                "ఎడమ నాసికను మూసి, శ్వాసను నిలిపి, ఐదవసారి మంత్రాన్ని జపించండి.",
                "చివరగా, కుడి నాసికను తెరిచి, శ్వాసను వదులుతూ ఆరవసారి మంత్రాన్ని జపించండి."
              ],
              "hindi": [
                "कुछ अक्षत अपनी बाईं हथेली में लें और उसे अपनी बाईं गोद में रखें।अपने दाहिने हाथ से अपनी नाक को पकड़ें।",
                "बाईं नासिका को बंद करें, और दाहिनी नासिका से धीरे-धीरे सांस लेते हुए, नीचे दिए गए मंत्रों में से एक का मानसिक रूप से जाप करें।",
                "दाहिनी नासिका को बंद करें, सांस रोकें, और फिर से मानसिक रूप से मंत्र का जाप करें।",
                "बाईं नासिका खोलें और सांस छोड़ते हुए तीसरी बार मंत्र का जाप करें।",
                "बाईं नासिका से सांस लेते हुए चौथी बार मंत्र का जाप करें।",
                "बाईं नासिका को बंद करें, सांस रोकें, और पांचवीं बार मंत्र का जाप करें।",
                "अंत में, दाहिनी नासिका खोलें और सांस छोड़ते हुए छठी बार मंत्र का जाप करें।"
              ]
            },
            "slokas": {
              "english": "om namo bhagavate väsudevāya ।om namaśśivāya ।om gam ganapataye namaḥ ।",
              "telugu": "ఓం నమో భగవతే వాసుదేవాయ ।ఓం నమశ్శివాయ ।ఓం గం గణపతయే నమః ।",
              "devanagari": "ॐ नमो भगवते वासुदेवाय ।ॐ नमश्शिवाय ।ॐ गं गणपतये नमः ।"
            }
          }
        ]
      },
      {
        "id": 5,
        "title": {
          "english": "Sankalpam",
          "telugu": "సంకల్పం",
          "devanagari": "संकल्प"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Declare your intention to perform the homam. Transfer the akshatas to your right hand. Place your closed right hand (containing akshatas) on your open left palm.",
                "Mentally affirm that you are performing this homa to the best of your ability to please Maha Ganapathi, and recite the following:"
              ],
              "telugu": [
                "హోమం చేయాలనే మీ ఉద్దేశాన్ని ప్రకటించండి. అక్షతలను మీ కుడి చేతికి బదిలీ చేయండి. మీ మూసిన కుడి చేతిని (అక్షతలు ఉన్న) మీ తెరిచిన ఎడమ అరచేతిపై ఉంచండి.",
                "మహా గణపతిని ప్రసన్నం చేసుకోవడానికి మీ శక్తి మేరకు ఈ హోమం చేస్తున్నారని మానసికంగా ధృవీకరించుకుని, ఈ క్రింది వాటిని పఠించండి:"
              ],
              "hindi": [
                "होम करने के अपने इरादे की घोषणा करें।अक्षत को अपने दाहिने हाथ में स्थानांतरित करें।अपनी बंद दाहिनी हथेली (जिसमें अक्षत हैं) को अपनी खुली बाईं हथेली पर रखें।",
                "मानसिक रूप से पुष्टि करें कि आप महा गणपति को प्रसन्न करने के लिए अपनी पूरी क्षमता से यह होम कर रहे हैं, और निम्नलिखित का पाठ करें:"
              ]
            },
            "slokas": {
              "english": "om mamopātta samasta duritakşayadvārā śrī parameśvara prītyartham śrī mahāganapati prasāda siddhyartham adya śubhadine śubhamuhūrte śrī mahāganapati homakarma yathāśakti karişye",
              "telugu": "ఓం మమోపాత్త సమస్త దురితక్షయద్వారా శ్రీ పరమేశ్వర ప్రీత్యర్థం శ్రీ మహాగణపతి ప్రసాద సిద్ధ్యర్థం అద్య శుభదినే శుభముహూర్తే శ్రీ మహాగణపతి హోమకర్మ యథాశక్తి కరిష్యే",
              "devanagari": "ॐ ममोपात्त समस्त दुरितक्षयद्वारा श्री परमेश्वर प्रीत्यर्थं श्री महागणपति प्रसाद सिद्ध्यर्थम् अद्य शुभदिने शुभमुहूर्ते श्री महागणपति होमकर्मा यथाशक्ति करिष्ये"
            }
          },
          {
            "instructions": {
              "english": [
                "After reciting, leave the akshatas in front of the homa kundam or the idol and sprinkle a little water on your palms."
              ],
              "telugu": [
                "పఠించిన తరువాత, అక్షతలను హోమ కుండం లేదా విగ్రహం ముందు వదిలి, మీ అరచేతులపై కొద్దిగా నీరు చల్లుకోండి."
              ],
              "hindi": [
                "पाठ करने के बाद, अक्षत को होम कुंड या मूर्ति के सामने छोड़ दें और अपनी हथेलियों पर थोड़ा पानी छिड़कें।"
              ]
            }
          }
        ]
      },
      {
        "id": 6,
        "title": {
          "english": "Kalasa Suddhi",
          "telugu": "కలశ శుద్ధి",
          "devanagari": "कलश शुद्धि"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Place a few akshatas and a flower in the tumbler of water. To purify the water, chant the following syllable 11 times."
              ],
              "telugu": [
                "నీటి గ్లాసులో కొన్ని అక్షతలు మరియు ఒక పువ్వు ఉంచండి. నీటిని శుద్ధి చేయడానికి, ఈ క్రింది అక్షరాన్ని 11 సార్లు జపించండి."
              ],
              "hindi": [
                "पानी के गिलास में कुछ अक्षत और एक फूल रखें।पानी को शुद्ध करने के लिए, निम्नलिखित अक्षर का 11 बार जाप करें।"
              ]
            },
            "slokas": {
              "english": "vam",
              "telugu": "వం",
              "devanagari": "वं"
            }
          },
          {
            "instructions": {
              "english": [
                "Now, recite the following mantra to invoke the auspicious essence of the world's sacred rivers into the water."
              ],
              "telugu": [
                "ఇప్పుడు, ప్రపంచంలోని పవిత్ర నదుల శుభ సారాన్ని నీటిలోకి ఆవాహన చేయడానికి ఈ క్రింది మంత్రాన్ని పఠించండి."
              ],
              "hindi": [
                "अब, दुनिया की पवित्र नदियों के शुभ सार को जल में आमंत्रित करने के लिए निम्नलिखित मंत्र का पाठ करें।"
              ]
            },
            "slokas": {
              "english": "gange ca yamune caiva godāvari sarasvati ।narmade sindhu kaveri jale'smin sannidhim kuru ॥ amṛtaṁ bhavatu",
              "telugu": "గంగే చ యమునే చైవ గోదావరి సరస్వతి ।నర్మదే సింధు కావేరి జలేస్మిన్ సన్నిధిం కురు ॥ అమృతం భవతు",
              "devanagari": "गङ्गे च यमुने चैव गोदावरि सरस्वति ।नर्मदे सिन्धु कावेरि जलेऽस्मिन् सन्निधिं कुरु ॥ अमृतं भवतु"
            }
          },
          {
            "instructions": {
              "english": [
                "Take a little of the purified water and sprinkle it on yourself, the homa kundam, the idol, and all the materials to be used in the homam.",
                "With a darbha grass, draw six lines on the base of the homa kundam in the order shown, reciting the corresponding mantra for each line."
              ],
              "telugu": [
                "శుద్ధి చేసిన నీటిని కొద్దిగా తీసుకుని, మీ మీద, హోమ కుండం మీద, విగ్రహం మీద మరియు హోమంలో ఉపయోగించాల్సిన అన్ని వస్తువుల మీద చల్లుకోండి.",
                "ఒక దర్భ గడ్డితో, హోమ కుండం అడుగున చూపిన క్రమంలో ఆరు గీతలు గీయండి, ప్రతి గీతకు సంబంధించిన మంత్రాన్ని పఠిస్తూ."
              ],
              "hindi": [
                "थोड़ा सा शुद्ध जल लें और उसे अपने ऊपर, होम कुंड पर, मूर्ति पर और होम में उपयोग होने वाली सभी सामग्रियों पर छिड़कें।",
                "एक दर्भ घास से, होम कुंड के आधार पर दिखाए गए क्रम में छह रेखाएँ खींचें, प्रत्येक रेखा के लिए संबंधित मंत्र का पाठ करते हुए।"
              ]
            },
            "slokas": {
              "english": "om brahmane namaḥ ।om yamāya namaḥ ।om somāya namaḥ ।om rudrāya namaḥ ।om vişnave namaḥ ।om indrāya namaḥ ।",
              "telugu": "ఓం బ్రహ్మణే నమః ।ఓం యమాయ నమః ।ఓం సోమాయ నమః ।ఓం రుద్రాయ నమః ।ఓం విష్ణవే నమః ।ఓం ఇంద్రాయ నమః ।",
              "devanagari": "ॐ ब्रह्मणे नमः ।ॐ यमाय नमः ।ॐ सोमाय नमः ।ॐ रुद्राय नमः ।ॐ विष्णवे नमः ।ॐ इन्द्राय नमः ।"
            },
            "diagram": "/diagrams/homa-kundam-6-lines.svg"
          }
        ]
      },
      {
        "id": 7,
        "title": {
          "english": "Agni Pratishthaapana",
          "telugu": "అగ్ని ప్రతిష్ఠాపన",
          "devanagari": "अग्नि प्रतिष्ठापन"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Place one darbha inside the homa kundam with its tip facing east. Place another with its tip facing north.",
                "Light a piece of camphor from the lamp and place it in the middle of the homa kundam while reciting the following mantra."
              ],
              "telugu": [
                "ఒక దర్భను హోమ కుండం లోపల దాని కొన తూర్పు వైపు ఉండేలా ఉంచండి. మరొకదాన్ని దాని కొన ఉత్తరం వైపు ఉండేలా ఉంచండి.",
                "దీపం నుండి ఒక కర్పూరం ముక్కను వెలిగించి, ఈ క్రింది మంత్రాన్ని పఠిస్తూ హోమ కుండం మధ్యలో ఉంచండి."
              ],
              "hindi": [
                "एक दर्भ को होम कुंड के अंदर रखें जिसका सिरा पूर्व की ओर हो।दूसरा रखें जिसका सिरा उत्तर की ओर हो।",
                "दीपक से कपूर का एक टुकड़ा जलाएं और निम्नलिखित मंत्र का पाठ करते हुए इसे होम कुंड के बीच में रखें।"
              ]
            },
            "slokas": {
              "english": "om bhūrbhuvassuvarom",
              "telugu": "ఓం భూర్భువస్సువరోం",
              "devanagari": "ॐ भूर्भुवस्सुवरोम्"
            }
          },
          {
            "instructions": {
              "english": [
                "Place dry coconut pieces or wood over the burning camphor to build the fire. Then, pray to the fire god (Agni), requesting him to carry the offerings to the gods in his auspicious form, 'jaatavedas'."
              ],
              "telugu": [
                "అగ్నిని రాజేయడానికి మండుతున్న కర్పూరంపై ఎండు కొబ్బరి ముక్కలు లేదా సమిధను ఉంచండి. ఆ తర్వాత, అగ్ని దేవుడిని ప్రార్థించండి, మీ నైవేద్యాలను దేవతలకు తన శుభ రూపమైన 'జాతవేదస్' రూపంలో చేరవేయమని కోరండి."
              ],
              "hindi": [
                "आग बनाने के लिए जलते हुए कपूर के ऊपर सूखे नारियल के टुकड़े या लकड़ी रखें।फिर, अग्नि देव से प्रार्थना करें, उनसे अनुरोध करें कि वे देवताओं को अपने शुभ रूप, 'जातवेदस्' में आहुतियाँ पहुँचाएँ।"
              ]
            },
            "slokas": {
              "english": "kravyādamagnim prahinomi dūram yamarājño gacchatu ripravāhaḥ ।ihaivāyamitaro jātavedā devebhyo havyam vahatu prajānan ।",
              "telugu": "క్రవ్యాదమగ్నిం ప్రహిణోమి దూరం యమరాజ్ఞో గచ్ఛతు రిప్రవాహః ।ఇహైవాయమితరో జాతవేదా దేవేభ్యో హవ్యం వహతు ప్రజానన్ ।",
              "devanagari": "क्रव्यादमग्निं प्रहिणोमि दूरं यमराज्ञो गच्छतु रिप्रवाहः । इहैवायमितरो जातवेदा देवेभ्यो हव्यं वहतु प्रजानन् ।"
            }
          },
          {
            "instructions": {
              "english": [
                "To refine the fire (samskara), pour 8 drops of ghee into it while reciting the following mantra 8 times."
              ],
              "telugu": [
                "అగ్నిని శుద్ధి చేయడానికి (సంస్కారం), ఈ క్రింది మంత్రాన్ని 8 సార్లు పఠిస్తూ దానిలో 8 చుక్కల నెయ్యి పోయండి."
              ],
              "hindi": [
                "अग्नि को परिष्कृत (संस्कार) करने के लिए, निम्नलिखित मंत्र का 8 बार पाठ करते हुए उसमें घी की 8 बूँदें डालें।"
              ]
            },
            "slokas": {
              "english": "om bhūrbhuvassuvaḥ svāhā ।",
              "telugu": "ఓం భూర్భువస్సువః స్వాహా ।",
              "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Place darbhas along the four boundaries of the homa kundam (east, south, west, north).",
                "Sprinkle water on these four boundaries in the order shown in the diagram, reciting the corresponding mantra for each direction."
              ],
              "telugu": [
                "హోమ కుండం యొక్క నాలుగు సరిహద్దుల (తూర్పు, దక్షిణం, పడమర, ఉత్తరం) వెంబడి దర్భలను ఉంచండి.",
                "రేఖాచిత్రంలో చూపిన క్రమంలో ఈ నాలుగు సరిహద్దులపై నీటిని చల్లండి, ప్రతి దిశకు సంబంధించిన మంత్రాన్ని పఠిస్తూ."
              ],
              "hindi": [
                "होम कुंड की चार सीमाओं (पूर्व, दक्षिण, पश्चिम, उत्तर) पर दर्भ रखें।",
                "आरेख में दिखाए गए क्रम में इन चार सीमाओं पर पानी छिड़कें, प्रत्येक दिशा के लिए संबंधित मंत्र का पाठ करते हुए।"
              ]
            },
            "slokas": {
              "english": "adite'numanyasva । anumate'numanyasva । sarasvate'numanyasva । deva savitaḥ prasuva ।",
              "telugu": "అదితేऽనుమన్యస్వ । అనుమతేऽనుమన్యస్వ । సరస్వతేऽనుమన్యస్వ । దేవ సవితః ప్రసువ ।",
              "devanagari": "अदितेऽनुमन्यस्व । अनुमतेऽनुमन्यस्व । सरस्वतेऽनुमन्यस्व । देव सवितः प्रसुव ।"
            },
            "diagram": "/diagrams/agni-pratisthapana-4-dirs.svg"
          },
          {
            "instructions": {
              "english": [
                "Pray to Agni with the following mantra, asking him to be present and face you."
              ],
              "telugu": [
                "ఈ క్రింది మంత్రంతో అగ్నిని ప్రార్థించండి, ఆయనను హాజరై మిమ్మల్ని ఎదుర్కోమని అడగండి."
              ],
              "hindi": [
                "निम्नलिखित मंत्र के साथ अग्नि से प्रार्थना करें, उनसे उपस्थित रहने और आपका सामना करने के लिए कहें।"
              ]
            },
            "slokas": {
              "english": "Chatvaari shrungaastrayo asya paadaa dwe sheershe saptahastaaso asya । tridhaa baddho vishabho roraveeti maho devo martyaa aavivesha । Esha hi devah pradisho nu sarvaah poorvo hi jaatah sa u garbhe antah । sa vijaayamaanah sa janishyamaanah pratyangmukhaastishthati vishwatomukhah । praangmukho deva । he agne । mamaabhimukho bhava ।",
              "telugu": "చత్వారి శృంగాస్త్రయో అస్య పాదా ద్వే శీర్షే సప్తహస్తాసో అస్య । త్రిధా బద్ధో వృషభో రోరవీతి మహో దేవో మర్త్యా ఆవివేశ । ఏష హి దేవః ప్రదిశో ను సర్వాః పూర్వో హి జాతః స ఉ గర్భే అంతః । స విజాయమానః స జనిష్యమాణః ప్రత్యఙ్ముఖాస్తిష్ఠతి విశ్వతోముఖః । ప్రాఙ్ముఖో దేవ । హే అగ్నే । మమాభిముఖో భవ ।",
              "devanagari": "चत्वारि शृंगास्त्रयो अस्य पादा द्वे शीर्षे सप्तहस्तासो अस्य । त्रिधा बद्धो वृषभो रोरवीति महो देवो मर्त्या आविवेश । एष हि देवः प्रदिशो नु सर्वाः पूर्वो हि जातः स उ गर्भे अन्तः । स विजायमानः स जनिष्यमाणः प्रत्यङ्‌मुखास्तिष्ठति विश्वतोमुखः । प्राङ्‌मुखो देव । हे अग्ने। ममाभिमुखो भव ।"
            }
          }
        ]
      },
      {
        "id": 8,
        "title": {
          "english": "Dikpaalaka Pooja",
          "telugu": "దిక్పాలక పూజ",
          "devanagari": "दिक्पालक पूजा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Take akshatas and flowers and offer them to the rulers of the eight directions, starting from the east and moving clockwise (East, Southeast, South, Southwest, West, Northwest, North, Northeast).",
                "Then, make offerings to Brahma (upward direction, between NE and E) and Sesha (downward direction, between SW and W).",
                "Finally, offer to Agni in the center of the homa kundam and to your own Atma (self) by touching your heart.",
                "Recite the following 12 mantras for the 12 offerings."
              ],
              "telugu": [
                "అక్షతలు, పువ్వులు తీసుకుని తూర్పు నుండి ప్రారంభించి సవ్యదిశలో (తూర్పు, ఆగ్నేయం, దక్షిణం, నైరుతి, పడమర, వాయువ్యం, ఉత్తరం, ఈశాన్యం) ఎనిమిది దిక్కుల పాలకులకు సమర్పించండి.",
                "ఆ తర్వాత, బ్రహ్మకు (పైకి దిశ, ఈశాన్యం-తూర్పు మధ్య) మరియు శేషునికి (క్రిందికి దిశ, నైరుతి-పడమర మధ్య) నైవేద్యాలు సమర్పించండి.",
                "చివరగా, హోమ కుండం మధ్యలో అగ్నికి మరియు మీ హృదయాన్ని తాకడం ద్వారా మీ ఆత్మకు సమర్పించండి.",
                "12 నైవేద్యాల కోసం ఈ క్రింది 12 మంత్రాలను పఠించండి."
              ],
              "hindi": [
                "अक्षत और फूल लें और उन्हें आठ दिशाओं के शासकों को अर्पित करें, पूर्व से शुरू होकर दक्षिणावर्त (पूर्व, दक्षिण-पूर्व, दक्षिण, दक्षिण-पश्चिम, पश्चिम, उत्तर-पश्चिम, उत्तर, उत्तर-पूर्व) घूमें।",
                "फिर, ब्रह्मा (ऊर्ध्व दिशा, उत्तर-पूर्व और पूर्व के बीच) और शेष (अधो दिशा, दक्षिण-पश्चिम और पश्चिम के बीच) को आहुति दें।",
                "अंत में, होम कुंड के केंद्र में अग्नि को और अपने हृदय को छूकर अपनी आत्मा को अर्पित करें।",
                "12 आहुतियों के लिए निम्नलिखित 12 मंत्रों का पाठ करें।"
              ]
            },
            "slokas": {
              "english": "om indrāya namaḥ । om agnaye namaḥ । om yamāya namaḥ । om nirṛtaye namaḥ । om varuņāya namaḥ । om vāyave namaḥ । om somāya namaḥ । om īśānāya namaḥ । om brahmane namaḥ । om śeṣāya namaḥ । om agnaye namaḥ । om atmane namaḥ ।",
              "telugu": "ఓం ఇంద్రాయ నమః । ఓం అగ్నయే నమః । ఓం యమాయ నమః । ఓం నిరృతయే నమః । ఓం వరుణాయ నమః । ఓం వాయవే నమః । ఓం సోమాయ నమః । ఓం ఈశానాయ నమః । ఓం బ్రహ్మణే నమః । ఓం శేషాయ నమః । ఓం అగ్నయే నమః । ఓం ఆత్మనే నమః ।",
              "devanagari": "ॐ इन्द्राय नमः । ॐ अग्नये नमः । ॐ यमाय नमः । ॐ निरृतये नमः । ॐ वरुणाय नमः । ॐ वायवे नमः । ॐ सोमाय नमः । ॐ ईशानाय नमः । ॐ ब्रह्मणे नमः । ॐ शेषाय नमः । ॐ अग्नये नमः । ॐ आत्मने नमः ।"
            },
            "diagram": "/diagrams/dikpalakas.svg"
          }
        ]
      },
      {
        "id": 9,
        "title": {
          "english": "Poorvaangam",
          "telugu": "పూర్వాంగం",
          "devanagari": "पूर्वांगम"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Holding the wooden ladle pointing from northwest to southeast, offer a drop of ghee for Prajapati (progenitor of all beings)."
              ],
              "telugu": [
                "చెక్క గరిటెను వాయువ్యం నుండి ఆగ్నేయం వైపు చూపిస్తూ, ప్రజాపతికి (అన్ని జీవుల సృష్టికర్త) ఒక చుక్క నెయ్యి సమర్పించండి."
              ],
              "hindi": [
                "लकड़ी की करछुल को उत्तर-पश्चिम से दक्षिण-पूर्व की ओर रखते हुए, प्रजापति (सभी प्राणियों के जनक) के लिए घी की एक बूंद अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om prajāpataye svāhā prajāpataya idam na mama ।",
              "telugu": "ఓం ప్రజాపతయే స్వాహా ప్రజాపతయ ఇదం న మమ ।",
              "devanagari": "ॐ प्रजापतये स्वाहा प्रजापतय इदं न मम ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Now, pointing the ladle from southwest to northeast, offer a drop of ghee for Indra (ruler of gods)."
              ],
              "telugu": [
                "ఇప్పుడు, గరిటెను నైరుతి నుండి ఈశాన్యం వైపు చూపిస్తూ, ఇంద్రునికి (దేవతల రాజు) ఒక చుక్క నెయ్యి సమర్పించండి."
              ],
              "hindi": [
                "अब, करछुल को दक्षिण-पश्चिम से उत्तर-पूर्व की ओर इंगित करते हुए, इंद्र (देवताओं के शासक) के लिए घी की एक बूंद अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om indrāya svāhā indrāyedam na mama ।",
              "telugu": "ఓం ఇంద్రాయ స్వాహా ఇంద్రాయేదం న మమ ।",
              "devanagari": "ॐ इन्द्राय स्वाहा इन्द्रायेदं न मम ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Offer a little ghee to Agni (fire god) in the middle of the fire."
              ],
              "telugu": [
                "అగ్ని (అగ్ని దేవుడు) మధ్యలో కొద్దిగా నెయ్యి సమర్పించండి."
              ],
              "hindi": [
                "अग्नि (अग्नि देव) को आग के बीच में थोड़ा घी अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om agnaye svāhā agnaya idam na mama ।",
              "telugu": "ఓం అగ్నయే స్వాహా అగ్నయ ఇదం న మమ ।",
              "devanagari": "ॐ अग्नये स्वाहा अग्नय इदं न मम ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Then offer a little ghee to Soma (god of nourishment) in the upper half of the northern side of the homa kundam."
              ],
              "telugu": [
                "ఆ తర్వాత హోమ కుండం యొక్క ఉత్తర భాగంలో పైభాగంలో సోమునికి (పోషణ దేవుడు) కొద్దిగా నెయ్యి సమర్పించండి."
              ],
              "hindi": [
                "फिर होम कुंड के उत्तरी भाग के ऊपरी आधे भाग में सोम (पोषण के देवता) को थोड़ा घी अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om somāya svāhā somāyedam na mama ।",
              "telugu": "ఓం సోమాయ స్వాహా సోమాయేదం న మమ ।",
              "devanagari": "ॐ सोमाय स्वाहा सोमायेदं न मम ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Finally, offer a 'forgiveness offering' to Prajapati for any mistakes made so far in the ritual."
              ],
              "telugu": [
                "చివరగా, క్రతువులో ఇప్పటివరకు జరిగిన ఏవైనా తప్పులకు ప్రజాపతికి 'క్షమాపణ నైవేద్యం' సమర్పించండి."
              ],
              "hindi": [
                "अंत में, अनुष्ठान में अब तक हुई किसी भी गलती के लिए प्रजापति को 'क्षमा अर्पण' करें।"
              ]
            },
            "slokas": {
              "english": "ārambhaprabhṛti etatkşanaparyantam madhye sambhāvita samasta dosa prāyaścittārtham sarva prāyaścittam hoşyāmi । om bhūrbhuvassuvaḥ svāhā prajāpataya idam na mama ।",
              "telugu": "ఆరంభప్రభృతి ఏతత్క్షణపర్యంతం మధ్యే సంభవిత సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తం హోష్యామి । ఓం భూర్భువస్సువః స్వాహా ప్రజాపతయ ఇదం న మమ ।",
              "devanagari": "आरम्भप्रभृति एतत्क्षणपर्यन्तं मध्ये सम्भावित समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्तं होष्यामि । ॐ भूर्भुवस्सुवः स्वाहा प्रजापतय इदं न मम ।"
            }
          }
        ]
      },
      {
        "id": 10,
        "title": {
          "english": "Praana Pratishthaapanaa",
          "telugu": "ప్రాణ ప్రతిష్ఠాపన",
          "devanagari": "प्राण प्रतिष्ठापन"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Now, invoke the life force (prana) of the deity into the idol and the fire. If you know how, perform anganyaasam and karanyaasam while reciting the following."
              ],
              "telugu": [
                "ఇప్పుడు, దేవత యొక్క ప్రాణశక్తిని (ప్రాణాన్ని) విగ్రహంలోకి మరియు అగ్నిలోకి ఆవాహన చేయండి. మీకు తెలిస్తే, ఈ క్రింది వాటిని పఠిస్తూ అంగన్యాసం మరియు కరన్యాసం చేయండి."
              ],
              "hindi": [
                "अब, देवता की प्राण शक्ति (प्राण) को मूर्ति और अग्नि में स्थापित करें। यदि आप जानते हैं, तो निम्नलिखित का पाठ करते हुए अंगन्यास और करन्यास करें।"
              ]
            },
            "slokas": {
              "english": "asya śrī mahāganapati prāņapratisthāpana mantrasya ganaka ṛṣiḥ nicṛdgāyatri chandaḥ śrī mahā ganapatirdevatāl glāṁ bījam glīṁ śaktiḥ । glaum kīlakam । gām angusthābhyām namaḥ gīm tarjanībhyām namaḥ। güm madhyamābhyām namaḥ। gaim anāmikābhyām namaḥ gaum kanişṭhikābhyām namaḥ । gaḥ karatala karapṛṣṭhābhyām namah । gām hṛdayāya namaḥ । gīṁ śirase svāhā gūṁ śikhāyai vaşaț gaim kavacāya hum । gaum netratrayāya vauşat gah astrāya phat । bhūrbhuvassuvaromiti digbandhaḥ ।",
              "telugu": "అస్య శ్రీ మహాగణపతి ప్రాణప్రతిష్ఠాపన మంత్రస్య గణక ఋషిః నిచృద్గాయత్రీ చ్చందః శ్రీ మహా గణపతిర్దేవతా। గ్లాం బీజం గ్లీం శక్తిః । గ్లౌం కీలకం । గాం అంగుష్ఠాభ్యాం నమః గీం తర్జనీభ్యాం నమః। గూం మధ్యమాభ్యాం నమః। గైం అనామికాభ్యాం నమః గౌం కనిష్ఠికాభ్యాం నమః । గః కరతల కరపృష్ఠాభ్యాం నమః । గాం హృదయాయ నమః । గీం శిరసే స్వాహా గూం శిఖాయై వషట్ గైం కవచాయ హుం । గౌం నేత్రత్రయాయ వౌషట్ గః అస్త్రాయ ఫట్ । భూర్భువస్సువరోమితి దిగ్బంధః ।",
              "devanagari": "अस्य श्री महागणपति प्राणप्रतिष्ठापन मन्त्रस्य गणक ऋषिः निचृद्गायत्री छन्दः श्री महा गणपतिर्देवता। ग्लां बीजं ग्लीं शक्तिः । ग्लौं कीलकम् । गां अंगुष्ठाभ्यां नमः गीं तर्जनीभ्यां नमः। गूं मध्यमाभ्यां नमः। गैं अनामिकाभ्यां नमः गौं कनिष्ठिकाभ्यां नमः । गः करतल करपृष्ठाभ्यां नमः । गां हृदयाय नमः । गीं शिरसे स्वाहा गूं शिखायै वषट् गैं कवचाय हुम् । गौं नेत्रत्रयाय वौषट् गः अस्त्राय फट् । भूर्भुवस्सुवरोमिति दिग्बन्धः ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Invoke the deity into the fire and idol with the following mantra. Imagine that Mahaganapathi, who is in your own heart, is entering the fire and the idol."
              ],
              "telugu": [
                "ఈ క్రింది మంత్రంతో అగ్ని మరియు విగ్రహంలోకి దేవతను ఆవాహన చేయండి. మీ స్వంత హృదయంలో ఉన్న మహాగణపతి అగ్ని మరియు విగ్రహంలోకి ప్రవేశిస్తున్నాడని ఊహించుకోండి."
              ],
              "hindi": [
                "निम्नलिखित मंत्र के साथ देवता को अग्नि और मूर्ति में स्थापित करें। कल्पना कीजिए कि महागणपति, जो आपके अपने हृदय में हैं, अग्नि और मूर्ति में प्रवेश कर रहे हैं।"
              ]
            },
            "slokas": {
               "english": "om ām hrīṁ krom yam ram lam vam śam şam sam ham lam kşam । om hamsah so'ham so'ham hamsaḥ śrī mahāganapateḥ prāņa iha prāṇaḥ jīva iha sthitaḥ sarvendriyāņi vānmanaścakşuḥ śrotra jihvāghrāņa prāṇāpānavyānodānasamānāḥ ihaivāgatya sukham ciram tişthantu svāhā sānnidhyam kurvantu svāhā । asunī te punarasmāsu cakşuḥ punaḥ prāņamiha no dehi bhogam jyokpaśyema sūryamuccarantamanumate mrļayā naḥ svasti । ām hrīṁ krom krom hrīm ām । ām hrīṁ krom krom hrīm ām ām hrīṁ krom krom hrīm ām ām hrīṁ krom krom hrīm ām । om śrī mahāganapati prāṇaśaktyai namaḥ ।",
              "telugu": "ఓం ఆం హ్రీం క్రోం యం రం లం వం శం షం సం హం లం క్షం । ఓం హంసః సోऽహం సోऽహం హంసః శ్రీ మహాగణపతేః ప్రాణ ఇహ ప్రాణః జీవ ఇహ స్థితః సర్వేంద్రియాణి వాఙ్మనశ్చక్షుః శ్రోత్ర జిహ్వాఘ్రాణ ప్రాణాపానవ్యానోదానసమానాః ఇహైవాగత్య సుఖం చిరం తిష్ఠంతు స్వాహా సాన్నిధ్యం కుర్వంతు స్వాహా । అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి । ఆం హ్రీం క్రోం క్రోం హ్రీం ఆం । ఆం హ్రీం క్రోం క్రోం హ్రీం ఆం ఆం హ్రీం క్రోం క్రోం హ్రీం ఆం ఆం హ్రీం క్రోం క్రోం హ్రీం ఆం । ఓం శ్రీ మహాగణపతి ప్రాణశక్త్యై నమః ।",
              "devanagari": "ॐ आं ह्रीं क्रों यं रं लं वं शं षं सं हं लं क्षम् । ॐ हंसः सोऽहं सोऽहं हंसः श्री महागणपतेः प्राण इह प्राणः जीव इह स्थितः सर्वेन्द्रियाणि वाङ्मनश्चक्षुः श्रोत्र जिह्वाघ्राण प्राणापानव्यानोदानसमानाः इहैवागत्य सुखं चिरं तिष्ठन्तु स्वाहा सान्निध्यं कुर्वन्तु स्वाहा । असुनी ते पुनरस्मासु चक्षुः पुनः प्राणमिह नो देहि भोगम् ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति । आं ह्रीं क्रों क्रों ह्रीं आं । आं ह्रीं क्रों क्रों ह्रीं आं आं ह्रीं क्रों क्रों ह्रीं आं आं ह्रीं क्रों क्रों ह्रीं आं । ॐ श्री महागणपति प्राणशक्त्यै नमः ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Read the following and perform the associated mudras (hand gestures) if you know them. Pray to Ganapathi to stay in the fire and the idol until the end of the homam."
              ],
              "telugu": [
                "ఈ క్రింది వాటిని చదివి, మీకు తెలిస్తే సంబంధిత ముద్రలు (చేతి సంజ్ఞలు) చేయండి. హోమం ముగిసే వరకు అగ్ని మరియు విగ్రహంలో ఉండమని గణపతిని ప్రార్థించండి."
              ],
              "hindi": [
                "निम्नलिखित पढ़ें और यदि आप जानते हैं तो संबंधित मुद्राएं (हाथ के इशारे) करें। गणपति से प्रार्थना करें कि वे होम के अंत तक अग्नि और मूर्ति में रहें।"
              ]
            },
            "slokas": {
              "english": "āvāhito bhava । sthāpito bhava । sannihito bhava । sanniruddho bhava । avakunthito bhava । deva prasīda prasīda । deva sarva jagannātha yāvaddhomāvasānakam tāvattvam prītibhāvena mūrtau agnau ca sannidhim kuru ।",
              "telugu": "ఆవాహితో భవ । స్థాపితో భవ । సన్నిహితో భవ । సన్నిరుద్ధో భవ । అవకుంఠితో భవ । దేవ ప్రసీద ప్రసీద । దేవ సర్వ జగన్నాథ యావద్ధోమావసానకం తావత్త్వం ప్రీతిభావేన మూర్తౌ అగ్నౌ చ సన్నిధిం కురు ।",
              "devanagari": "आवादितो भव । स्थापितो भव । सन्निहितो भव । सन्निरुद्धो भव । अवकुण्ठितो भव । देव प्रसीद प्रसीद । देव सर्व जगन्नाथ यावद्धोमावसानकम् तावत्त्वं प्रीतिभावेन मूर्तौ अग्नौ च सन्निधिं कुरु ।"
            }
          }
        ]
      },
      {
        "id": 11,
        "title": {
          "english": "Panchopachara Pooja",
          "telugu": "పంచోపచార పూజ",
          "devanagari": "पंचोपचार पूजा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Offer sandalwood powder/paste (gandham) to Mahaganapathi in the fire and the idol."
              ],
              "telugu": [
                "అగ్ని మరియు విగ్రహంలో మహాగణపతికి గంధపు పొడి/పేస్ట్ (గంధం) సమర్పించండి."
              ],
              "hindi": [
                "अग्नि और मूर्ति में महागणपति को चंदन पाउडर/पेस्ट (गंधम्) अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "lam pṛthivyātmane namaḥ gandham samarpayāmi ।",
              "telugu": "లం పృథివ్యాత్మనే నమః గంధం సమర్పయామి ।",
              "devanagari": "लं पृथिव्यात्मने नमः गन्धं समर्पयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Offer a flower or flower petal (pushpam)."
              ],
              "telugu": [
                "ఒక పువ్వు లేదా పువ్వు రేకు (పుష్పం) సమర్పించండి."
              ],
              "hindi": [
                "एक फूल या फूल की पंखुड़ी (पुष्पम्) अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "ham ākāśātmane namaḥ । puspam samarpayāmi ।",
              "telugu": "హం ఆకాశాత్మనే నమః । పుష్పం సమర్పయామి ।",
              "devanagari": "हं आकाशात्मने नमः । पुष्पं समर्पयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Offer incense smoke (dhoopam)."
              ],
              "telugu": [
                "ధూపం (ధూపం) సమర్పించండి."
              ],
              "hindi": [
                "धूप (धूपम्) अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "yaṁ vāyvātmane namaḥ । dhūpam āghrāpayāmi ।",
              "telugu": "యం వాయ్వాత్మనే నమః । ధూపం ఆఘ్రాపయామి ।",
              "devanagari": "यं वाय्वात्मने नमः । धूपं आघ्रापयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Show the light from a lamp (deepam)."
              ],
              "telugu": [
                "దీపం నుండి కాంతిని చూపండి (దీపం)."
              ],
              "hindi": [
                "दीपक से प्रकाश दिखाएं (दीपम्)।"
              ]
            },
            "slokas": {
              "english": "ram agnyātmane namaḥ। dīpam darśayāmi ।",
              "telugu": "రం అగ్న్యాత్మనే నమః। దీపం దర్శయామి ।",
              "devanagari": "रं अग्न्यात्मने नमः। दीपं दर्शयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Offer food (naivedyam)."
              ],
              "telugu": [
                "ఆహారం (నైవేద్యం) సమర్పించండి."
              ],
              "hindi": [
                "भोजन (नैवेद्यम्) अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "vam amṛtātmane namaḥ । naivedyam samarpayāmi ।",
              "telugu": "వం అమృతాత్మనే నమః । నైవేద్యం సమర్పయామి ।",
              "devanagari": "वं अमृतात्मने नमः । नैवेद्यं समर्पयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Offer akshatas, symbolizing the offering of all other services (sarvopacharan)."
              ],
              "telugu": [
                "అక్షతలను సమర్పించండి, ఇది అన్ని ఇతర సేవలను (సర్వోపచారన్) సమర్పించడానికి ప్రతీక."
              ],
              "hindi": [
                "अक्षत अर्पित करें, जो अन्य सभी सेवाओं (सर्वोपचारान्) के अर्पण का प्रतीक है।"
              ]
            },
            "slokas": {
              "english": "sam sarvātmane namaḥ sarvopacārān samarpayāmi ।",
              "telugu": "సం సర్వాత్మనే నమః సర్వోపచారాన్ సమర్పయామి ।",
              "devanagari": "सं सर्वात्मने नमः सर्वोपचारान् समर्पयामि ।"
            }
          }
        ]
      },
      {
        "id": 12,
        "title": {
          "english": "Dasadha Vibhakta Moola Mantra",
          "telugu": "దశధా విభక్త మూల మంత్రం",
          "devanagari": "दशधा विभक्त मूल मंत्र"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Make ten offerings of ghee for the ten parts of the moola mantra. Offer a drop of ghee into the fire after each line."
              ],
              "telugu": [
                "మూల మంత్రం యొక్క పది భాగాల కోసం పది నెయ్యి నైవేద్యాలు చేయండి. ప్రతి పంక్తి తర్వాత అగ్నిలో ఒక చుక్క నెయ్యి సమర్పించండి."
              ],
              "hindi": [
                "मूल मंत्र के दस भागों के लिए घी की दस आहुतियाँ दें। प्रत्येक पंक्ति के बाद अग्नि में घी की एक बूंद अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om svāhā ।om śrīm svāhā ।om śrīm hrīṁ svāhā ।om śrīm hrīṁ klīm svāhā ।om śrīm hrīṁ klīm glaum svāhā ।om śrīm hrīṁ klīm glaum gam svāhā ।om śrīm hrīṁ klīm glaum gam ganapataye svāhā ।om śrīm hrīṁ klīm glaum gam ganapataye varavarada svāhā ।om śrīm hrīṁ klīm glaum gam ganapataye varavarada sarvajanam svāhā ।om śrīm hrīṁ klīm glaum gam ganapataye varavarada sarvajanam me vaśamānaya svāhā svāhā ।",
              "telugu": "ఓం స్వాహా ।ఓం శ్రీం స్వాహా ।ఓం శ్రీం హ్రీం స్వాహా ।ఓం శ్రీం హ్రీం క్లీం స్వాహా ।ఓం శ్రీం హ్రీం క్లీం గ్లౌం స్వాహా ।ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం స్వాహా ।ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం గణపతయే స్వాహా ।ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం గణపతయే వరవరద స్వాహా ।ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం గణపతయే వరవరద సర్వజనం స్వాహా ।ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం గణపతయే వరవరద సర్వజనం మే వశమానయ స్వాహా స్వాహా ।",
              "devanagari": "ॐ स्वाहा ।\nॐ श्रीं स्वाहा ।\nॐ श्रीं ह्रीं स्वाहा ।\nॐ श्रीं ह्रीं क्लीं स्वाहा ।\nॐ श्रीं ह्रीं क्लीं ग्लौं स्वाहा ।\nॐ श्रीं ह्रीं क्लीं ग्लौं गं स्वाहा ।\nॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये स्वाहा ।\nॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये वरवरद स्वाहा ।\nॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये वरवरद सर्वजनं स्वाहा ।\nॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये वरवरद सर्वजनं मे वशमानय स्वाहा स्वाहा ।"
            }
          }
        ]
      },
      {
        "id": 13,
        "title": {
          "english": "Mahaganapathi Mantras",
          "telugu": "మహాగణపతి మంత్రాలు",
          "devanagari": "महागणपति मंत्र"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Now you can offer as many mantras of Mahaganapathi as you wish, with suggested counts of 4, 8, 12, 28, 108, or more. Make an offering (ghee, sesame seeds, etc.) into the fire after each recitation, ending the mantra with 'svāhā'. For the very last repetition of a given mantra, end with 'vauşat' instead."
              ],
              "telugu": [
                "ఇప్పుడు మీరు మహాగణపతి మంత్రాలను మీకు కావలసినన్ని సార్లు, సూచించిన సంఖ్యలలో 4, 8, 12, 28, 108, లేదా అంతకంటే ఎక్కువ సార్లు సమర్పించవచ్చు. ప్రతి పఠనం తర్వాత అగ్నిలో నైవేద్యం (నెయ్యి, నువ్వులు, మొదలైనవి) సమర్పించండి, మంత్రాన్ని 'స్వాహా'తో ముగించండి. ఒక మంత్రం యొక్క చివరి పునరావృతం కోసం, బదులుగా 'వౌషట్'తో ముగించండి."
              ],
              "hindi": [
                "अब आप महागणपति के जितने चाहें उतने मंत्र, 4, 8, 12, 28, 108, या अधिक की सुझाई गई संख्या में अर्पित कर सकते हैं। प्रत्येक पाठ के बाद अग्नि में एक आहुति (घी, तिल, आदि) दें, मंत्र को 'स्वाहा' के साथ समाप्त करें। किसी दिए गए मंत्र की अंतिम पुनरावृत्ति के लिए, इसके बजाय 'वौषट्' के साथ समाप्त करें।"
              ]
            }
          },
          {
            "instructions": {
              "english": [
                "The first important mantra is the moola mantra with beejas."
              ],
              "telugu": [
                "మొదటి ముఖ్యమైన మంత్రం బీజాలతో కూడిన మూల మంత్రం."
              ],
              "hindi": [
                "पहला महत्वपूर्ण मंत्र बीज के साथ मूल मंत्र है।"
              ]
            },
            "slokas": {
              "english": "om śrīm hrīṁ klīm glaum gam ganapataye varavarada sarvajanam me vaśamānaya svāhā ।",
              "telugu": "ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం గణపతయే వరవరద సర్వజనం మే వశమానయ స్వాహా ।",
              "devanagari": "ॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये वरवरद सर्वजनं मे वशमानय स्वाहा ।"
            }
          },
          {
            "instructions": {
              "english": [
                "The second important one is a Vedic mantra."
              ],
              "telugu": [
                "రెండవ ముఖ్యమైనది వేద మంత్రం."
              ],
              "hindi": [
                "दूसरा महत्वपूर्ण एक वैदिक मंत्र है।"
              ]
            },
            "slokas": {
              "english": "om ganānām tvā ganapatim havāmahe kavim kavīnāmupamaśravastamam jyestharājam brahmaņām brahmanaspata naḥ śrņvannūtibhissīda sādanam ॥ svāhā ।",
              "telugu": "ఓం గణానాం త్వా గణపతిం హవామహే కవిం కవీనాముపమశ్రవస్తమం జ్యేష్ఠరాజం బ్రహ్మణాం బ్రహ్మణస్పత నః శృణ్వన్నూతిభిస్సీద సాదనం ॥ స్వాహా ।",
              "devanagari": "ॐ गणानां त्वा गणपतिं हवामहे कविं कवीनामुपमश्रवस्तमम् ज्येष्ठराजं ब्रह्मणां ब्रह्मणस्पत नः शृण्वन्नूतिभिस्सीद सादनम् ॥ स्वाहा ।"
            }
          },
          {
            "instructions": {
              "english": [
                "You can also recite the 'Ganapathi Atharva Seersham' (also known as 'Ganapathi Upanishat'), which is a very powerful prayer."
              ],
              "telugu": [
                "మీరు 'గణపతి అథర్వ శీర్షం' (దీనిని 'గణపతి ఉపనిషత్' అని కూడా అంటారు) ను కూడా పఠించవచ్చు, ఇది చాలా శక్తివంతమైన ప్రార్థన."
              ],
              "hindi": [
                "आप 'गणपति अथर्वशीर्ष' (जिसे 'गणपति उपनिषद' भी कहा जाता है) का भी पाठ कर सकते हैं, जो एक बहुत शक्तिशाली प्रार्थना है।"
              ]
            }
          }
        ]
      },
      {
        "id": 14,
        "title": {
          "english": "Punah Pooja",
          "telugu": "పునః పూజ",
          "devanagari": "पुनः पूजा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "After all the mantra offerings, offer food (naivedyam) again to Mahaganapathi."
              ],
              "telugu": [
                "అన్ని మంత్ర నైవేద్యాల తర్వాత, మహాగణపతికి మళ్ళీ ఆహారం (నైవేద్యం) సమర్పించండి."
              ],
              "hindi": [
                "सभी मंत्र आहुतियों के बाद, महागणपति को फिर से भोजन (नैवेद्य) अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om gam ganapataye namaḥ। naivedyam samarpayāmi ।",
              "telugu": "ఓం గం గణపతయే నమః। నైవేద్యం సమర్పయామి ।",
              "devanagari": "ॐ गं गणपतये नमः। नैवेद्यं समर्पयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Light a piece of camphor and offer the light (nīrājanam) to the fire."
              ],
              "telugu": [
                "ఒక కర్పూరం ముక్కను వెలిగించి, అగ్నికి కాంతిని (నీరాజనం) సమర్పించండి."
              ],
              "hindi": [
                "कपूर का एक टुकड़ा जलाएं और अग्नि को प्रकाश (नीराजनम्) अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "om gam ganapataye namaḥ । nīrājanam samarpayāmi ।",
              "telugu": "ఓం గం గణపతయే నమః । నీరాజనం సమర్పయామి ।",
              "devanagari": "ॐ गं गणपतये नमः । नीराजनं समर्पयामि ।"
            }
          },
          {
            "instructions": {
              "english": [
                "Stand up and perform one or three pradakshinas (clockwise circumambulations) around the homa kundam, then sit down again."
              ],
              "telugu": [
                "లేచి నిలబడి హోమ కుండం చుట్టూ ఒకటి లేదా మూడు ప్రదక్షిణలు (సవ్యదిశలో ప్రదక్షిణలు) చేసి, ఆపై మళ్ళీ కూర్చోండి."
              ],
              "hindi": [
                "खड़े हो जाएं और होम कुंड के चारों ओर एक या तीन प्रदक्षिणा (दक्षिणावर्त परिक्रमा) करें, फिर फिर से बैठ जाएं।"
              ]
            }
          }
        ]
      },
      {
        "id": 15,
        "title": {
          "english": "Uttaraangam",
          "telugu": "ఉత్తరాంగం",
          "devanagari": "उत्तरांगम्"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Offer ghee drops for Prajapati, for the controllers of the three worlds (Bhuh, Bhuvah, Suvah), for Agni Svishtakrut (the maker of perfect offerings), and finally for Prajapati again."
              ],
              "telugu": [
                "ప్రజాపతికి, మూడు లోకాల నియంత్రకులకు (భూః, భువః, సువః), అగ్ని స్విష్టకృత్‌కు (సంపూర్ణ నైవేద్యాలు చేసేవాడు), మరియు చివరగా మళ్ళీ ప్రజాపతికి నెయ్యి చుక్కలు సమర్పించండి."
              ],
              "hindi": [
                "प्रजापति के लिए, तीनों लोकों के नियंत्रकों (भूः, भुवः, सुवः) के लिए, अग्नि स्विष्टकृत् (उत्तम आहुति बनाने वाले) के लिए, और अंत में फिर से प्रजापति के लिए घी की बूंदें अर्पित करें।"
              ]
            },
            "slokas": {
              "english": "Long Version: Om prajaapate na tvadetaanyanyo vishwaa jaataani pari taa babhoova । yatkaamaaste juhumastanno astu vayam syaama patayo rayeenaam । swaahaa । prajaapataya idam na mama ॥ Om bhooh swaahaa । agnaya idam na mama ॥ Om bhuvah swaahaa । vaayava idam na mama ॥ Om suvah swaahaa । sooryaayedam na mama ॥ yadasya karmano'tyareericham yadvaanyoonamihaakaram । agnishtat svishtakridvidwaan sarvam svishtam suhutam karotu swaahaa । agnaye svishtakrita idam na mama ॥ Om bhoorbhuvassuvaḥ svāhā । prajaapataya idam na mama ॥ anaajnyaatam yadaajnyaatam yajnyasya kriyate mithu । agne tadasya kalpaya tvam hi vettha yathaatatham । swaahaa । agnaya idam na mama ॥ purushasammito yajnyo yajñah purushasammitah । agne tadasya kalpaya tvam hi vettha yathaatatham । swaahaa । agnaya idam na mama ॥ yatpaakatraa manasaa deenadakshaa na । yajnyasya manvate martaasah । agnishtaddhotaa kratuvidvijaanan । yajishtho devaan ritusho yajaati । swaahaa । agnaya idam na mama ॥ Short Version: Om bhooh swaahaa । agnaya idam na mama ॥ Om bhuvah swaahaa । vaayava idam na mama ॥ Om suvah swaahaa । sooryaayedam na mama ॥ Om bhoorbhuvassuvah swaahaa । prajaapataya idam na mama ॥ Om shree vishnave swaahaa । vishnave paramaatmana idam na mama ॥ Om namo rudraaya pashupataye swaahaa । rudraaya pashupataya idam na mama ॥",
              "telugu": "దీర్ఘ పద్ధతి: ఓం ప్రజాపతే న త్వదేతాన్యన్యో విశ్వా జాతాని పరి తా బభూవ । యత్కామాస్తే జుహుమస్తన్నో అస్తు వయం స్యామ పతయో రయీణాం। స్వాహా। ప్రజాపతయ ఇదం న మమ ॥ ఓం భూః స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా। వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా। సూర్యాయేదం న మమ ॥ యదస్య కర్మణోऽత్యరీరిచం యద్వాన్యూనమిహాకరం । అగ్నిష్టత్ స్విష్టకృద్విద్వాన్ సర్వం స్విష్టం సుహుతం కరోతు స్వాహా। అగ్నయే స్విష్టకృత ఇదం న మమ ॥ ఓం భూర్భువస్సువహ స్వాహా। ప్రజాపతయ ఇదం న మమ ॥ అనాజ్ఞాతం యదాజ్ఞాతం యజ్నస్య క్రియతే మిథు। అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ । స్వాహా। అగ్నయ ఇదం న మమ ॥ పురుషసంమితో యజ్ఞో యజ్ఞః పురుషసంమితః। అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్। స్వాహా। అగ్నయ ఇదం న మమ ॥ యత్పాకత్రా మనసా దీనదక్షా న। యజ్ఞస్య మన్వతే మర్తాసః। అగ్నిష్టద్ధోతా క్రతువిద్విజానన్ । యజిష్ఠో దేవాన్  ऋतुశో యజాతి । స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భూః స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా । వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా। సూర్యాయేదం న మమ ॥ అస్మిన్ హోమకర్మణి మధ్యే సంభావిత సమస్త మంత్రలొప తంత్రలొప క్రియాలోప భక్తిలోప శ్రద్ధాలోప నియమలోప నిష్ఠాలోప ద్రవ్యలోపాది సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తాహుతి హోష్యామి। ఓం భూర్భువస్సువహ స్వాహా। ప్రజాపతయ ఇదం న మమ ॥ ఓం శ్రీ విష్ణవే స్వాహా। విష్ణవే పరమాత్మన ఇదం న మమ ॥ ఓం నమో రుద్రాయ పశుపతయే స్వాహా। రుద్రాయ పశుపతయ ఇదం న మమ ॥\nచిన్న వెర్షన్: ఓం భూః స్వాహా। అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా। వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా। సూర్యాయేదం న మమ ॥ ఓం భూర్భువస్సువహ స్వాహా । ప్రజాపతయ ఇదం న మమ ॥ ఓం శ్రీ విష్ణవే స్వాహా। విష్ణవే పరమాత్మన ఇదం న మమ ॥ ఓం నమో రుద్రాయ పశుపతయే స్వాహా। రుద్రాయ పశుపతయ ఇదం న మమ ॥",
              "devanagari": "लंबा संस्करण: ॐ प्रजापते न त्वदेतान्यन्यो विश्वा जातानि परि ता बभूव । यत्कामास्ते जुहुमस्तन्नो अस्तु वयः स्याम पतयो रयीणाम्। स्वाहा। प्रजापतय इदं न मम ॥ ॐ भूः स्वाहा। अग्नय इदं न मम ॥ ॐ भुवः स्वाहा। वायव इदं न मम ॥ ॐ सुवः स्वाहा। सूययिदं न मम ॥ यदस्य कर्मणोऽत्यरीरिचं यद्वान्यूनमिहाकरम् । अग्निष्टत् स्विष्टकृद्विद्वान् सर्वं स्विष्टं सुहुतं करोतु स्वाहा। अग्नये स्विष्टकृत इदं न मम ॥ ॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥ अनाज्ञातं यदाज्ञातं यज्ञस्य क्रियते मिथु। अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥ पुरुषसंमितो यज्ञो यज्ञः पुरुषसंमितः। अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥ यत्पाकत्रा मनसा दीनदक्षा न । यज्ञस्य मन्वते मर्तासः। अग्निष्टद्धोता क्रतुविद्विजानन्। यजिष्ठो देवान् ऋतुशो यजाति । स्वाहा। अग्नय इदं न मम ॥ ॐ भूः स्वाहा। अग्नय इदं न मम ॥ ॐ भुवः स्वाहा । वायव इदं न मम ॥ ॐ सुवः स्वाहा। सूययिदं न मम ॥ अस्मिन् होमकर्मणि मध्ये संभावित समस्त मंत्रलोप तंत्रलोप क्रियालोप भक्तिलोप श्रद्धालोप नियमलोप निष्ठालोप द्रव्यलोपादि समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्ताहुतिं होष्यामि। ॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥ ॐ श्री विष्णवे स्वाहा। विष्णवे परमात्मन इदं न मम ॥ ॐ नमो रुद्राय पशुपतये स्वाहा। रुद्राय पशुपतय इदं न मम ॥"
            }
          },
          {
            "instructions": {
              "english": [
                "Perform Praanaayaamam again.",
                "Now, make three offerings to Agni, asking for forgiveness for any mistakes committed knowingly or unknowingly."
              ],
              "telugu": [
                "మళ్ళీ ప్రాణాయామం చేయండి.",
                "ఇప్పుడు, తెలిసి లేదా తెలియక చేసిన ఏవైనా తప్పులకు క్షమాపణ కోరుతూ అగ్నికి మూడు నైవేద్యాలు చేయండి."
              ],
              "hindi": [
                "फिर से प्राणायाम करें।",
                "अब, अग्नि को तीन आहुतियाँ दें, जाने-अनजाने में हुई किसी भी गलती के लिए क्षमा मांगें।"
              ]
            },
            "slokas": {
              "english": "anājñātaṁ yadājñātaṁ yajñasya kriyate mithu । agne tadasya kalpaya tvaṁ hi vettha yathātatham । svāhā । agnaya idaṁ na mama ॥ puruṣasaṁmito yajño yajñaḥ puruṣasaṁmitaḥ । agne tadasya kalpaya tvaṁ hi vettha yathātatham । svāhā । agnaya idaṁ na mama ॥ yatpākatrā manasā dīnadakṣā na । yajñasya manvate martāsaḥ । agniṣṭaddhotā kratuvidvijānan । yajiṣṭho devān ṛtuśo yajāti । svāhā । agnaya idaṁ na mama ॥",
              "telugu": "అనాజ్ఞాతం యదాజ్ఞాతం యజ్ఞస్య క్రియతే మిథు । అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ । స్వాహా । అగ్నయ ఇదం న మమ ॥ పురుషసంమితో యజ్ఞో యజ్ఞః పురుషసంమితః । అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ । స్వాహా । అగ్నయ ఇదం న మమ ॥ యత్పాకత్రా మనసా దీనదక్షా న । యజ్ఞస్య మన్వతే మర్తాసః । అగ్నిష్టద్ధోతా క్రతువిద్విజానన్ । యజిష్ఠో దేవాన్  ऋतुశో యజాతి । స్వాహా । అగ్నయ ఇదం న మమ ॥",
              "devanagari": "अनाज्ञातं यदाज्ञातं यज्ञस्य क्रियते मिथु । अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥ पुरुषसंमितो यज्ञो यज्ञः पुरुषसंमितः। अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥ यत्पाकत्रा मनसा दीनदक्षा न । यज्ञस्य मन्वते मर्तासः। अग्निष्टद्धोता क्रतुविद्विजानन्। यजिष्ठो देवान् ऋतुशो यजाति । स्वाहा। अग्नय इदं न मम ॥"
            }
          },
          {
            "instructions": {
              "english": [
                "Make final offerings to Vishnu and Rudra. After the offering to Rudra, wash your right hand."
              ],
              "telugu": [
                "విష్ణువు మరియు రుద్రునికి చివరి నైవేద్యాలు చేయండి. రుద్రునికి నైవేద్యం సమర్పించిన తరువాత, మీ కుడి చేతిని కడుక్కోండి."
              ],
              "hindi": [
                "विष्णु और रुद्र को अंतिम आहुति दें। रुद्र को आहुति देने के बाद, अपना दाहिना हाथ धो लें।"
              ]
            },
            "slokas": {
              "english": "om śrī vişnave svāhā । vişnave paramātmana idam na mama ॥om namo rudrāya paśupataye svāhā । rudrāya paśupataya idam na mama ।",
              "telugu": "ఓం శ్రీ విష్ణవే స్వాహా । విష్ణవే పరమాత్మన ఇదం న మమ ॥ఓం నమో రుద్రాయ పశుపతయే స్వాహా । రుద్రాయ పశుపతయ ఇదం న మమ ।",
              "devanagari": "ॐ श्री विष्णवे स्वाहा । विष्णवे परमात्मन इदं न मम ॥\nॐ नमो रुद्राय पशुपतये स्वाहा । रुद्राय पशुपतय इदं न मम ।"
            }
          }
        ]
      },
      {
        "id": 16,
        "title": {
          "english": "Tarpanam",
          "telugu": "తర్పణం",
          "devanagari": "तर्पणम्"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Take a little milk or water. With your right palm facing up, form a circle with your thumb and index finger.",
                "Pour a little of the liquid into your palm and then let it drop from the tips of your middle and ring fingers into a corner of the homa kundam.",
                "Repeat this once, or 4, 8, or 12 times while reciting the following."
              ],
              "telugu": [
                "కొద్దిగా పాలు లేదా నీరు తీసుకోండి. మీ కుడి అరచేతిని పైకి చూపిస్తూ, మీ బొటనవేలు మరియు చూపుడు వేలుతో ఒక వృత్తం ఏర్పాటు చేయండి.",
                "కొద్దిగా ద్రవాన్ని మీ అరచేతిలోకి పోసి, ఆపై మీ మధ్య మరియు ఉంగరపు వేళ్ల కొనల నుండి హోమ కుండం యొక్క ఒక మూలలోకి పడేలా చేయండి.",
                "ఈ క్రింది వాటిని పఠిస్తూ దీనిని ఒకసారి, లేదా 4, 8, లేదా 12 సార్లు పునరావృతం చేయండి."
              ],
              "hindi": [
                "थोड़ा दूध या पानी लें। अपनी दाहिनी हथेली को ऊपर की ओर रखते हुए, अपने अंगूठे और तर्जनी से एक गोला बनाएं।",
                "थोड़ा सा तरल अपनी हथेली में डालें और फिर इसे अपनी मध्यमा और अनामिका उंगलियों के सिरों से होम कुंड के एक कोने में गिरा दें।",
                "निम्नलिखित का पाठ करते हुए इसे एक बार, या 4, 8, या 12 बार दोहराएं।"
              ]
            },
            "slokas": {
              "english": "om śrīm hrīṁ klīm glaum gam ganapataye varavarada sarvajanam me vaśamānaya svāhā । om śrī mahāganapatim tarpayāmi ।",
              "telugu": "ఓం శ్రీం హ్రీం క్లీం గ్లౌం గం గణపతయే వరవరద సర్వజనం మే వశమానయ స్వాహా । ఓం శ్రీ మహాగణపతిం తర్పయామి ।",
              "devanagari": "ॐ श्रीं ह्रीं क्लीं ग्लौं गं गणपतये वरवरद सर्वजनं मे वशमानय स्वाहा । ॐ श्री महागणपतिं तर्पयामि ।"
            }
          }
        ]
      },
      {
        "id": 17,
        "title": {
          "english": "Suddhaanna Bali",
          "telugu": "శుద్ధాన్న బలి",
          "devanagari": "शुद्धान्न बलि"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Now, offer bali (sacrifice) to the associates of Mahaganapathi. Take cooked white rice or fruit slices and place small amounts in six locations outside the homa kundam, following the order in the diagram (1-East, 2-West, 3-North, 4-South, 5&6-East)."
              ],
              "telugu": [
                "ఇప్పుడు, మహాగణపతి యొక్క అనుచరులకు బలి (త్యాగం) సమర్పించండి. వండిన తెల్ల అన్నం లేదా పండ్ల ముక్కలను తీసుకుని, రేఖాచిత్రంలోని క్రమాన్ని అనుసరించి (1-తూర్పు, 2-పడమర, 3-ఉత్తరం, 4-దక్షిణం, 5&6-తూర్పు) హోమ కుండం వెలుపల ఆరు ప్రదేశాలలో చిన్న మొత్తంలో ఉంచండి."
              ],
              "hindi": [
                "अब, महागणपति के सहयोगियों को बलि (बलिदान) अर्पित करें। पके हुए सफेद चावल या फलों के टुकड़े लें और उन्हें होम कुंड के बाहर छह स्थानों पर थोड़ी मात्रा में रखें, आरेख में दिए गए क्रम का पालन करते हुए (1-पूर्व, 2-पश्चिम, 3-उत्तर, 4-दक्षिण, 5&6-पूर्व)।"
              ]
            },
            "slokas": {
              "english": "om śrī mahāganapati pārşadebhyo namaḥ balim samarpayāmi ।",
              "telugu": "ఓం శ్రీ మహాగణపతి పార్షదేభ్యో నమః బలిం సమర్పయామి ।",
              "devanagari": "ॐ श्री महागणपति पार्षदेभ्यो नमः बलिं समर्पयामि ।"
            },
            "diagram": "/diagrams/parsha-bali.svg"
          }
        ]
      },
      {
        "id": 18,
        "title": {
          "english": "Vasordhaaraa",
          "telugu": "వసోర్ధారా",
          "devanagari": "वसोर्धारा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Pour a slow, continuous stream of ghee onto the burning coconut pieces in the homa kundam while reciting the following verse from 'Rudra Chamakam'."
              ],
              "telugu": [
                "'రుద్ర చమకం' నుండి ఈ క్రింది శ్లోకాన్ని పఠిస్తూ హోమ కుండంలో మండుతున్న కొబ్బరి ముక్కలపై నెమ్మదిగా, నిరంతరంగా నెయ్యి ధారగా పోయండి."
              ],
              "hindi": [
                "'रुद्र चमकम्' से निम्नलिखित श्लोक का पाठ करते हुए होम कुंड में जलते हुए नारियल के टुकड़ों पर घी की एक धीमी, निरंतर धारा डालें।"
              ]
            },
            "slokas": {
              "english": "om śaṁ ca me mayaśca me priyam ca me'nukāmaśca me kāmaśca me saumanasaśca me bhadram ca me śreyaśca me vasyaśca me yaśaśca me bhagaśca me draviņam ca me yantă ca me dhartā ca me kşemaśca me dhṛtiśca me viśvam ca me mahaśca me samvicca me jñātram ca me sūśca me prasūśca me sīram ca me layaśca martam ca me'mṛtaṁ ca me'yakşmam ca me'nāmayacca me jīvātuśca me dīrghāyutvaṁ ca me'namitram ca me'bhayam ca me sugam ca me śayanam ca me sūṣā ca me sudinam ca me ॥",
              "telugu": "ఓం శం చ మే మయశ్చ మే ప్రియం చ మేనుకామశ్చ మే కామశ్చ మే సౌమనసశ్చ మే భద్రం చ మే శ్రేయశ్చ మే వస్యశ్చ మే యశశ్చ మే భగశ్చ మే ద్రవిణం చ మే యంతా చ మే ధర్తా చ మే క్షేమశ్చ మే ధృతిశ్చ మే విశ్వం చ మే మహశ్చ మే సంవిచ్చ మే జ్ఞాత్రం చ మే సూశ్చ మే ప్రసూశ్చ మే సీరం చ మే లయశ్చ మర్తం చ మేమృతం చ మేయక్ష్మం చ మేనామయచ్చ మే జీవాతుశ్చ మే దీర్ఘాయుత్వం చ మేనమిత్రం చ మేభయం చ మే సుగం చ మే శయనం చ మే సూషా చ మే సుదినం చ మే ॥",
              "devanagari": "ॐ शं च मे मयश्च मे प्रियं च मेऽनुकामश्च मे कामश्च मे सौमनसश्च मे भद्रं च मे श्रेयश्च मे वस्यश्च मे यशश्च मे भगश्च मे द्रविणं च मे यन्ता च मे धर्ता च मे क्षेमश्च मे धृतिश्च मे विश्वं च मे महश्च मे संविच्च मे ज्ञातं च मे सूश्च मे प्रसूश्च मे सीरं च मे लयश्च मेऽमृतं च मेऽयक्ष्मं च मेऽनामयच्च मे जीवातुश्च मे दीर्घायुत्वं च मेऽनमित्रं च मेऽभयं च मे सुगं च मे शयनं च मे सूषा च मे सुदिनं च मे ॥"
            }
          }
        ]
      },
      {
        "id": 19,
        "title": {
          "english": "Poornaahuti",
          "telugu": "పూర్ణాహుతి",
          "devanagari": "पूर्णाहुति"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Prepare the Poornaahuti offering. For a simple homam, this can be a dry coconut half filled with a coin, akshatas, and powders (sandalwood, turmeric, kumkum). This symbolizes the offering of one's head or ego.",
                "Place the offering on the wooden ladle, recite the following mantra, and then carefully place it in the fire with your hand."
              ],
              "telugu": [
                "పూర్ణాహుతి నైవేద్యం సిద్ధం చేయండి. ఒక సాధారణ హోమం కోసం, ఇది ఒక నాణెం, అక్షతలు, మరియు పొడులతో (గంధం, పసుపు, కుంకుమ) నింపిన ఎండు కొబ్బరి చిప్ప కావచ్చు. ఇది ఒకరి తల లేదా అహంకారాన్ని సమర్పించడాన్ని సూచిస్తుంది.",
                "నైవేద్యాన్ని చెక్క గరిటెపై ఉంచి, ఈ క్రింది మంత్రాన్ని పఠించి, ఆపై దానిని జాగ్రత్తగా మీ చేతితో అగ్నిలో ఉంచండి."
              ],
              "hindi": [
                "पूर्णाहुति की आहुति तैयार करें। एक साधारण होम के लिए, यह एक सूखा नारियल का आधा हिस्सा हो सकता है जिसमें एक सिक्का, अक्षत और पाउडर (चंदन, हल्दी, कुमकुम) भरा हो। यह किसी के सिर या अहंकार के अर्पण का प्रतीक है।",
                "आहुति को लकड़ी की करछुल पर रखें, निम्नलिखित मंत्र का पाठ करें, और फिर इसे सावधानी से अपने हाथ से आग में रखें।"
              ]
            },
            "slokas": {
              "english": "Om poornaahutimuttamaam juhoti । Sarvam vai poornaahutih । Sarvamevaapnoti । Atho iyam vai poornaahutih । Asyaameva pratitishthati ॥Om poornamadah poornamidam poornaatpoornamudachyate । Poornasya poornamaadaaya poornamevaavashishyate ॥Om aim hreem kleem chaamundaayai vichche vaushat ॥",
              "telugu": "ఓం పూర్ణాహుతిముత్తమాం జుహోతి । సర్వం వై పూర్ణాహుతిః । సర్వమేవాప్నోతి । అథో ఇయం వై పూర్ణాహుతిః । అస్యామేవ ప్రతితిష్ఠతి ॥\nఓం పూర్ణమదః పూర్ణమిదం పూర్ణాత్పూర్ణముదచ్యతే । పూర్ణస్య పూర్ణమాదాయ పూర్ణమేవావశిష్యతే ॥\nఓం ఐం హ్రీం క్లీం చాముండాయై విచ్చే వౌషట్ ॥\n",
              "devanagari": "ॐ पूर्णाहुतिमुत्तमां जुहोति । सर्वं वै पूर्णाहुतिः । सर्वमेवाप्नोति । अथो इयं वै पूर्णाहुतिः । अस्यामेव प्रतितिष्ठति ॥\nॐ पूर्णमदः पूर्णमिदं पूर्णात्पूर्णमुदच्यते । पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते ॥\nॐ ऐं ह्रीं क्लीं चामुण्डायै विच्चे वौषट् ॥"
            }
          },
          {
            "instructions": {
              "english": [
                "As you place the offering, recite the Brahmārpanam mantra, contemplating complete surrender to Mahaganapathi."
              ],
              "telugu": [
                "నైవేద్యం ఉంచుతున్నప్పుడు, మహాగణపతికి సంపూర్ణ శరణాగతిని ధ్యానిస్తూ బ్రహ్మార్పణం మంత్రాన్ని పఠించండి."
              ],
              "hindi": [
                "आहुति देते समय, महागणपति के प्रति पूर्ण समर्पण का ध्यान करते हुए ब्रह्मार्पणम् मंत्र का पाठ करें।"
              ]
            },
            "slokas": {
              "english": "om brahmārpaņam brahmahavir brahmāgnau brahmaņā hutam brahmaiva tena gantavyam brahma karma samādhinā ॥",
              "telugu": "ఓం బ్రహ్మార్పణం బ్రహ్మహవిర్ బ్రహ్మాగ్నౌ బ్రహ్మణా హుతం బ్రహ్మైవ తేన గంతవ్యం బ్రహ్మ కర్మ సమాధినా ॥",
              "devanagari": "ॐ ब्रह्मार्पणं ब्रह्महविर्ब्रह्माग्नौ ब्रह्मणा हुतम् ब्रह्मैव तेन गन्तव्यं ब्रह्म कर्म समाधिना ॥"
            }
          }
        ]
      },
      {
        "id": 20,
        "title": {
          "english": "Winding Up and Meditation",
          "telugu": "ముగింపు మరియు ధ్యానం",
          "devanagari": "समापन और ध्यान"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Make a final offering of ghee to Agni, who has carried all the offerings to the gods."
              ],
              "telugu": [
                "దేవతలకు అన్ని నైవేద్యాలను చేరవేసిన అగ్నికి చివరిగా నెయ్యి నైవేద్యం చేయండి."
              ],
              "hindi": [
                "अग्नि को घी की अंतिम आहुति दें, जिसने सभी आहुतियों को देवताओं तक पहुँचाया है।"
              ]
            },
            "slokas": {
              "english": "sapta te agne samidhaḥ saptajihvāḥ sapta rşayassaptah dhāma priyāņil sapta hotrā sapta dhātvā yajantisaptayonīrāprņasvā ghṛtena svāhā agnaye saptavata idam na mama ॥",
              "telugu": "సప్త తే అగ్నే సమిధః సప్తజిహ్వాః సప్త ఋషయస్సప్తః ధామ ప్రియాణిల్ సప్త హోత్రా సప్త ధాత్వా యజంతిసప్తయోనీరాపృణస్వా ఘృతేన స్వాహా అగ్నయే సప్తవత ఇదం న మమ ॥",
              "devanagari": "सप्त ते अग्ने समिधः सप्तजिह्वाः सप्त ऋषयस्सप्त धाम प्रियाणि। सप्त होत्रा सप्तधा त्वा यजन्ति सप्त योनीरापृणस्वा घृतेन स्वाहा। अग्नये सप्तवत इदं न मम ॥"
            }
          },
          {
            "instructions": {
              "english": [
                "Sprinkle water around the homa kundam again as you did at the beginning, but using the following four mantras."
              ],
              "telugu": [
                "ప్రారంభంలో చేసినట్లుగా మళ్ళీ హోమ కుండం చుట్టూ నీరు చల్లండి, కానీ ఈ క్రింది నాలుగు మంత్రాలను ఉపయోగించి."
              ],
              "hindi": [
                "होम कुंड के चारों ओर फिर से पानी छिड़कें जैसा कि आपने शुरुआत में किया था, लेकिन निम्नलिखित चार मंत्रों का उपयोग करते हुए।"
              ]
            },
            "slokas": {
              "english": "adite'nvamamsthāḥ । anumate'nvamamsthāḥ । sarasvate'nvamamsthāḥ । deva savitah prāsāvīḥ ।",
              "telugu": "అదితేऽన్వమంస్థాః । అనుమతేऽన్వమంస్థాః । సరస్వతేऽన్వమంస్థాః । దేవ సవితః ప్రాసావీః ।",
              "devanagari": "अदितेऽन्वमंस्थाः । अनुमतेऽन्वमंस्थाः । सरस्वतेऽन्वमंस्थाः । देव सवितः प्रासावीः ।"
            },
            "diagram": "/diagrams/agni-pratisthapana-4-dirs.svg"
          },
          {
            "instructions": {
              "english": [
                "The time when the poornaahuti burns is the best time for meditation. Sit still with a straight back and meditate on your favorite deity and mantra for at least 5-10 minutes with maximum focus."
              ],
              "telugu": [
                "పూర్ణాహుతి కాలుతున్న సమయం ధ్యానానికి ఉత్తమ సమయం. నిటారుగా వెనుకభాగంతో నిశ్శబ్దంగా కూర్చుని, మీకు ఇష్టమైన దేవత మరియు మంత్రాన్ని గరిష్ట ఏకాగ్రతతో కనీసం 5-10 నిమిషాలు ధ్యానించండి."
              ],
              "hindi": [
                "जब पूर्णाहुति जलती है, वह ध्यान के लिए सबसे अच्छा समय है। सीधी पीठ के साथ स्थिर बैठें और अपने पसंदीदा देवता और मंत्र पर अधिकतम ध्यान के साथ कम से-कम 5-10 मिनट तक ध्यान करें।"
              ]
            }
          }
        ]
      },
      {
        "id": 21,
        "title": {
          "english": "Rakshaa",
          "telugu": "రక్షా",
          "devanagari": "रक्षा"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "To make 'rakshaa' (protective ash), take the darbhas that were placed on the western side of the homa kundam. Apply a little ghee to them, light them in the fire, and then let them burn completely in a separate container. This step is optional."
              ],
              "telugu": [
                "'రక్షా' (రక్షక బూడిద) చేయడానికి, హోమ కుండం యొక్క పడమర వైపు ఉంచిన దర్భలను తీసుకోండి. వాటికి కొద్దిగా నెయ్యి రాసి, వాటిని అగ్నిలో వెలిగించి, ఆపై వాటిని వేరే పాత్రలో పూర్తిగా కాలిపోయేలా చేయండి. ఈ దశ ఐచ్ఛికం."
              ],
              "hindi": [
                "'रक्षा' (सुरक्षात्मक राख) बनाने के लिए, होम कुंड के पश्चिमी तरफ रखे गए दर्भों को लें। उन पर थोड़ा घी लगाएं, उन्हें आग में जलाएं, और फिर उन्हें एक अलग बर्तन में पूरी तरह से जलने दें। यह चरण वैकल्पिक है।"
              ]
            },
            "slokas": {
              "english": "",
              "telugu": "",
              "devanagari": ""
            }
          },
          {
            "instructions": {
              "english": [
                "You can apply a little of this ash to the idol's forehead and then to your own for protection."
              ],
              "telugu": [
                "మీరు ఈ బూడిదను కొద్దిగా విగ్రహం నుదుటిపై మరియు ఆ తర్వాత రక్షణ కోసం మీ నుదుటిపై పూయవచ్చు."
              ],
              "hindi": [
                "आप इस राख का थोड़ा सा हिस्सा मूर्ति के माथे पर और फिर सुरक्षा के लिए अपने माथे पर लगा सकते हैं।"
              ]
            }
          }
        ]
      },
      {
        "id": 22,
        "title": {
          "english": "Udvaasana",
          "telugu": "ఉద్వాసన",
          "devanagari": "उद्वासन"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Take darbhas and flowers/akshatas. Touch the sides of the homakundam with the darbhas, then touch the idol, transferring the energy from the fire to the idol.",
                "Imagine that Sri Mahaganapathi has exited the fire and idol and returned to your heart while reciting the first mantra.",
                "Then, say farewell to the fire god (Agni) with the second mantra and a bow."
              ],
              "telugu": [
                "దర్భలు మరియు పువ్వులు/అక్షతలు తీసుకోండి. దర్భలతో హోమకుండం వైపులా తాకి, ఆపై విగ్రహాన్ని తాకండి, అగ్ని నుండి శక్తిని విగ్రహానికి బదిలీ చేయండి.",
                "మొదటి మంత్రాన్ని పఠిస్తూ శ్రీ మహాగణపతి అగ్ని మరియు విగ్రహం నుండి నిష్క్రమించి మీ హృదయంలోకి తిరిగి వచ్చాడని ఊహించుకోండి.",
                "అప్పుడు, రెండవ మంత్రంతో అగ్ని దేవునికి (అగ్ని) వీడ్కోలు చెప్పి నమస్కరించండి."
              ],
              "hindi": [
                "दर्भ और फूल/अक्षत लें। दर्भों से होमकुंड के किनारों को स्पर्श करें, फिर मूर्ति को स्पर्श करें, अग्नि से ऊर्जा को मूर्ति में स्थानांतरित करें।",
                "कल्पना कीजिए कि श्री महागणपति, जो अग्नि और मूर्ति से निकलकर आपके हृदय में लौट आए हैं, पहले मंत्र का पाठ करते हुए।",
                "फिर, दूसरे मंत्र और एक प्रणाम के साथ अग्नि देव (अग्नि) को विदाई दें।"
              ]
            },
            "slokas": {
              "english": "asmānmūrteśca agneśca śrīmahāganapatim yathāsthānam pratisthāpayāmi ।agne naya supathā rāye asmān viśvāni deva vayunāni vidvān yuyodhyasmajjuhurānameno bhūyişthām te nama uktim vidhemal agnaye namaḥ ॥",
              "telugu": "అస్మాన్మూర్తేశ్చ అగ్నేశ్చ శ్రీమహాగణపతిం యథాస్థానం ప్రతిష్ఠాపయామి ।అగ్నే నయ సుపథా రాయే అస్మాన్ విశ్వాని దేవ వయునాని విద్వాన్ యుయోధ్యస్మజ్జుహురాణమేనో భూయిష్ఠాం తే నమ ఉక్తిం విధేమల్ అగ్నయే నమః ॥",
              "devanagari": "अस्मान्मूर्तेश्च अग्नेश्च श्रीमहागणपतिं यथास्थानं प्रतिष्ठापयामि ।\nअग्ने नय सुपथा राये अस्मान् विश्वानि देव वयुनानि विद्वान् युयोध्यस्मज्जुहुराणमेनो भूयिष्ठां ते नम उक्तिं विधेम। अग्नये नमः ॥"
            }
          }
        ]
      },
      {
        "id": 23,
        "title": {
          "english": "Conclusion",
          "telugu": "ముగింపు",
          "devanagari": "निष्कर्ष"
        },
        "steps": [
          {
            "instructions": {
              "english": [
                "Recite the following verses, contemplating that Krishna is the true doer acting through you."
              ],
              "telugu": [
                "ఈ క్రింది శ్లోకాలను పఠించండి, మీ ద్వారా పనిచేస్తున్న నిజమైన కర్త కృష్ణుడేనని ధ్యానించండి."
              ],
              "hindi": [
                "निम्नलिखित श्लोकों का पाठ करें, यह विचार करते हुए कि कृष्ण ही आपके माध्यम से कार्य करने वाले सच्चे कर्ता हैं।"
              ]
            },
            "slokas": {
              "english": "mantrahīnam kriyāhīnam bhaktihīnam hutāśana yaddhutam tu mayā deva paripūrņam tadastu te ।prāyaścittānyaśeṣāņi tapaḥ karmātmakāni vail yāni teşāmaśeṣāṇāṁ śrī kṛṣṇasmaraņam param ॥ śrī kṛṣṇa kṛṣṇa kṛṣṇa ।kāyena vācā manasendriyairvā buddhyātmanā vā prakṛteḥ svabhāvāt karomi yadyat sakalam parasmai nārāyaṇāyeti samarpayāmi ॥",
              "telugu": "మంత్రహీనం క్రియాహీనం భక్తిహీనం హుతాశన యద్ధుతం తు మయా దేవ పరిపూర్ణం తదస్తు తే ।ప్రాయశ్చిత్తాన్యశేషాణి తపః కర్మాత్మకాని వైల్ యాని తేషామశేషాణాం శ్రీ కృష్ణస్మరణం పరం ॥ శ్రీ కృష్ణ కృష్ణ కృష్ణ ।కాయేన వాచా మనసేంద్రియైర్వా బుద్ధ్యాత్మనా వా ప్రకృతేః స్వభావాత్ కరోమి యద్యత్ సకలం పరస్మై నారాయణాయేతి సమర్పయామి ॥",
              "devanagari": "मन्त्रहीनं क्रियाहीनं भक्तिहीनं हुताशन यद्धुतं तु मया देव परिपूर्णं तदस्तु ते ।\nप्रायश्चित्तान्यशेषाणि तपः कर्मात्मकानि वै। यानि तेषामशेषाणां श्री कृष्णस्मरणं परम् ॥ श्री कृष्ण कृष्ण कृष्ण ।\nकायेन वाचा मनसेन्द्रियैर्वा बुद्ध्यात्मना वा प्रकृतेः स्वभावात् करोमि यद्यत् सकलं परस्मै नारायणायेति समर्पयामि ॥"
            }
          },
          {
            "instructions": {
              "english": [
                "Conclude by reciting the final prayer, surrendering the doership of the homam to Krishna and praying for peace."
              ],
              "telugu": [
                "హోమం యొక్క కర్తృత్వాన్ని కృష్ణునికి సమర్పించి, శాంతి కోసం ప్రార్థిస్తూ చివరి ప్రార్థనను పఠించడం ద్వారా ముగించండి."
              ],
              "hindi": [
                "अंतिम प्रार्थना का पाठ करके समाप्त करें, होम का कर्तृत्व कृष्ण को समर्पित करें और शांति के लिए प्रार्थना करें।"
              ]
            },
            "slokas": {
              "english": "anena divya mangaļa homena bhagavān sarvātmakaḥ śrīmahāganapatiḥ prīyatām om tatsat । sarvam śrī kṛṣṇārpaņamastu । om śāntiḥ śāntiḥ śāntih ।",
              "telugu": "అనేన దివ్య మంగళ హోమేన భగవాన్ సర్వాాత్మకః శ్రీమహాగణపతిః ప్రీయతాం । ఓం తత్సత్ । సర్వం శ్రీ కృష్ణార్పణమస్తు । ఓం శాంతిః శాంతిః శాంతిః ।",
              "devanagari": "अनेन दिव्य मङ्गल होमेन भगवान् सर्वात्मकः श्रीमहागणपतिः प्रीयताम् ॐ तत्सत् । सर्वं श्री कृष्णार्पणमस्तु । ॐ शान्तिः शान्तिः शान्तिः ।"
            }
          }
        ]
      }
    ]
  }