{
  "title": {
    "english": "Hanuman Homam",
    "telugu": "హనుమాన్ హోమం",
    "hindi": "हनुमान होम"
  },
  "author": {
    "english": "P V R Narasimha Rao",
    "telugu": "పి వి ఆర్ నరసింహారావు",
    "hindi": "पी वी आर नरसिम्हा राव"
  },
  "source": "https://vedicastrologer.org/homa/regular/hanuman_r_sans-.pdf",
  "sections": [
    {
      "id": 0,
      "title": {
        "english": "Introduction",
        "telugu": "పరిచయం",
        "devanagari": "परिचय"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Welcome to the Hanuman Homam manual. This guide provides a short procedure (Laghu Paddhati) for performing a traditional Hanuman Homam.",
              "A homam (fire ritual) is a sacred Vedic practice where offerings are made to a consecrated fire while chanting mantras. The fire acts as a medium to carry our prayers and offerings to the divine.",
              "Worship of Lord Hanuman can bestow knowledge, energy, bravery, physical strength, success over enemies, good health, humility, devotion, and self-knowledge (aatma jnaana).",
              "This manual contains detailed sections that will guide you step-by-step through the entire process, from initial preparations to the final conclusion. Each section includes detailed instructions and the sacred mantras (slokas) in multiple scripts.",
              "May Lord Hanuman bless your spiritual practice."
            ],
            "telugu": [
              "హనుమాన్ హోమం మార్గదర్శినికి స్వాగతం. ఈ గైడ్ సాంప్రదాయ హనుమాన్ హోమం చేయడానికి ఒక సంక్షిప్త విధానాన్ని (లఘు పద్ధతి) అందిస్తుంది.",
              "హోమం (అగ్ని యజ్ఞం) అనేది ఒక పవిత్రమైన వైదిక ఆచారం, ఇందులో మంత్రాలు జపిస్తూ పవిత్రమైన అగ్నికి ఆహుతులు సమర్పిస్తారు. అగ్ని మన ప్రార్థనలు మరియు ఆహుతులను దైవానికి చేరవేసే మాధ్యమంగా పనిచేస్తుంది.",
              "హనుమంతుని ఆరాధన జ్ఞానం, శక్తి, ధైర్యం, శారీరక బలం, శత్రువులపై విజయం, మంచి ఆరోగ్యం, వినయం, భక్తి మరియు ఆత్మజ్ఞానాన్ని ప్రసాదిస్తుంది.",
              "ఈ మార్గదర్శినిలో ప్రారంభ సన్నాహాల నుండి చివరి ముగింపు వరకు మొత్తం ప్రక్రియ ద్వారా మిమ్మల్ని దశలవారీగా మార్గనిర్దేశం చేసే వివరణాత్మక విభాగాలు ఉన్నాయి. ప్రతి విభాగంలో వివరణాత్మక సూచనలు మరియు పవిత్ర మంత్రాలు (శ్లోకాలు) బహుళ లిపులలో ఉన్నాయి.",
              "హనుమంతుడు మీ ఆధ్యాత్మిక సాధనను ఆశీర్వదిస్తాడుగాక."
            ],
            "hindi": [
              "हनुमान होम नियमावली में आपका स्वागत है।यह मार्गदर्शिका पारंपरिक हनुमान होम करने के लिए एक संक्षिप्त प्रक्रिया (लघु पद्धति) प्रदान करती है।",
              "होम (अग्नि अनुष्ठान) एक पवित्र वैदिक प्रथा है जिसमें मंत्रों का जाप करते हुए पवित्र अग्नि में आहुति दी जाती है।अग्नि हमारी प्रार्थनाओं और आहुतियों को परमात्मा तक पहुंचाने का माध्यम बनती है।",
              "भगवान हनुमान की पूजा ज्ञान, ऊर्जा, वीरता, शारीरिक शक्ति, शत्रुओं पर विजय, अच्छा स्वास्थ्य, विनम्रता, भक्ति और आत्म-ज्ञान प्रदान कर सकती है।",
              "इस नियमावली में विस्तृत खंड हैं जो आपको प्रारंभिक तैयारियों से लेकर अंतिम निष्कर्ष तक पूरी प्रक्रिया में चरण-दर-चरण मार्गदर्शन करेंगे।प्रत्येक खंड में विस्तृत निर्देश और पवित्र मंत्र (श्लोक) कई लिपियों में शामिल हैं।",
              "भगवान हनुमान आपकी आध्यात्मिक साधना को आशीर्वाद दें।"
            ]
          },
          "slokas": {
            "english": "oṃ śrī mahāgaṇapathaye namaḥ ।oṃ śrī gurubhyo namaḥ ।oṃ ṛṣibhyo namaḥ ॥",
            "telugu": "ఓం శ్రీ మహాగణపతయే నమః ।ఓం శ్రీ గురుభ్యో నమః ।ఓం ఋషిభ్యో నమః ॥",
            "devanagari": "ॐ श्री महागणपतये नमः ।ॐ श्री गुरुभ्यो नमः ।ॐ ऋषिभ्यो नमः ॥"
          }
        }
      ]
    },
    {
      "id": 1,
      "title": {
        "english": "Anujnaa",
        "telugu": "అనుజ్ఞ",
        "devanagari": "अनुज्ञा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Before starting the homam, think in your mind of Mother Earth who is bearing you, Lord Ganesha who removes obstacles, your ishta devata (favorite deity), your parents, the rishis of your gothra (if you know them), all the rishis and all your gurus. Then say the following, while mentally requesting all the gods to co-operate with your homam."
            ],
            "telugu": [
              "హోమం ప్రారంభించే ముందు, మిమ్మల్ని భరిస్తున్న భూమాతను, అడ్డంకులను తొలగించే గణేశుడిని, మీ ఇష్టదేవతను, మీ తల్లిదండ్రులను, మీ గోత్ర ఋషులను (మీకు తెలిస్తే), ఋషులందరినీ మరియు మీ గురువులందరినీ మనస్సులో స్మరించుకోండి. ఆ తర్వాత, దేవతలందరూ మీ హోమానికి సహకరించాలని మానసికంగా అభ్యర్థిస్తూ ఈ క్రింది శ్లోకాన్ని పఠించండి."
            ],
            "hindi": [
              "होम शुरू करने से पहले, अपने मन में पृथ्वी माता का ध्यान करें जो आपको धारण करती हैं, भगवान गणेश जो बाधाओं को दूर करते हैं, आपके इष्ट देवता, आपके माता-पिता, आपके गोत्र के ऋषि (यदि आप उन्हें जानते हैं), सभी ऋषियों और आपके सभी गुरुओं का ध्यान करें।फिर निम्नलिखित कहें, और मानसिक रूप से सभी देवताओं से आपके होम में सहयोग करने का अनुरोध करें।"
            ]
          },
          "slokas": {
              "english": " Om R^iddhyaasma havyairnamasopasadya ।\n mitram devam mitradheyam no astu ।\n  anooraadhaan havishaa vardhayantah ।\n  shatam jeevema sharadah saveeraah ।",
              "telugu": "ఓం ఋద్ధ్యాస్మ హవ్యైర్నమసోపసద్య ।\n  మిత్రం దేవం మిత్రధేయం నో అస్తు ।\n  అనూరాధాన్ హవిషా వర్ధయంతః ।\n  శతం జీవేమ శరదః సవీరాః ।",
              "devanagari": " ॐ ऋद्धयास्म हव्यैर्नमसोपसद्य ।\n  मित्रं देवं मित्रधेयं नो अस्तु ।\n  अनूराधान् हविषा वर्धयन्तः ।\n  शतं जीवेम शरदः सवीराः ।"
            }
        },
        {
          "instructions": {
            "english": [
              "If you have a 'pavitram' (a ring made of darbha or a special metal ring), wear it now on your right hand ring finger. If you don't have one, take any ring you have, pray to your ishta devata, and wear it. If you don't have a ring, don't worry and move on."
            ],
            "telugu": [
              "మీ దగ్గర 'పవిత్రం' (దర్భతో చేసిన ఉంగరం లేదా ప్రత్యేక లోహపు ఉంగరం) ఉంటే, దానిని ఇప్పుడు మీ కుడి చేతి ఉంగరపు వేలికి ధరించండి. మీ దగ్గర అది లేకపోతే, మీ వద్ద ఉన్న ఏదైనా ఉంగరాన్ని తీసుకుని, మీ ఇష్టదేవతకు ప్రార్థించి, ధరించండి. మీ దగ్గర ఉంగరం లేకపోతే, చింతించకండి మరియు తదుపరి దశకు వెళ్ళండి."
            ],
            "hindi": [
              "यदि आपके पास 'पवित्रम्' (कुश से बनी अंगूठी या एक विशेष धातु की अंगूठी) है, तो इसे अब अपने दाहिने हाथ की अनामिका उंगली में पहनें।यदि आपके पास नहीं है, तो कोई भी अंगूठी लें, अपने इष्ट देवता से प्रार्थना करें और उसे पहनें।यदि आपके पास कोई अंगूठी नहीं है, तो चिंता न करें और आगे बढ़ें।"
            ]
          }
        }
      ]
    },
    {
      "id": 2,
      "title": {
        "english": "Aachamanam",
        "telugu": "ఆచమనం",
        "devanagari": "आचमनम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take a little water from the tumbler into your right palm with a spoon. Say the first mantra and drink the water. Repeat this for the second and third mantras. Imagine that Vishnu, who is within you, is receiving the water."
            ],
            "telugu": [
              "గ్లాసు నుండి కొద్దిగా నీటిని చెంచాతో మీ కుడి అరచేతిలోకి తీసుకోండి. మొదటి మంత్రాన్ని చెప్పి నీటిని త్రాగండి. రెండవ మరియు మూడవ మంత్రాల కోసం దీనిని పునరావృతం చేయండి. మీలో ఉన్న విష్ణువు ఆ నీటిని స్వీకరిస్తున్నాడని భావించండి."
            ],
            "hindi": [
              "चम्मच से गिलास से थोड़ा सा पानी अपनी दाहिनी हथेली में लें।पहला मंत्र बोलें और पानी पी लें।दूसरे और तीसरे मंत्र के लिए इसे दोहराएं।कल्पना कीजिए कि आपके भीतर मौजूद विष्णु उस जल को प्राप्त कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om̐ keśavāya svāhā ।om̐ nārāyaṇāya svāhā ।om̐ mādhavāya svāhā ।",
            "telugu": "ఓం కేశవాయ స్వాహా ।ఓం నారాయణాయ స్వాహా ।ఓం మాధవాయ స్వాహా ।",
            "devanagari": "ॐ केशवाय स्वाहा।ॐ नारायणाय स्वाहा।ॐ माधवाय स्वाहा।"
          }
        }
      ]
    },
    {
      "id": 3,
      "title": {
        "english": "Vighneswara Pooja",
        "telugu": "విఘ్నేశ్వర పూజ",
        "devanagari": "विघ्नेश्वर पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "To ensure there are no obstacles in the pooja, we pray to Ganesha at the beginning. Just read the following verses and mentally pray to Ganesha to remove all obstacles from your homam."
            ],
            "telugu": [
              "పూజలో ఎలాంటి ఆటంకాలు కలగకుండా ఉండేందుకు, ఆరంభంలో గణేశుడిని ప్రార్థిస్తాం. ఈ క్రింది శ్లోకాలను చదివి, మీ హోమం నుండి అన్ని అడ్డంకులను తొలగించమని గణేశుడిని మానసికంగా ప్రార్థించండి."
            ],
            "hindi": [
              "पूजा में कोई बाधा न आए, इसके लिए हम शुरुआत में गणेश जी की प्रार्थना करते हैं।बस निम्नलिखित श्लोकों को पढ़ें और अपने होम से सभी बाधाओं को दूर करने के लिए मानसिक रूप से गणेश जी से प्रार्थना करें।"
            ]
          },
          "slokas": {
            "english": "śuklāṁbaradharaṁ viṣṇuṁ śaśivarṇaṁ caturbhujaṁ ।prasannavadanaṁ dhyāyet sarva vighnopaśāntaye ॥ agajānana padmārkaṁ gajānanamaharniśaṁ ।anekadaṁ taṁ bhaktānāṁ ekadantaṁ upāsmahe ॥ vakratuṁḍa mahākāya koṭisūryasamaprabha ।nirvighnaṁ kuru me deva sarvakāryeṣu sarvadā ॥",
            "telugu": "శుక్లాంబరధరం విష్ణుం శశివర్ణం చతుర్భుజం ।ప్రసన్నవదనం ధ్యాయేత్ సర్వ విఘ్నోపశాంతయే ॥ అగజానన పద్మార్కం గజాననమహర్నిశం ।అనేకదం తం భక్తానాం ఏకదంతం ఉపాస్మహే ॥ వక్రతుండ మహాకాయ కోటిసూర్యసమప్రభ ।నిర్విఘ్నం కురు మే దేవ సర్వకార్యేషు సర్వదా ॥",
            "devanagari": "शुक्लांबरधरं विष्णुं शशिवर्णं चतुर्भुजं।प्रसन्नवदनं ध्यायेत् सर्व विघ्नोपशान्तये ॥ अगजानन पद्मार्कं गजाननमहर्निशं।अनेकदं तं भक्तानां एकदन्तं उपास्महे ॥ वक्रतुंड महाकाय कोटिसूर्यसमप्रभ।निर्विघ्नं कुरु मे देव सर्वकार्येषु सर्वदा ॥"
          }
        }
      ]
    },
    {
      "id": 4,
      "title": {
        "english": "Praanaayaamam",
        "telugu": "ప్రాణాయామం",
        "devanagari": "प्राणायामम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take some akshatas in your left palm and place it on your left lap. Hold your nostrils with your right hand (little and ring finger on the left nostril, thumb on the right). Close the left nostril and gently inhale through the right nostril while mentally chanting the Gayatri mantra (or an alternative like 'om̐ namo bhagavate vāsudevāya'). Close the right nostril and retain the breath while chanting the mantra again. Open the left nostril and exhale while chanting the mantra a third time. Now, inhale through the left nostril while chanting. Close the left nostril and retain breath while chanting. Finally, exhale through the right nostril while chanting a sixth time. Throughout, contemplate the formless supreme Brahman filling the universe and the air you breathe."
            ],
            "telugu": [
              "కొన్ని అక్షతలను మీ ఎడమ అరచేతిలో తీసుకుని మీ ఎడమ ఒడిలో ఉంచండి. మీ కుడి చేతితో మీ ముక్కుపుటాలను పట్టుకోండి (చిటికెన మరియు ఉంగరపు వేలిని ఎడమ ముక్కుపై, బొటనవేలిని కుడివైపు). ఎడమ ముక్కును మూసి, గాయత్రీ మంత్రాన్ని (లేదా 'ఓం నమో భగవతే వాసుదేవాయ' వంటి ప్రత్యామ్నాయాన్ని) మానసికంగా జపిస్తూ కుడి ముక్కు ద్వారా మెల్లగా శ్వాస తీసుకోండి. కుడి ముక్కును మూసి, మంత్రాన్ని మళ్లీ జపిస్తూ శ్వాసను నిలపండి. ఎడమ ముక్కును తెరిచి, మూడవసారి మంత్రాన్ని జపిస్తూ శ్వాసను వదలండి. ఇప్పుడు, జపిస్తూ ఎడమ ముక్కు ద్వారా శ్వాస తీసుకోండి. జపిస్తూ ఎడమ ముక్కును మూసి శ్వాసను నిలపండి. చివరగా, ఆరవసారి జపిస్తూ కుడి ముక్కు ద్వారా శ్వాసను వదలండి. ఈ సమయంలో, విశ్వాన్ని మరియు మీరు పీల్చే గాలిని నింపుతున్న నిరాకార పరబ్రహ్మాన్ని ధ్యానించండి."
            ],
            "hindi": [
              "अपनी बाईं हथेली में कुछ अक्षत लें और उसे अपनी बाईं गोद में रखें।अपने दाहिने हाथ से अपनी नासिका को पकड़ें (छोटी और अनामिका उंगली बाईं नासिका पर, अंगूठा दाईं ओर)।बाईं नासिका को बंद करें और गायत्री मंत्र (या 'ॐ नमो भगवते वासुदेवाय' जैसा कोई विकल्प) का मानसिक रूप से जाप करते हुए दाहिनी नासिका से धीरे-धीरे सांस लें।दाहिनी नासिका को बंद करें और मंत्र का फिर से जाप करते हुए सांस को रोकें।बाईं नासिका खोलें और तीसरी बार मंत्र का जाप करते हुए सांस छोड़ें।अब, जाप करते हुए बाईं नासिका से सांस लें।जाप करते हुए बाईं नासिका को बंद करें और सांस रोकें।अंत में, छठी बार जाप करते हुए दाहिनी नासिका से सांस छोड़ें।इस दौरान, ब्रह्मांड और आप जिस हवा में सांस ले रहे हैं, उसे भरने वाले निराकार परब्रह्म का चिंतन करें।"
            ]
          },
          "slokas": {
            "english": "om̐ namo bhagavate vāsudevāya ।om̐ namaḥśivāya ।om̐ gaṁ gaṇapataye namaḥ ।",
            "telugu": "ఓం నమో భగవతే వాసుదేవాయ ।ఓం నమశ్శివాయ ।ఓం గం గణపతయే నమః ।",
            "devanagari": "ॐ नमो भगवते वासुदेवाय ।ॐ नमः शिवाय ।ॐ गं गणपतये नमः ।"
          }
        }
      ]
    },
    {
      "id": 5,
      "title": {
        "english": "Sankalpam",
        "telugu": "సంకల్పం",
        "devanagari": "सङ्कल्पम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, declare your intention to perform the homam. Transfer the akshatas to your right hand. Place your empty left palm on your right lap, and rest your closed right palm (containing akshatas) on your left palm. Say the following, mentally affirming that you are performing this homam to the best of your ability to please Lord Hanuman. After reciting, leave the akshatas in front of the homa kundam or the idol and sprinkle a little water on your palms. Now, light the ghee/oil lamp."
            ],
            "telugu": [
              "ఇప్పుడు, హోమం చేయాలనే మీ ఉద్దేశాన్ని ప్రకటించండి. అక్షతలను మీ కుడి చేతికి మార్చండి. మీ ఖాళీ ఎడమ అరచేతిని మీ కుడి ఒడిలో ఉంచి, మీ మూసివున్న కుడి అరచేతిని (అక్షతలు ఉన్న) మీ ఎడమ అరచేతిపై ఉంచండి. హనుమంతుని ప్రసన్నం చేసుకోవడానికి మీ సామర్థ్యం మేరకు ఈ హోమం చేస్తున్నారని మానసికంగా ధృవీకరిస్తూ ఈ క్రింది మంత్రాన్ని చెప్పండి. పఠించిన తరువాత, అక్షతలను హోమ కుండం లేదా విగ్రహం ముందు వదిలి, మీ అరచేతులపై కొద్దిగా నీరు చల్లుకోండి. ఇప్పుడు, నెయ్యి/నూనె దీపాన్ని వెలిగించండి."
            ],
            "hindi": [
              "अब, होम करने के अपने इरादे की घोषणा करें।अक्षत को अपने दाहिने हाथ में स्थानांतरित करें।अपनी खाली बाईं हथेली को अपनी दाहिनी गोद में रखें, और अपनी बंद दाहिनी हथेली (जिसमें अक्षत हैं) को अपनी बाईं हथेली पर टिकाएं।निम्नलिखित कहें, मानसिक रूप से पुष्टि करते हुए कि आप भगवान हनुमान को प्रसन्न करने के लिए अपनी पूरी क्षमता से यह होम कर रहे हैं।पाठ करने के बाद, अक्षत को होम कुंड या मूर्ति के सामने छोड़ दें और अपनी हथेलियों पर थोड़ा पानी छिड़कें।अब, घी/तेल का दीपक जलाएं।"
            ]
          },
          "slokas": {
            "english": "om̐ mamopātta samasta duritakṣayadvārā śrī parameśvara prītyartham śrī hanumat prasāda siddhayartham adya śubhadine śubhamuhūrte śrī hanumaddhomakarma yathāśakti kariṣye ।",
            "telugu": "ఓం మమోపాత్త సమస్త దురితక్షయద్వారా శ్రీ పరమేశ్వర ప్రీత్యర్థం శ్రీ హనుమత్ ప్రసాద సిద్ధయర్థం అద్య శుభదినే శుభముహూర్తే శ్రీ హనుమద్ధోమకర్మ యథాశక్తి కరిష్యే ।",
            "devanagari": "ॐ ममोपात्त समस्त दुरितक्षयद्वारा श्री परमेश्वर प्रीत्यर्थम् श्री हनुमत् प्रसाद सिद्धयर्थम् अद्य शुभदिने शुभमुहूर्ते श्री हनुमद्धोमकर्म यथाशक्ति करिष्ये ।"
          }
        }
      ]
    },
    {
      "id": 6,
      "title": {
        "english": "Kalasa Suddhi",
        "telugu": "కలశ శుద్ధి",
        "devanagari": "कलश शुद्धि"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Place a few akshatas and a flower in the tumbler of water.",
              "Chant the syllable 'vaṁ' 11 times to purify the water."
            ],
            "telugu": [
              "నీటి గ్లాసులో కొన్ని అక్షతలు మరియు ఒక పువ్వు ఉంచండి.",
              "నీటిని శుద్ధి చేయడానికి 'వం' అనే బీజాక్షరాన్ని 11 సార్లు జపించండి."
            ],
            "hindi": [
              "पानी के गिलास में कुछ अक्षत और एक फूल रखें।",
              "पानी को शुद्ध करने के लिए 'वं' अक्षर का 11 बार जाप करें।"
            ]
          },
          "slokas": {
            "english": "vaṁ (x11)",
            "telugu": "వం (x11)",
            "devanagari": "वं (x11)"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following verse to invite the essence of sacred rivers into the water."
            ],
            "telugu": [
              "పవిత్ర నదుల సారాంశాన్ని నీటిలోకి ఆహ్వానించడానికి ఈ క్రింది శ్లోకాన్ని పఠించండి."
            ],
            "hindi": [
              "पवित्र नदियों के सार को जल में आमंत्रित करने के लिए निम्नलिखित श्लोक का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "gaṅge ca yamune caiva godāvari sarasvati ।narmade sindhu kāveri jale'smin sannidhiṁ kuru ॥ amṛtaṁ bhavatu",
            "telugu": "గంగే చ యమునే చైవ గోదావరి సరస్వతి ।నర్మదే సింధు కావేరి జలేऽస్మిన్ సన్నిధిం కురు ॥ అమృతం భవతు",
            "devanagari": "गंगे च यमुने चैव गोदावरि सरस्वति ।नर्मदे सिन्धु कावेरि जलेऽस्मिन् सन्निधिं कुरु ॥ अमृतं भवतु"
          }
        },
        {
          "instructions": {
            "english": [
              "Take a little water with a flower or spoon and sprinkle it on yourself, the homa kundam, the idol, and all other pooja materials. Then, take a darbha grass and draw six lines on the base of the homa kundam as shown in the diagram, reciting the corresponding mantra for each line."
            ],
            "telugu": [
              "ఒక పువ్వుతో లేదా చెంచాతో కొద్దిగా నీరు తీసుకుని మీ మీద, హోమ కుండం మీద, విగ్రహం మీద మరియు ఇతర పూజా సామగ్రి మీద చల్లుకోండి. ఆ తరువాత, ఒక దర్భను తీసుకుని, రేఖాచిత్రంలో చూపిన విధంగా హోమ కుండం యొక్క ఆధారంపై ఆరు గీతలను గీయండి, ప్రతి గీతకు సంబంధించిన మంత్రాన్ని పఠించండి."
            ],
            "hindi": [
              "एक फूल या चम्मच से थोड़ा सा पानी लें और उसे अपने ऊपर, होम कुंड, मूर्ति और अन्य सभी पूजा सामग्रियों पर छिड़कें।फिर, एक दर्भ घास लें और चित्र में दिखाए अनुसार होम कुंड के आधार पर छह रेखाएँ खींचें, प्रत्येक रेखा के लिए संबंधित मंत्र का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "om̐ brahmaṇe namaḥ ।om̐ yamāya namaḥ ।om̐ somāya namaḥ ।om̐ rudrāya namaḥ ।om̐ viṣṇave namaḥ ।om̐ indrāya namaḥ ।",
            "telugu": "ఓం బ్రహ్మణే నమః ।ఓం యమాయ నమః ।ఓం సోమాయ నమః ।ఓం రుద్రాయ నమః ।ఓం విష్ణవే నమః ।ఓం ఇంద్రాయ నమః ।",
            "devanagari": "ॐ ब्रह्मणे नमः ।ॐ यमाय नमः ।ॐ सोमाय नमः ।ॐ रुद्राय नमः ।ॐ विष्णवे नमः ।ॐ इन्द्राय नमः ।"
          },
          "diagram": "/diagrams/homa-kundam-6-lines.svg"
        }
      ]
    },
    {
      "id": 7,
      "title": {
        "english": "Agni Pratishthaapana",
        "telugu": "అగ్ని ప్రతిష్ఠాపన",
        "devanagari": "अग्नि प्रतिष्ठापन"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Place two darbhas on the base of the homa kundam, one pointing east-west and the other north-south. Light a piece of camphor from the lamp and place it in the center of the kundam while chanting 'om̐ bhūrbhuvassuvarom'. Place dry coconut pieces or wood over the camphor to start the fire."
            ],
            "telugu": [
              "హోమ కుండం యొక్క ఆధారంపై రెండు దర్భలను ఉంచండి, ఒకటి తూర్పు-పడమర ముఖంగా మరియు మరొకటి ఉత్తర-దక్షిణ ముఖంగా. దీపం నుండి కర్పూరం ముక్కను వెలిగించి, 'ఓం భూర్భువస్సువరోం' అని జపిస్తూ కుండం మధ్యలో ఉంచండి. నిప్పును ప్రారంభించడానికి కర్పూరం మీద ఎండిన కొబ్బరి ముక్కలు లేదా కలపను ఉంచండి."
            ],
            "hindi": [
              "होम कुंड के आधार पर दो दर्भ रखें, एक पूर्व-पश्चिम की ओर और दूसरा उत्तर-दक्षिण की ओर।दीपक से कपूर का एक टुकड़ा जलाएं और 'ॐ भूर्भुवस्सुवरोम्' का जाप करते हुए उसे कुंड के केंद्र में रखें।आग शुरू करने के लिए कपूर के ऊपर सूखे नारियल के टुकड़े या लकड़ी रखें।"
            ]
          },
          "slokas": {
            "english": "om̐ bhūrbhuvassuvarom ।",
            "telugu": "ఓం భూర్భువస్సువరోం ।",
            "devanagari": "ॐ भूर्भुवस्सुवरोम् ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Pray to the fire god with the following Rig Veda mantra, requesting him to remove the inauspicious 'kravyaada' fire and carry offerings through the auspicious 'jaatavedas' fire."
            ],
            "telugu": [
              "ఈ క్రింది ఋగ్వేద మంత్రంతో అగ్ని దేవుడిని ప్రార్థించండి, అశుభకరమైన 'క్రవ్యాద' అగ్నిని తొలగించి, శుభకరమైన 'జాతవేద' అగ్ని ద్వారా నైవేద్యాలను చేరవేయమని అభ్యర్థించండి."
            ],
            "hindi": [
              "निम्नलिखित ऋग्वेद मंत्र के साथ अग्नि देव से प्रार्थना करें, उनसे अशुभ 'क्रव्याद' अग्नि को हटाने और शुभ 'जातवेद' अग्नि के माध्यम से आहुतियों को ले जाने का अनुरोध करें।"
            ]
          },
          "slokas": {
            "english": "kravyādamagniṁ prahiṇomi dūraṁ yamarājño gacchatu ripravāhaḥ ।ihaivāyamitaro jātavedā devebhyo havyaṁ vahatu prajānan ।",
            "telugu": "క్రవ్యాదమగ్నిం ప్రహిణోమి దూరం యమరాజ్ఞో గచ్ఛతు రిప్రవాహః ।ఇహైవాయమితరో జాతవేదా దేవేభ్యో హవ్యం వహతు ప్రజానన్ ।",
            "devanagari": "क्रव्यादमग्निं प्रहिणोमि दूरं यमराज्ञो गच्छतु रिप्रवाहः ।इहैवायमितरो जातवेदा देवेभ्यो हव्यं वहतु प्रजानन् ।"
          }
        },
        {
          "instructions": {
            "english": [
              "To refine the fire (samskara), pour 8 drops of ghee into the fire while chanting the following mantra 8 times."
            ],
            "telugu": [
              "అగ్నిని శుద్ధి చేయడానికి (సంస్కారం), ఈ క్రింది మంత్రాన్ని 8 సార్లు జపిస్తూ అగ్నిలో 8 చుక్కల నెయ్యి పోయండి."
            ],
            "hindi": [
              "अग्नि को परिष्कृत (संस्कार) करने के लिए, निम्नलिखित मंत्र का 8 बार जाप करते हुए अग्नि में घी की 8 बूँदें डालें।"
            ]
          },
          "slokas": {
            "english": "om̐ bhūrbhuvassuvaḥ svāhā ।",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా ।",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Place darbhas (or twigs) along the four boundaries of the homa kundam: eastern (tips north), southern (tips east), western (tips north), and northern (tips east). Then, sprinkle water outside the kundam on its four boundaries in the order shown in the diagram (south, west, north, east), reciting the corresponding mantras."
            ],
            "telugu": [
              "హోమ కుండం యొక్క నాలుగు సరిహద్దుల వెంబడి దర్భలను (లేదా కొమ్మలను) ఉంచండి: తూర్పు (కొనలు ఉత్తరం), దక్షిణం (కొనలు తూర్పు), పడమర (కొనలు ఉత్తరం), మరియు ఉత్తరం (కొనలు తూర్పు). ఆ తరువాత, రేఖాచిత్రంలో చూపిన క్రమంలో (దక్షిణం, పడమర, ఉత్తరం, తూర్పు) దాని నాలుగు సరిహద్దులపై కుండం వెలుపల నీటిని చల్లుకోండి, సంబంధిత మంత్రాలను పఠిస్తూ."
            ],
            "hindi": [
              "होम कुंड की चार सीमाओं पर दर्भ (या टहनियाँ) रखें: पूर्वी (सिरे उत्तर की ओर), दक्षिणी (सिरे पूर्व की ओर), पश्चिमी (सिरे उत्तर की ओर), और उत्तरी (सिरे पूर्व की ओर)।फिर, चित्र में दिखाए गए क्रम में (दक्षिण, पश्चिम, उत्तर, पूर्व) कुंड के बाहर उसकी चार सीमाओं पर पानी छिड़कें, और संबंधित मंत्रों का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "adite'numanyasva ।anumate'numanyasva ।sarasvate'numanyasva ।deva savitaḥ prasuva ।",
            "telugu": "అదితేऽనుమన్యస్వ ।అనుమతేऽనుమన్యస్వ ।సరస్వతేऽనుమన్యస్వ ।దేవ సవితః ప్రసువ ।",
            "devanagari": "अदितेऽनुमन्यस्व ।अनुमतेऽनुमन्यस्व ।सरस्वतेऽनुमन्यस्व ।देव सवितः प्रसुव ।"
          },
          "diagram": "/diagrams/agni-pratisthapana-4-dirs.svg"
        },
        {
          "instructions": {
            "english": [
              "Now pray to Agni (fire god) with the following mantra, asking him to be present and face you."
            ],
            "telugu": [
              "ఇప్పుడు ఈ క్రింది మంత్రంతో అగ్ని దేవుడిని ప్రార్థించండి, ఆయనను ప్రత్యక్షమై మిమ్మల్ని చూడమని కోరండి."
            ],
            "hindi": [
              "अब निम्नलिखित मंत्र के साथ अग्नि (अग्नि देव) से प्रार्थना करें, और उनसे उपस्थित होकर आपका सामना करने के लिए कहें।"
            ]
          },
          "slokas": {
            "english": "catvāri śṛṁgāstrayo asya pādā dve śīrṣe saptahastāso asya ।tridhā baddho vṛṣabho roravīti maho devo martyāṁ āviveśa ।eṣa hi devaḥ pradiśo nu sarvāḥ pūrvī hi jātaḥ sa u garne antaḥ ।sa vijāyamānaḥ sa janiṣyamāṇaḥ pratyaṅmukhāstiṣṭhati viśvatomukhaḥ ।prāṅmukho deva ।he agne ।mamābhimukho bhava ।",
            "telugu": "చత్వారి శృంగాస్త్రయో అస్య పాదా ద్వే శీర్షే సప్తహస్తాసో అస్య ।త్రిధా బద్ధో వృషభో రోరవీతి మహో దేవో మర్త్యాం ఆవివేశ ।ఏష హి దేవః ప్రదిశో ను సర్వాః పూర్వీ హి జాతః స ఉ గర్నే అంతః ।స విజాయమానః స జనిష్యమాణః ప్రత్యఙ్ముఖాస్తిష్ఠతి విశ్వతోముఖః ।ప్రాఙ్ముఖో దేవ ।హే అగ్నే ।మమాభిముఖో భవ ।",
            "devanagari": "चत्वारि शृंगास्त्रयो अस्य पादा द्वे शीर्षे सप्तहस्तासो अस्य ।त्रिधा बद्धो वृषभो रोरवीति महो देवो मर्त्यां आविवेश ।एष हि देवः प्रदिशो नु सर्वाः पूर्वी हि जातः स उ गर्ने अन्तः ।स विजायमानः स जनिष्यमाणः प्रत्यङ्मुखास्तिष्ठति विश्वतोमुखः ।प्राङ्मुखो देव ।हे अग्ने।ममाभिमुखो भव ।"
          }
        }
      ]
    },
    {
      "id": 8,
      "title": {
        "english": "Dikpaalaka Pooja",
        "telugu": "దిక్పాలక పూజ",
        "devanagari": "दिक्पालक पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take akshatas and flowers and offer them to the rulers of the directions. Starting from the eastern edge of the homa kundam, move clockwise (East, Southeast, South, etc.) placing offerings on the edges for the eight directions. Then, make offerings to Brahma (upward) between Northeast and East, and to Sesha (downward) between Southwest and West. Offer to Agni in the center of the kundam, and finally, touch your heart to offer respect to the Self (Atma). Recite the following 12 mantras for these 12 offerings."
            ],
            "telugu": [
              "అక్షతలు మరియు పువ్వులు తీసుకుని దిక్పాలకులకు సమర్పించండి. హోమ కుండం యొక్క తూర్పు అంచు నుండి ప్రారంభించి, సవ్యదిశలో (తూర్పు, ఆగ్నేయం, దక్షిణం, మొదలైనవి) కదులుతూ ఎనిమిది దిశలకు అంచులపై నైవేద్యాలు ఉంచండి. ఆ తరువాత, ఈశాన్యం మరియు తూర్పు మధ్య బ్రహ్మకు (పైకి), మరియు నైరుతి మరియు పడమర మధ్య శేషునికి (క్రిందికి) నైవేద్యాలు సమర్పించండి. కుండం మధ్యలో అగ్నికి సమర్పించి, చివరగా, ఆత్మకు గౌరవం ఇవ్వడానికి మీ హృదయాన్ని తాకండి. ఈ 12 నైవేద్యాల కోసం ఈ క్రింది 12 మంత్రాలను పఠించండి."
            ],
            "hindi": [
              "अक्षत और फूल लेकर दिशाओं के शासकों को अर्पित करें।होम कुंड के पूर्वी किनारे से शुरू होकर, दक्षिणावर्त (पूर्व, दक्षिण-पूर्व, दक्षिण, आदि) घूमते हुए आठ दिशाओं के लिए किनारों पर प्रसाद रखें।फिर, उत्तर-पूर्व और पूर्व के बीच ब्रह्मा (ऊपर की ओर) और दक्षिण-पश्चिम और पश्चिम के बीच शेष (नीचे की ओर) को प्रसाद चढ़ाएं।कुंड के केंद्र में अग्नि को अर्पित करें, और अंत में, आत्मा (स्वयं) को सम्मान देने के लिए अपने हृदय को स्पर्श करें।इन 12 प्रसादों के लिए निम्नलिखित 12 मंत्रों का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "om̐ indrāya namaḥ ।om̐ agnaye namaḥ ।om̐ yamāya namaḥ ।om̐ nirṛtaye namaḥ ।om̐ varuṇāya namaḥ ।om̐ vāyave namaḥ ।om̐ somāya namaḥ ।om̐ īśānāya namaḥ ।om̐ brahmaṇe namaḥ ।om̐ śeṣāya namaḥ ।om̐ agnaye namaḥ ।om̐ ātmane namaḥ ।",
            "telugu": "ఓం ఇంద్రాయ నమః ।ఓం అగ్నయే నమః ।ఓం యమాయ నమః ।ఓం నిరృతయే నమః ।ఓం వరుణాయ నమః ।ఓం వాయవే నమః ।ఓం సోమాయ నమః ।ఓం ఈశానాయ నమః ।ఓం బ్రహ్మణే నమః ।ఓం శేషాయ నమః ।ఓం అగ్నయే నమః ।ఓం ఆత్మనే నమః ।",
            "devanagari": "ॐ इन्द्राय नमः।ॐ अग्नये नमः।ॐ यमाय नमः।ॐ निर्ऋतये नमः ।ॐ वरुणाय नमः।ॐ वायवे नमः ।ॐ सोमाय नमः।ॐ ईशानाय नमः।ॐ ब्रह्मणे नमः ।ॐ शेषाय नमः ।ॐ अग्नये नमः।ॐ आत्मने नमः ।"
          }
        }
      ]
    },
    {
      "id": 9,
      "title": {
        "english": "Poorvaangam",
        "telugu": "పూర్వాంగం",
        "devanagari": "पूर्वाङ्गम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Hold the wooden ladle pointing from northwest to southeast and offer a drop of ghee into the fire for Prajapati (progenitor of all beings)."
            ],
            "telugu": [
              "చెక్క గరిటెను వాయువ్యం నుండి ఆగ్నేయం వైపు చూపిస్తూ పట్టుకుని, ప్రజాపతి (సర్వ జీవుల సృష్టికర్త) కోసం అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "लकड़ी की करछुल को उत्तर-पश्चिम से दक्षिण-पूर्व की ओर इंगित करते हुए पकड़ें और प्रजापति (सभी प्राणियों के जनक) के लिए अग्नि में घी की एक बूंद अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ prajāpataye svāhā ।prajāpataya idaṁ na mama ।",
            "telugu": "ఓం ప్రజాపతయే స్వాహా ।ప్రజాపతయ ఇదం న మమ ।",
            "devanagari": "ॐ प्रजापतये स्वाहा।प्रजापतय इदं न मम ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, hold the ladle pointing from southwest to northeast and offer a drop of ghee for Indra (ruler of gods)."
            ],
            "telugu": [
              "ఇప్పుడు, గరిటెను నైరుతి నుండి ఈశాన్యం వైపు చూపిస్తూ పట్టుకుని, ఇంద్రుని (దేవతల రాజు) కోసం ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "अब, करछुल को दक्षिण-पश्चिम से उत्तर-पूर्व की ओर इंगित करते हुए पकड़ें और इंद्र (देवताओं के शासक) के लिए घी की एक बूंद अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ indrāya svāhā ।indrāyedaṁ na mama ।",
            "telugu": "ఓం ఇంద్రాయ స్వాహా ।ఇంద్రాయేదం న మమ ।",
            "devanagari": "ॐ इन्द्राय स्वाहा।इन्द्रायेदं न मम ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer a little ghee to Agni (fire god) in the middle of the fire."
            ],
            "telugu": [
              "అగ్ని మధ్యలో అగ్ని దేవునికి కొద్దిగా నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "अग्नि के मध्य में अग्नि देव को थोड़ा घी अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ agnaye svāhā ।agnaya idaṁ na mama ।",
            "telugu": "ఓం అగ్నయే స్వాహా ।అగ్నయ ఇదం న మమ ।",
            "devanagari": "ॐ अग्नये स्वाहा।अग्नय इदं न मम ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Then offer a little ghee to Soma (god of nourishment) in the upper half of the northern side of the homa kundam."
            ],
            "telugu": [
              "ఆ తర్వాత హోమ కుండం యొక్క ఉత్తర భాగంలో పైభాగంలో సోమునికి (పోషణ దేవుడు) కొద్దిగా నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "फिर होम कुंड के उत्तरी भाग के ऊपरी आधे हिस्से में सोम (पोषण के देवता) को थोड़ा घी अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ somāya svāhā ।somāyedaṁ na mama ।",
            "telugu": "ఓం సోమాయ స్వాహా ।సోమాయేదం న మమ ।",
            "devanagari": "ॐ सोमाय स्वाहा ।सोमायेदं न मम ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, offer a 'forgiveness offering' to Prajapati again to request forgiveness for any mistakes made in the homam up to this point."
            ],
            "telugu": [
              "ఇప్పుడు, ఈ సమయం వరకు హోమంలో జరిగిన ఏవైనా తప్పులకు క్షమాపణ కోరుతూ ప్రజాపతికి మళ్లీ 'క్షమాపణ నైవేద్యం' సమర్పించండి."
            ],
            "hindi": [
              "अब, इस बिंदु तक होम में हुई किसी भी गलती के लिए क्षमा मांगने के लिए प्रजापति को फिर से 'क्षमा अर्पण' करें।"
            ]
          },
          "slokas": {
            "english": "āraṁbhaprabhṛti etatkṣaṇaparyantaṁ madhye saṁbhāvita samasta doṣa prāyaścittārthaṁ sarva prāyaścittaṁ hoṣyāmi ।om̐ bhūrbhuvassuvaḥ svāhā ।prajāpataya idaṁ na mama ।",
            "telugu": "ఆరంభప్రభృతి ఏతత్క్షణపర్యంతం మధ్యే సంభావిత సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తం హోష్యామి ।ఓం భూర్భువస్సువః స్వాహా ।ప్రజాపతయ ఇదం న మమ ।",
            "devanagari": "आरंभप्रभृति एतत्क्षणपर्यन्तं मध्ये संभावित समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्तं होष्यामि ।ॐ भूर्भुवस्सुवः स्वाहा।प्रजापतय इदं न मम ।"
          }
        }
      ]
    },
    {
      "id": 10,
      "title": {
        "english": "Quick Homam for Mahaganapathi",
        "telugu": "మహాగణపతి శీఘ్ర హోమం",
        "devanagari": "महागणपति शीघ्र होम"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Before invoking the main deity (Lord Hanuman), a quick pooja for Mahaganapathi in the fire is performed for the removal of obstacles. Invoke Mahaganapathi into the fire while chanting the following."
            ],
            "telugu": [
              "ప్రధాన దేవతను (హనుమంతుడిని) ఆహ్వానించే ముందు, అడ్డంకులను తొలగించడానికి అగ్నిలో మహాగణపతికి శీఘ్ర పూజ చేయబడుతుంది. ఈ క్రింది మంత్రాన్ని జపిస్తూ మహాగణపతిని అగ్నిలోకి ఆహ్వానించండి."
            ],
            "hindi": [
              "मुख्य देवता (भगवान हनुमान) का आह्वान करने से पहले, बाधाओं को दूर करने के लिए अग्नि में महागणपति की एक त्वरित पूजा की जाती है।निम्नलिखित का जाप करते हुए महागणपति को अग्नि में आमंत्रित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ gaṁ gaṇapataye namaḥ ।asunī te punarasmāsu cakṣuḥ punaḥ prāṇamiha no dehi bhogaṁ ।jyokpaśyema sūryamuccarantamanumate mṛḷayā naḥ svasti ।om̐ śrī mahāgaṇapati prāṇaśaktyai namaḥ ।atra āgaccha ।āvāhito bhava ।sthāpito bhava ।sannihito bhava ।sanniruddho bhava ।avakuṇṭhito bhava ।prasīda prasīda ।",
            "telugu": "ఓం గం గణపతయే నమః ।అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం ।జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి ।ఓం శ్రీ మహాగణపతి ప్రాణశక్త్యై నమః ।అత్ర ఆగచ్ఛ ।ఆవాహితో భవ ।స్థాపిటో భవ ।సన్నిహితో భవ ।సన్నిరుద్ధో భవ ।అవకుంఠితో భవ ।ప్రసీద ప్రసీద ।",
            "devanagari": "ॐ गं गणपतये नमः।असुनी ते पुनरस्मासु चक्षुः पुनः प्राणमिह नो देहि भोगं।ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति ।ॐ श्री महागणपति प्राणशत्क्त्यै नमः।अत्र आगच्छ।आवाहितो भव ।स्थापितो भव ।सन्निहितो भव ।सन्निरुद्धो भव ।अवकुंठितो भव ।प्रसीद प्रसीद ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, we offer worship with several services to Mahaganapathi in the fire. Say the following and offer sandalwood powder/paste, turmeric, and kumkum into the fire."
            ],
            "telugu": [
              "ఇప్పుడు, మనం అగ్నిలో మహాగణపతికి అనేక సేవలతో పూజ చేస్తాము. ఈ క్రింది మంత్రాన్ని చెప్పి గంధపు పొడి/పేస్ట్, పసుపు, మరియు కుంకుమను అగ్నిలో సమర్పించండి."
            ],
            "hindi": [
              "अब, हम अग्नि में महागणपति की कई सेवाओं के साथ पूजा करते हैं।निम्नलिखित कहें और चंदन पाउडर/पेस्ट, हल्दी, और कुमकुम अग्नि में अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "laṁ pṛthivyātmane namaḥ ।gandhaṁ samarpayāmi ।",
            "telugu": "లం పృథివ్యాత్మనే నమః ।గంధం సమర్పయామి ।",
            "devanagari": "लं पृथिव्यात्मने नमः।गन्धं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer a flower (or a petal) to Mahaganapathi in the fire."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి అగ్నిలో మహాగణపతికి ఒక పువ్వును (లేదా రేకును) సమర్పించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और अग्नि में महागणपति को एक फूल (या एक पंखुड़ी) अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "haṁ ākāśātmane namaḥ ।puṣpaṁ samarpayāmi ।",
            "telugu": "హం ఆకాశాత్మనే నమః ।పుష్పం సమర్పయామి ।",
            "devanagari": "हं आकाशात्मने नमः ।पुष्पं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer dhoopam (incense). Light an incense stick, and after it burns brightly, extinguish the flame, leaving only smoke. Show the smoke to the fire in the homa kundam. You can also offer the entire stick into the fire."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి ధూపం (అగరుబత్తి) సమర్పించండి. అగరుబత్తిని వెలిగించి, అది బాగా మండిన తర్వాత, మంటను ఆర్పివేయండి, పొగ మాత్రమే మిగిలి ఉంటుంది. ఆ పొగను హోమ కుండంలోని అగ్నికి చూపించండి. మీరు మొత్తం అగరుబత్తిని అగ్నిలో సమర్పించవచ్చు."
            ],
            "hindi": [
              "निम्नलिखित कहें और धूप (अगरबत्ती) अर्पित करें।अगरबत्ती जलाएं, और जब यह अच्छी तरह से जल जाए, तो लौ को बुझा दें, केवल धुआं छोड़ दें।धुएं को होम कुंड में अग्नि को दिखाएं।आप पूरी अगरबत्ती को भी अग्नि में अर्पित कर सकते हैं।"
            ]
          },
          "slokas": {
            "english": "yaṁ vāyvātmane namaḥ ।dhūpaṁ āghrāpayāmi ।",
            "telugu": "యం వాయ్వాత్మనే నమః ।ధూపం ఆఘ్రాపయామి ।",
            "devanagari": "यं वाय्वात्मने नमः।धूपं आघ्रापयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and show the deepam (lamp) to Mahaganapathi in the fire."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి అగ్నిలో మహాగణపతికి దీపం చూపించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और अग्नि में महागणपति को दीपक (दीया) दिखाएं।"
            ]
          },
          "slokas": {
            "english": "raṁ agnyātmane namaḥ ।dīpaṁ darśayāmi ।",
            "telugu": "రం అగ్న్యాత్మనే నమః ।దీపం దర్శయామి ।",
            "devanagari": "रं अग्न्यात्मने नमः।दीपं दर्शयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer some food (cooked food, a fruit, jaggery, or sugar) to Mahaganapathi. Show it to the fire and offer a little bit into the fire. Keep the main offering for Lord Hanuman."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి మహాగణపతికి కొంత ఆహారాన్ని (వండిన ఆహారం, పండు, బెల్లం, లేదా పంచదార) సమర్పించండి. దానిని అగ్నికి చూపించి, కొద్దిగా అగ్నిలో వేయండి. ప్రధాన నైవేద్యాన్ని హనుమంతుని కోసం ఉంచండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और महागणपति को कुछ भोजन (पका हुआ भोजन, फल, गुड़, या चीनी) अर्पित करें।इसे अग्नि को दिखाएं और थोड़ा सा अग्नि में अर्पित करें।मुख्य प्रसाद भगवान हनुमान के लिए रखें।"
            ]
          },
          "slokas": {
            "english": "vaṁ amṛtātmane namaḥ ।naivedyaṁ samarpayāmi ।",
            "telugu": "వం అమృతాత్మనే నమః ।నైవేద్యం సమర్పయామి ।",
            "devanagari": "वं अमृतात्मने नमः ।नैवेद्यं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer some akshatas to Mahaganapathi in the fire. This mantra signifies offering 'all services' to Him."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి అగ్నిలో మహాగణపతికి కొన్ని అక్షతలను సమర్పించండి. ఈ మంత్రం ఆయనకు 'సర్వ సేవలు' సమర్పిస్తున్నట్లు సూచిస్తుంది."
            ],
            "hindi": [
              "निम्नलिखित कहें और अग्नि में महागणपति को कुछ अक्षत अर्पित करें।यह मंत्र उन्हें 'सभी सेवाएं' अर्पित करने का प्रतीक है।"
            ]
          },
          "slokas": {
            "english": "saṁ sarvātmane namaḥ ।sarvopacārān samarpayāmi ।",
            "telugu": "సం సర్వాత్మనే నమః ।సర్వోపచారాన్ సమర్పయామి ।",
            "devanagari": "सं सर्वात्मने नमः ।सर्वोपचारान् समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, say the following mantra and offer ghee (or other permitted materials) into the fire for Mahaganapathi. Repeat this 4, 8, or 12 times."
            ],
            "telugu": [
              "ఇప్పుడు, ఈ క్రింది మంత్రాన్ని చెప్పి మహాగణపతి కోసం అగ్నిలో నెయ్యి (లేదా ఇతర అనుమతించబడిన పదార్థాలు) సమర్పించండి. దీనిని 4, 8, లేదా 12 సార్లు పునరావృతం చేయండి."
            ],
            "hindi": [
              "अब, निम्नलिखित मंत्र कहें और महागणपति के लिए अग्नि में घी (या अन्य अनुमत सामग्री) अर्पित करें।इसे 4, 8 या 12 बार दोहराएं।"
            ]
          },
          "slokas": {
            "english": "om̐ gaṁ gaṇapataye namaḥ ।svāhā ।",
            "telugu": "ఓం గం గణపతయే నమః ।స్వాహా ।",
            "devanagari": "ॐ गं गणपतये नमः ।स्वाहा।"
          }
        }
      ]
    },
    {
      "id": 11,
      "title": {
        "english": "Praana Pratishthaapanaa",
        "telugu": "ప్రాణ ప్రతిష్ఠాపన",
        "devanagari": "प्राण प्रतिष्ठापन"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, we invoke the main deity. If you know how to perform anganyasam and karanyasam, do so while reciting the following. Otherwise, just read the text."
            ],
            "telugu": [
              "ఇప్పుడు, మనం ప్రధాన దేవతను ఆహ్వానిస్తాం. మీకు అంగన్యాసం మరియు కరన్యాసం చేయడం తెలిస్తే, ఈ క్రింది మంత్రాన్ని పఠిస్తూ వాటిని చేయండి. లేకపోతే, కేవలం మంత్రాన్ని చదవండి."
            ],
            "hindi": [
              "अब, हम मुख्य देवता का आह्वान करते हैं।यदि आप अंगन्यास और करन्यास करना जानते हैं, तो निम्नलिखित का पाठ करते हुए ऐसा करें।अन्यथा, बस पाठ पढ़ें।"
            ]
          },
          "slokas": {
            "english": "asya śrī prāṇapratiṣṭhāpana maṁtrasya brahma viṣṇu maheśvarā ṛṣayaḥ ṛgyajussāmātharvāṇi chaṁdāsi śrī hanumān devatā ।hāṁ bījaṁ ।hīṁ śaktiḥ ।hūṁ kīlakaṁ ।hāṁ aṁguṣṭhābhyāṁ namaḥ ।hīṁ tarjanībhyāṁ namaḥ ।hūṁ madhyamābhyāṁ namaḥ ।haiṁ anāmikābhyāṁ namaḥ ।hauṁ kaniṣṭhikābhyāṁ namaḥ ।haḥ karatala karapṛṣṭhābhyāṁ namaḥ ।hāṁ hṛdayāya namaḥ ।hīṁ śirase svāhā ।hūṁ śikhāyai vaṣaṭ ।haiṁ kavacāya hūṁ ।hauṁ netratrayāya vauṣaṭ ।haḥ astrāya phaṭ ।bhūrbhuvassuvaromiti digbaṁdhaḥ ।",
            "telugu": "అస్య శ్రీ ప్రాణప్రతిష్ఠాపన మంత్రస్య బ్రహ్మ విష్ణు మహేశ్వరా ఋషయః ఋగ్యజుస్సామాథర్వాణి ఛందాంసి శ్రీ హనుమాన్ దేవతా ।హాం బీజం ।హీం శక్తిః ।హూం కీలకం ।హాం అంగుష్ఠాభ్యాం నమః ।హీం తర్జనీభ్యాం నమః ।హూం మధ్యమాభ్యాం నమః ।హైం అనామికాభ్యాం నమః ।హౌం కనిష్ఠికాభ్యాం నమః ।హః కరతల కరపృష్ఠాభ్యాం నమః ।హాం హృదయాయ నమః ।హీం శిరసే స్వాహా ।హూం శిఖాయై వషట్ ।హైం కవచాయ హూం ।హౌం నేత్రత్రయాయ వౌషట్ ।హః అస్త్రాయ ఫట్ ।భూర్భువస్సువరోమితి దిగ్బంధః ।",
            "devanagari": "अस्य श्री प्राणप्रतिष्ठापन मंत्रस्य ब्रह्म विष्णु महेश्वरा ऋषयः ऋग्यजुस्सामाथर्वाणि छन्दासि श्री हनुमान् देवता।हां बीजं।हीं शक्तिः।हूं कीलकं ।हां अंगुष्ठाभ्यां नमः।हीं तर्जनीभ्यां नमः।हूं मध्यमाभ्यां नमः।हैं अनामिकाभ्यां नमः ।हौं कनिष्ठिकाभ्यां नमः।हः करतल करपृष्ठाभ्यां नमः।हां हृदयाय नमः।हीं शिरसे स्वाहा।हूं शिखायै वषट् ।हैं कवचाय हूं।हौं नेत्रत्रयाय वौषट् ।हः अस्त्राय फट् ।भूर्भुवस्सुवरोमिति दिग्बंधः ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the Dhyanam (meditation verse) for Lord Hanuman."
            ],
            "telugu": [
              "హనుమంతుని కోసం ధ్యాన శ్లోకాన్ని పఠించండి."
            ],
            "hindi": [
              "भगवान हनुमान के लिए ध्यानम् (ध्यान श्लोक) का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "dhyānaṁ - manojavam māruta tulya vegaṁ ।jitendriyaṁ buddhimatāṁ variṣṭhaṁ ।vātātmajaṁ vānara yūdha mukhyaṁ ।śrī rāma dūtaṁ śirasā namāmi ।",
            "telugu": "ధ్యానం - మనోజవం మారుత తుల్య వేగం ।జితేంద్రియం బుద్ధిమతాం వరిష్ఠం ।వాతాత్మజం వానర యూధ ముఖ్యం ।శ్రీ రామ దూతం శిరసా నమామి ।",
            "devanagari": "ध्यानं - मनोजवं मारुत तुल्य वेगं ।जितेंद्रियं बुद्धिमतां वरिष्ठं ।वातात्मजं वानर यूध मुख्यं ।श्री राम दूतं शिरसा नमामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, invoke the deity into the fire and the idol with the following mantra. While reciting, imagine that Lord Hanuman, who resides in your own heart, is entering the fire and the idol."
            ],
            "telugu": [
              "ఇప్పుడు, ఈ క్రింది మంత్రంతో దేవతను అగ్నిలోకి మరియు విగ్రహంలోకి ఆహ్వానించండి. పఠిస్తున్నప్పుడు, మీ హృదయంలో నివసించే హనుమంతుడు అగ్నిలోకి మరియు విగ్రహంలోకి ప్రవేశిస్తున్నాడని భావించండి."
            ],
            "hindi": [
              "अब, निम्नलिखित मंत्र के साथ देवता को अग्नि और मूर्ति में आमंत्रित करें।पाठ करते समय, कल्पना करें कि आपके हृदय में निवास करने वाले भगवान हनुमान अग्नि और मूर्ति में प्रवेश कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om̐ hāṁ hīṁ hūṁ yaraṁlaṁvaṁśaṁṣaṁsaṁhaṁḻaṁkṣaṁ ।om̐ haṁsaḥ so'haṁ so'haṁ haṁsaḥ ।śrī hanumataḥ prāṇa iha prāṇaḥ ।jīva iha sthitaḥ ।sarvendriyāṇi vāṅmanastvak cakṣuḥ śrotra jihvāghrāṇa prāṇāpānavyānodānasamānāḥ ihaivāgatya sukhaṁ ciraṁ tiṣṭhantu svāhā ।sānnidhyaṁ kurvantu svāhā ।asunī te punarasmāsu cakṣuḥ punaḥ prāṇamiha no dehi bhogaṁ ।jyokpaśyema sūryamuccarantamanumate mṛḷayā naḥ svasti ।hāṁ hīṁ hauṁ ।hauṁ hīṁ hāṁ ।hanumatprāṇaśaktyai namaḥ ।atra āgaccha ।",
            "telugu": "ఓం హాం హీం హూం యరంలంవంశంషంసంహంళంక్షం ।ఓం హంసః సోऽహం సోऽహం హంసః ।శ్రీ హనుమతః ప్రాణ ఇహ ప్రాణః ।జీవ ఇహ స్థితః ।సర్వేంద్రియాణి వాఙ్మనస్త్వక్ చక్షుః శ్రోత్ర జిహ్వాఘ్రాణ ప్రాణాపానవ్యానోదానసమానాః ఇహైవాగత్య సుఖం చిరం తిష్ఠन्तु స్వాహా ।సాన్నిధ్యం కుర్వంతు స్వాహా ।అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం ।జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి ।హాం హీం హౌం ।హౌం హీం హాం ।హనుమత్ప్రాణశక్త్యై నమః ।అత్ర ఆగచ్ఛ ।",
            "devanagari": "ॐ हां हीं हूं यंरंलंवंशंषंसंहंळं क्षं।ॐ हंसः सोऽहं सोऽहं हंसः।श्री हनुमतः प्राण इह प्राणः।जीव इह स्थितः ।सर्वेन्द्रियाणि वाङ्मनस्त्वक् चक्षुः श्रोत्र जिह्वाघ्राण प्राणापानव्यानोदानसमानाः इहैवागत्य सुखं चिरं तिष्ठन्तु स्वाहा।सान्निध्यं कुर्वन्तु स्वाहा।असुनी ते पुनरस्मासु चक्षुः पुनः प्राणमिह नो देहि भोगं।ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति।हां हीं हौं ।हौं हीं हां।हनुमत्प्राणशत्क्त्यै नमः।अत्र आगच्छ ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Read the following and perform the aavaahani, samsthaapani, sannidhaapani, sannirodhini, and avakunthana mudras if you know them. If not, just read the text. While reciting, pray to Lord Hanuman in your mind, asking him to stay in the fire and the idol until the homam concludes. From this point on, firmly believe that Lord Hanuman is present in the fire."
            ],
            "telugu": [
              "ఈ క్రింది వాటిని చదవండి మరియు మీకు తెలిస్తే ఆవాహని, సంస్థాపని, సన్నిధాపని, సన్నిరోధిని, మరియు అవకుంఠన ముద్రలను ప్రదర్శించండి. లేకపోతే, కేవలం మంత్రాన్ని చదవండి. పఠిస్తున్నప్పుడు, హోమం ముగిసే వరకు అగ్నిలో మరియు విగ్రహంలో ఉండమని హనుమంతుని మీ మనస్సులో ప్రార్థించండి. ఈ సమయం నుండి, హనుమంతుడు అగ్నిలో ఉన్నాడని దృఢంగా నమ్మండి."
            ],
            "hindi": [
              "निम्नलिखित पढ़ें और यदि आप जानते हैं तो आवाहनी, संस्थापनी, सन्निधापनी, सन्निरोधिनी, और अवकुण्ठन मुद्राएं करें।यदि नहीं, तो बस पाठ पढ़ें।पाठ करते समय, अपने मन में भगवान हनुमान से प्रार्थना करें, और उनसे होम समाप्त होने तक अग्नि और मूर्ति में रहने के लिए कहें।इस बिंदु से, दृढ़ता से विश्वास करें कि भगवान हनुमान अग्नि में मौजूद हैं।"
            ]
          },
          "slokas": {
            "english": "āvāhito bhava ।sthāpito bhava ।sannihito bhava ।sanniruddho bhava ।avakuṇṭhito bhava ।deva prasīda prasīda ।yāvaddhomāvasānakam ।tāvattvaṁ prītibhāvena mūrtau agnau ca sannidhiṁ kuru ।",
            "telugu": "ఆవాహితో భవ ।స్థాపితో భవ ।సన్నిహితో భవ ।సన్నిరుద్ధో భవ ।అవకుంఠితో భవ ।దేవ ప్రసీద ప్రసీద ।యావద్ధోమావసానకం ।తావత్త్వం ప్రీతిభావేన మూర్తౌ అగ్నౌ చ సన్నిధిం కురు ।",
            "devanagari": "आवाहितो भव ।स्थापितो भव ।सन्निहितो भव ।सन्निरुद्धो भव ।अवकुंठितो भव ।देव प्रसीद प्रसीद ।यावद्धोमावसानकम् ।तावत्त्वं प्रीतिभावेन मूर्तों अग्नौ च सन्निधिं कुरु ।"
          }
        }
      ]
    },
    {
      "id": 12,
      "title": {
        "english": "Panchopachaara Pooja",
        "telugu": "పంచోపచార పూజ",
        "devanagari": "पञ्चोपचार पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, we will offer a simple five-service worship (Panchopachaara Pooja) to Lord Hanuman in the fire and idol. Say the following and offer sandalwood powder/paste, turmeric powder, and kumkum."
            ],
            "telugu": [
              "ఇప్పుడు, మనం అగ్నిలో మరియు విగ్రహంలో హనుమంతునికి ఒక సరళమైన ఐదు-సేవల పూజ (పంచోపచార పూజ) చేస్తాము. ఈ క్రింది మంత్రాన్ని చెప్పి గంధపు పొడి/పేస్ట్, పసుపు, మరియు కుంకుమను సమర్పించండి."
            ],
            "hindi": [
              "अब, हम अग्नि और मूर्ति में भगवान हनुमान को एक सरल पाँच-सेवा पूजा (पंचोपचार पूजा) अर्पित करेंगे।निम्नलिखित कहें और चंदन पाउडर/पेस्ट, हल्दी पाउडर और कुमकुम अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "laṁ pṛthivyātmane namaḥ ।gandhaṁ samarpayāmi ।",
            "telugu": "లం పృథివ్యాత్మనే నమః ।గంధం సమర్పయామి ।",
            "devanagari": "लं पृथिव्यात्मने नमः।गन्धं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer a flower or flower petal to Lord Hanuman in the fire and the idol."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి అగ్నిలో మరియు విగ్రహంలో హనుమంతునికి ఒక పువ్వును లేదా పువ్వు రేకును సమర్పించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और अग्नि तथा मूर्ति में भगवान हनुमान को एक फूल या फूल की पंखुड़ी अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "haṁ ākāśātmane namaḥ ।puṣpaṁ samarpayāmi ।",
            "telugu": "హం ఆకాశాత్మనే నమః ।పుష్పం సమర్పయామి ।",
            "devanagari": "हं आकाशात्मने नमः ।पुष्पं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer dhoopam (incense). Light the tip of the incense stick, extinguish the flame so only smoke remains, and show the smoke to the fire and the idol."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి ధూపం (అగరుబత్తి) సమర్పించండి. అగరుబత్తి కొనను వెలిగించి, మంటను ఆర్పివేయండి, తద్వారా పొగ మాత్రమే మిగిలి ఉంటుంది, మరియు ఆ పొగను అగ్నికి మరియు విగ్రహానికి చూపించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और धूप (अगरबत्ती) अर्पित करें।अगरबत्ती की नोक जलाएं, लौ को बुझा दें ताकि केवल धुआं रह जाए, और धुएं को अग्नि तथा मूर्ति को दिखाएं।"
            ]
          },
          "slokas": {
            "english": "yaṁ vāyvātmane namaḥ ।dhūpaṁ āghrāpayāmi ।",
            "telugu": "యం వాయ్వాత్మనే నమః ।ధూపం ఆఘ్రాపయామి ।",
            "devanagari": "यं वाय्वात्मने नमः।धूपं आघ्रापयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and show the deepam (lamp) to Lord Hanuman in the fire and the idol."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి అగ్నిలో మరియు విగ్రహంలో హనుమంతునికి దీపం చూపించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और अग्नि तथा मूर्ति में भगवान हनुमान को दीपक (दीया) दिखाएं।"
            ]
          },
          "slokas": {
            "english": "raṁ agnyātmane namaḥ ।dīpaṁ darśayāmi ।",
            "telugu": "రం అగ్న్యాత్మనే నమః ।దీపం దర్శయామి ।",
            "devanagari": "रं अग्न्यात्मने नमः।दीपं दर्शयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer a small amount of food (like a fruit or sugar). Show it to the fire and idol, then place a little bit into the fire. The main food offering will be made later."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి కొద్ది మొత్తంలో ఆహారాన్ని (పండు లేదా పంచదార వంటివి) సమర్పించండి. దానిని అగ్నికి మరియు విగ్రహానికి చూపించి, ఆ తర్వాత కొద్దిగా అగ్నిలో వేయండి. ప్రధాన ఆహార నైవేద్యం తరువాత చేయబడుతుంది."
            ],
            "hindi": [
              "निम्नलिखित कहें और थोड़ी मात्रा में भोजन (जैसे फल या चीनी) अर्पित करें।इसे अग्नि और मूर्ति को दिखाएं, फिर थोड़ा सा अग्नि में डालें।मुख्य भोजन प्रसाद बाद में चढ़ाया जाएगा।"
            ]
          },
          "slokas": {
            "english": "vaṁ amṛtātmane namaḥ ।naivedyaṁ samarpayāmi ।",
            "telugu": "వం అమృతాత్మనే నమః ।నైవేద్యం సమర్పయామి ।",
            "devanagari": "वं अमृतात्मने नमः ।नैवेद्यं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and offer some akshatas to Lord Hanuman. This mantra signifies offering 'all services' to Him."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి హనుమంతునికి కొన్ని అక్షతలను సమర్పించండి. ఈ మంత్రం ఆయనకు 'సర్వ సేవలు' సమర్పిస్తున్నట్లు సూచిస్తుంది."
            ],
            "hindi": [
              "निम्नलिखित कहें और भगवान हनुमान को कुछ अक्षत अर्पित करें।यह मंत्र उन्हें 'सभी सेवाएं' अर्पित करने का प्रतीक है।"
            ]
          },
          "slokas": {
            "english": "saṁ sarvātmane namaḥ ।sarvopacārān samarpayāmi ।",
            "telugu": "సం సర్వాత్మనే నమః ।సర్వోపచారాన్ సమర్పయామి ।",
            "devanagari": "सं सर्वात्मने नमः।सर्वोपचारान् समर्पयामि ।"
          }
        }
      ]
    },
    {
      "id": 13,
      "title": {
        "english": "Pradhaana Homam",
        "telugu": "ప్రధాన హోమం",
        "devanagari": "प्रधान होमम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now you can offer any mantras of Lord Hanuman you wish. You may choose a count like 4, 8, 12, 21, 108, etc. At the end of each mantra recitation, add 'svāhā' and make an offering (ghee, sesame seeds, dry coconut pieces, etc.) into the fire. For the very last offering of a particular mantra, add 'vauṣaṭ' instead of 'svāhā'."
            ],
            "telugu": [
              "ఇప్పుడు మీరు మీకు ఇష్టమైన హనుమంతుని మంత్రాలను సమర్పించవచ్చు. మీరు 4, 8, 12, 21, 108 వంటి సంఖ్యను ఎంచుకోవచ్చు. ప్రతి మంత్ర పఠనం చివర, 'స్వాహా' అని చెప్పి అగ్నిలో నైవేద్యం (నెయ్యి, నువ్వులు, ఎండిన కొబ్బరి ముక్కలు మొదలైనవి) సమర్పించండి. ఒక నిర్దిష్ట మంత్రం యొక్క చివరి నైవేద్యం కోసం, 'స్వాహా'కు బదులుగా 'వౌషట్' అని చెప్పండి."
            ],
            "hindi": [
              "अब आप भगवान हनुमान के किसी भी मंत्र का जाप कर सकते हैं।आप 4, 8, 12, 21, 108 आदि जैसी कोई संख्या चुन सकते हैं।प्रत्येक मंत्र के अंत में 'स्वाहा' जोड़ें और अग्नि में आहुति (घी, तिल, सूखे नारियल के टुकड़े आदि) दें।किसी विशेष मंत्र की अंतिम आहुति के लिए, 'स्वाहा' के स्थान पर 'वौषट्' जोड़ें।"
            ]
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following meditation verse of Hanuman and make an offering with 'svāhā'."
            ],
            "telugu": [
              "ఈ క్రింది హనుమంతుని ధ్యాన శ్లోకాన్ని పఠించి, 'స్వాహా'తో నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "हनुमान के निम्नलिखित ध्यान श्लोक का पाठ करें और 'स्वाहा' के साथ आहुति दें।"
            ]
          },
          "slokas": {
            "english": "manojavam māruta tulya vegaṁ jitendriyaṁ buddhimatāṁ variṣṭhaṁ ।vātātmajaṁ vānara yūdha mukhyaṁ śrī rāma dūtaṁ śirasā namāmi ॥ svāhā ।",
            "telugu": "మనోజవం మారుత తుల్య వేగం జితేంద్రియం బుద్ధిమతాం వరిష్ఠం ।వాతాత్మజం వానర యూధ ముఖ్యం శ్రీ రామ దూతం శిరసా నమామి ॥ స్వాహా ।",
            "devanagari": "मनोजवं मारुत तुल्य वेगं जितेंद्रियं बुद्धिमतां वरिष्ठं ।वातात्मजं वानर यूध मुख्यं श्री राम दूतं शिरसा नमामि ॥ स्वाहा ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following verse for intelligence, strength, and fearlessness, and make an offering with 'svāhā'."
            ],
            "telugu": [
              "జ్ఞానం, బలం మరియు నిర్భయత్వం కోసం ఈ క్రింది శ్లోకాన్ని పఠించి, 'స్వాహా'తో నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "बुद्धि, बल और निर्भयता के लिए निम्नलिखित श्लोक का पाठ करें और 'स्वाहा' के साथ आहुति दें।"
            ]
          },
          "slokas": {
            "english": "buddhirbalaṁ yaśo dhairyaṁ nirbhayatvamarogatā ।ajāḍyaṁ vākpaṭutvaṁ ca hanumātsmaraṇādbhavet ॥ svāhā ।",
            "telugu": "బుద్ధిర్బలం యశో ధైర్యం నిర్భయత్వమరోగతా ।అజాడ్యం వాక్పటుత్వం చ హనుమాత్స్మరణాద్భవేత్ ॥ స్వాహా ।",
            "devanagari": "बुद्धिर्बलं यशो धैर्यं निर्भयत्वमरोगता ।अजाड्यं वाक्पटुत्वं च हनुमात्स्मरणाद्भवेत् ॥ स्वाहा।"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following verse, saluting Hanuman as the remover of Janaki's sorrow, and make an offering with 'svāhā'."
            ],
            "telugu": [
              "జానకి దుఃఖాన్ని తొలగించిన హనుమంతునికి నమస్కరిస్తూ ఈ క్రింది శ్లోకాన్ని పఠించి, 'స్వాహా'తో నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "जानकी के दुःख को दूर करने वाले हनुमान को नमन करते हुए निम्नलिखित श्लोक का पाठ करें और 'स्वाहा' के साथ आहुति दें।"
            ]
          },
          "slokas": {
            "english": "aṁjanānaṁdanaṁ vīraṁ jānakī śokanāśanaṁ ।kapīśamakṣahaṁtāraṁ vaṁde laṁkābhayaṁkaraṁ ॥ svāhā ।",
            "telugu": "అంజనానందనం వీరం జానకీ శోకనాశనం ।కపీశమక్షహంతారం వందే లంకాభయంకరం ॥ స్వాహా ।",
            "devanagari": "अंजनानंदनं वीरं जानकी शोकनाशनं ।कपीशमक्षहंतारं वंदे लंकाभयंकरं ॥ स्वाहा ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following verse, saluting Hanuman as the gem in the great garland of the Ramayana, and make an offering with 'svāhā'."
            ],
            "telugu": [
              "రామాయణ మహామాలలోని రత్నమైన హనుమంతునికి నమస్కరిస్తూ ఈ క్రింది శ్లోకాన్ని పఠించి, 'స్వాహా'తో నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "रामायण की महान माला में रत्न रूपी हनुमान को नमन करते हुए निम्नलिखित श्लोक का पाठ करें और 'स्वाहा' के साथ आहुति दें।"
            ]
          },
          "slokas": {
            "english": "goṣpadīkṛta vārāśiṁ maśakīkṛta rākṣasaṁ ।rāmāyaṇa māhāmālāratnaṁ vaṁde'nilātmajam ॥ svāhā ।",
            "telugu": "గోష్పదీకృత వారాశిం మశకీకృత రాక్షసం ।రామాయణ మాహామాలారత్నం వందేऽనిలాత్మజమ్ ॥ స్వాహా ।",
            "devanagari": "गोष्पदीकृत वाराशिं मशकीकृत राक्षसं ।रामायण माहामालारत्नं वंदेऽनिलात्मजम् ॥ स्वाहा ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following verses containing the twelve primary names of Hanuman and make offerings."
            ],
            "telugu": [
              "హనుమంతుని పన్నెండు ప్రధాన నామాలను కలిగి ఉన్న ఈ క్రింది శ్లోకాలను పఠించి, నైవేద్యాలు సమర్పించండి."
            ],
            "hindi": [
              "हनुमान के बारह मुख्य नामों वाले निम्नलिखित श्लोकों का पाठ करें और आहुति दें।"
            ]
          },
          "slokas": {
            "english": "hanumān aṁjanāsūnuḥ vāyuputromahābalaḥ ।rāmeṣṭaḥ phalguṇasakhaḥ piṁgākṣo'mitavikramaḥ ॥ svāhā ।udadhikramaṇaścaiva sītāśoka vināśakaḥ ।lakṣmaṇa prāṇadātā ca daśagrīvasya darpahā ॥ svāhā ।",
            "telugu": "హనుమాన్ అంజనాసూనుః వాయుపుత్రోమహాబలః ।రామేష్టః ఫల్గుణసఖః పింగాక్షోऽమితవిక్రమః ॥ స్వాహా ।ఉదధిక్రమణశ్చైవ సీతాశోక వినాశకః ।లక్ష్మణ ప్రాణదాతా చ దశగ్రీవస్య దర్పహా ॥ స్వాహా ।",
            "devanagari": "हनुमान् अंजनासूनुः वायुपुत्रोमहाबलः ।रामेष्टः फल्गुणसखः पिंगाक्षोऽमितविक्रमः ॥ स्वाहा।उदधिक्रमणश्चैव सीताशोक विनाशकः ।लक्ष्मण प्राणदाता च दशग्रीवस्य दर्पहा ॥ स्वाहा।"
          }
        },
        {
          "instructions": {
            "english": [
              "Alternatively, you can make an individual offering for each of the twelve names of Hanuman."
            ],
            "telugu": [
              "ప్రత్యామ్నాయంగా, మీరు హనుమంతుని పన్నెండు నామాలలో ప్రతిదానికి వ్యక్తిగతంగా నైవేద్యం సమర్పించవచ్చు."
            ],
            "hindi": [
              "वैकल्पिक रूप से, आप हनुमान के बारह नामों में से प्रत्येक के लिए एक व्यक्तिगत आहुति दे सकते हैं।"
            ]
          },
          "slokas": {
            "english": "om̐ hanumate namaḥ svāhā ।om̐ aṁjanāsūnave namaḥ svāhā ।om̐ vāyuputrāya namaḥ svāhā ।om̐ mahābalāya namaḥ svāhā ।om̐ rāmeṣṭāya namaḥ svāhā ।om̐ phalguṇasakhāya namaḥ svāhā ।om̐ piṁgākṣāya namaḥ svāhā ।om̐ amitavikramāya namaḥ svāhā ।om̐ udadhikramaṇāya namaḥ svāhā ।om̐ sītāśokavināśakāya namaḥ svāhā ।om̐ lakṣmaṇaprāṇadātre namaḥ svāhā ।om̐ daśagrīvasya darpahāya namaḥ svāhā ।",
            "telugu": "ఓం హనుమతే నమః స్వాహా ।ఓం అంజనాసూనవే నమః స్వాహా ।ఓం వాయుపుత్రాయ నమః స్వాహా ।ఓం మహాబలాయ నమః స్వాహా ।ఓం రామేష్టాయ నమః స్వాహా ।ఓం ఫల్గుణసఖాయ నమః స్వాహా ।ఓం పింగాక్షాయ నమః స్వాహా ।ఓం అమితవిక్రమాయ నమః స్వాహా ।ఓం ఉదధిక్రమణాయ నమః స్వాహా ।ఓం సీతాశోకవినాశకాయ నమః స్వాహా ।ఓం లక్ష్మణప్రాణదాత్రే నమః స్వాహా ।ఓం దశగ్రీవస్య దర్పహాయ నమః స్వాహా ।",
            "devanagari": "ॐ हनुमते नमः स्वाहा।ॐ अंजनासूनवे नमः स्वाहा।ॐ वायुपुत्राय नमः स्वाहा।ॐ महाबलाय नमः स्वाहा।ॐ रामेष्टाय नमः स्वाहा।ॐ फल्गुणसखाय नमः स्वाहा।ॐ पिंगाक्षाय नमः स्वाहा।ॐ अमितविक्रमाय नमः स्वाहा ।ॐ उदधिक्रमणाय नमः स्वाहा।ॐ सीताशोकविनाशकाय नमः स्वाहा।ॐ लक्ष्मणप्राणदात्रे नमः स्वाहा।ॐ दशग्रीवस्य दर्पहाय नमः स्वाहा ।"
          }
        }
      ]
    },
    {
      "id": 14,
      "title": {
        "english": "Punah Pooja",
        "telugu": "పునః పూజ",
        "devanagari": "पुनः पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "After completing the main offerings, we perform a concluding worship. Say the following and offer Naivedyam (food offering) to Lord Hanuman in the fire and to the idol."
            ],
            "telugu": [
              "ప్రధాన నైవేద్యాలు పూర్తి చేసిన తర్వాత, మనం ముగింపు పూజ చేస్తాము. ఈ క్రింది మంత్రాన్ని చెప్పి అగ్నిలో మరియు విగ్రహానికి హనుమంతునికి నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "मुख्य आहुति पूरी करने के बाद, हम एक समापन पूजा करते हैं।निम्नलिखित कहें और अग्नि तथा मूर्ति में भगवान हनुमान को नैवेद्य (भोजन प्रसाद) अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ haṁ hanumate namaḥ ।naivedyaṁ samarpayāmi ।",
            "telugu": "ఓం హం హనుమతే నమః ।నైవేద్యం సమర్పయామి ।",
            "devanagari": "ॐ हं हनुमते नमः।नैवेद्यं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Light a piece of camphor in a plate, show it to the fire in a circular motion, and then offer the burning camphor into the fire."
            ],
            "telugu": [
              "ఒక పళ్ళెంలో కర్పూరం ముక్కను వెలిగించి, దానిని వృత్తాకారంలో అగ్నికి చూపించి, ఆ తర్వాత మండుతున్న కర్పూరాన్ని అగ్నిలో సమర్పించండి."
            ],
            "hindi": [
              "एक प्लेट में कपूर का एक टुकड़ा जलाएं, उसे गोलाकार गति में अग्नि को दिखाएं, और फिर जलते हुए कपूर को अग्नि में अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ haṁ hanumate namaḥ ।nīrājanaṁ samarpayāmi ।",
            "telugu": "ఓం హం హనుమతే నమః ।నీరాజనం సమర్పయామి ।",
            "devanagari": "ॐ हं हनुमते नमः।नीराजनं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, stand up and perform one or three pradakshinas (clockwise circumambulations) around the homa kundam. After completing the rounds, sit down again in your original position."
            ],
            "telugu": [
              "ఇప్పుడు, లేచి నిలబడి హోమ కుండం చుట్టూ ఒకటి లేదా మూడు ప్రదక్షిణలు (సవ్యదిశలో) చేయండి. ప్రదక్షిణలు పూర్తి చేసిన తర్వాత, మీ అసలు స్థానంలో మళ్లీ కూర్చోండి."
            ],
            "hindi": [
              "अब, खड़े हो जाएं और होम कुंड के चारों ओर एक या तीन प्रदक्षिणा (दक्षिणावर्त परिक्रमा) करें।परिक्रमा पूरी करने के बाद, फिर से अपने मूल स्थान पर बैठ जाएं।"
            ]
          }
        }
      ]
    },
    {
      "id": 15,
      "title": {
        "english": "Uttaraangam",
        "telugu": "ఉత్తరాంగం",
        "devanagari": "उत्तराङ्गम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, offer concluding offerings. Offer a drop of ghee for Prajapati, then for the controllers of the three worlds (Bhuh - Agni, Bhuvah - Vayu, Suvah - Surya), and finally for Agni Svishtakrit, who perfects the offerings. Recite the following mantras, offering a drop of ghee at each 'svāhā'."
            ],
            "telugu": [
              "ఇప్పుడు, ముగింపు నైవేద్యాలు సమర్పించండి. ప్రజాపతికి ఒక చుక్క నెయ్యి, ఆపై మూడు లోకాల నియంత్రకులకు (భూః - అగ్ని, భువః - వాయు, సువః - సూర్య), మరియు చివరగా నైవేద్యాలను పరిపూర్ణం చేసే అగ్ని స్విష్టకృత్‌కు సమర్పించండి. ఈ క్రింది మంత్రాలను పఠిస్తూ, ప్రతి 'స్వాహా' వద్ద ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "अब, समापन आहुतियाँ अर्पित करें।प्रजापति के लिए घी की एक बूंद, फिर तीन लोकों के नियंत्रकों (भूः - अग्नि, भुवः - वायु, सुवः - सूर्य) के लिए, और अंत में अग्नि स्विष्टकृत् के लिए, जो आहुतियों को पूर्ण करते हैं, अर्पित करें।निम्नलिखित मंत्रों का पाठ करें, प्रत्येक 'स्वाहा' पर घी की एक बूंद अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om̐ prajāpate na tvadetānyanyo viśvā jātāni pari tā babhūva ।yatkāmāste juhumastanno astu vayaṁ syāma patayo rayīṇām ।svāhā ।prajāpataya idaṁ na mama ॥ om̐ bhūḥ svāhā ।agnaya idaṁ na mama ॥ om̐ bhuvaḥ svāhā ।vāyava idaṁ na mama ॥ om̐ suvaḥ svāhā ।sūryāyedaṁ na mama ॥ yadasya karmaṇo'tyarīricaṁ yadvānyūnamihākaram ।agniṣṭat sviṣṭakṛdvidvān sarvaṁ sviṣṭaṁ suhuṁta karotu svāhā ।agnaye sviṣṭakṛta idaṁ na mama ॥ om̐ bhūrbhuvassuvaḥ svāhā ।prajāpataya idaṁ na mama ॥",
            "telugu": "ఓం ప్రజాపతే న త్వదేతాన్యన్యో విశ్వా జాతాని పరి తా బభూవ ।యత్కామాస్తే జుహుమస్తన్నో అస్తు వయం స్యామ పతయో రయీణాం ।స్వాహా ।ప్రజాపతయ ఇదం న మమ ॥ ఓం భూః స్వాహా ।అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా ।వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా ।సూర్యాయేదం న మమ ॥ యదస్య కర్మణోऽత్యరీరిచం యద్వాన్యూనమిహాకరం ।అగ్నిష్టత్ స్విష్టకృద్విద్వాన్ సర్వం స్విష్టం సుహుంత కరోతు స్వాహా ।అగ్నయే స్విష్టకృత ఇదం న మమ ॥ ఓం భూర్భువస్సువః స్వాహా ।ప్రజాపతయ ఇదం న మమ ॥",
            "devanagari": "ॐ प्रजापते न त्वदेतान्यन्यो विश्वा जातानि परि ता बभूव ।यत्कामास्ते जुहुमस्तन्नो अस्तु वयं स्याम पतयो रयीणाम्।स्वाहा।प्रजापतय इदं न मम ॥ ॐ भूः स्वाहा।अग्नय इदं न मम ॥ ॐ भुवः स्वाहा ।वायव इदं न मम ॥ ॐ सुवः स्वाहा।सूर्यायेदं न मम ॥ यदस्य कर्मणोऽत्यरीरिचं यद्वान्यूनमिहाकरम् ।अग्निष्टत् स्विष्टकृद्विद्वान् सर्वं स्विष्टं सुहुतं करोतु स्वाहा।अग्नये स्विष्टकृत इदं न मम ॥ ॐ भूर्भुवस्सुवः स्वाहा।प्रजापतय इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Perform Praanaayaamam again as explained earlier. Then, make three offerings to the fire god, asking for forgiveness for any mistakes committed knowingly or unknowingly."
            ],
            "telugu": [
              "ముందు వివరించిన విధంగా మళ్లీ ప్రాణాయామం చేయండి. ఆ తర్వాత, తెలిసి లేదా తెలియక చేసిన ఏవైనా తప్పులకు క్షమాపణ కోరుతూ అగ్ని దేవునికి మూడు నైవేద్యాలు సమర్పించండి."
            ],
            "hindi": [
              "पहले बताए अनुसार फिर से प्राणायाम करें।फिर, अग्नि देव को तीन आहुतियाँ दें, और जाने-अनजाने में हुई किसी भी गलती के लिए क्षमा माँगें।"
            ]
          },
          "slokas": {
            "english": "anājñātaṁ yadājñātaṁ yajñasya kriyate mithu ।agne tadasya kalpaya tvaṁ hi vettha yathātatham ।svāhā ।agnaya idaṁ na mama ॥ puruṣasaṁmito yajño yajñaḥ puruṣasaṁmitaḥ ।agne tadasya kalpaya tvaṁ hi vettha yathātatham ।svāhā ।agnaya idaṁ na mama ॥ yatpākatrā manasā dīnadakṣā na ।yajñasya manvate martāsaḥ ।agniṣṭaddhotā kratuvidvijānan ।yajiṣṭho devān ṛtuśo yajāti ।svāhā ।agnaya idaṁ na mama ॥",
            "telugu": "అనాజ్ఞాతం యదాజ్ఞాతం యజ్ఞస్య క్రియతే మిథు ।అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ ।స్వాహా ।అగ్నయ ఇదం న మమ ॥ పురుషసంమితో యజ్ఞో యజ్ఞః పురుషసంమితః ।అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ ।స్వాహా ।అగ్నయ ఇదం న మమ ॥ యత్పాకత్రా మనసా దీనదక్షా న ।యజ్ఞస్య మన్వతే మర్తాసః ।అగ్నిష్టద్ధోతా క్రతువిద్విజానన్ ।యజిష్ఠో దేవాన్  ऋतुశో యజాతి ।స్వాహా ।అగ్నయ ఇదం న మమ ॥",
            "devanagari": "अनाज्ञातं यदाज्ञातं यज्ञस्य क्रियते मिथु ।अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम्।स्वाहा।अग्नय इदं न मम ॥ पुरुषसंमितो यज्ञो यज्ञः पुरुषसंमितः।अग्ने तदस्य कल्पय त्वं हि वेत्थ यथातथम् ।स्वाहा।अग्नय इदं न मम ॥ यत्पाकत्रा मनसा दीनदक्षा न ।यज्ञस्य मन्वते मर्तासः।अग्निष्टद्धोता क्रतुविद्विजानन्।यजिष्ठो देवान् ऋतुशो यजाति ।स्वाहा।अग्नय इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Make one final offering to Prajapati for forgiveness of all types of errors (mantra, procedure, devotion, materials, etc.) that may have occurred during the homam."
            ],
            "telugu": [
              "హోమంలో జరిగిన అన్ని రకాల దోషాలకు (మంత్ర, తంత్ర, క్రియా, భక్తి, శ్రద్ధా, ద్రవ్య లోపాలు మొదలైనవి) క్షమాపణ కోసం ప్రజాపతికి చివరి నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "होम के दौरान हुई सभी प्रकार की त्रुटियों (मंत्र, प्रक्रिया, भक्ति, सामग्री आदि) के लिए क्षमा के लिए प्रजापति को एक अंतिम आहुति दें।"
            ]
          },
          "slokas": {
            "english": "asmin homakarmaṇi madhye saṁbhāvita samasta maṁtralopa taṁtralopa kriyālopa bhaktilopa śraddhālopa niyamalopa niṣṭhālopa dravyalopādi samasta doṣa prāyaścittārthaṁ sarva prāyaścittāhutiṁ hoṣyāmi ।om̐ bhūrbhuvassuvaḥ svāhā ।prajāpataya idaṁ na mama ॥",
            "telugu": "అస్మిన్ హోమకర్మణి మధ్యే సంభావిత సమస్త మంత్రలోప తంత్రలోప క్రియాలోప భక్తిలోప శ్రద్ధాలోప నియమలోప నిష్ఠాలోప ద్రవ్యలోపాది సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తాహుతిం హోష్యామి ।ఓం భూర్భువస్సువః స్వాహా ।ప్రజాపతయ ఇదం న మమ ॥",
            "devanagari": "अस्मिन् होमकर्मणि मध्ये संभावित समस्त मंत्रलोप तंत्रलोप क्रियालोप भक्तिलोप श्रद्धालोप नियमलोप निष्ठालोप द्रव्यलोपादि समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्ताहुतिं होष्यामि।ॐ भूर्भुवस्सुवः स्वाहा।प्रजापतय इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Make an offering to Vishnu and an offering to Rudra. After the offering to Rudra, wash your right hand by sprinkling a little water on it."
            ],
            "telugu": [
              "విష్ణువుకు మరియు రుద్రునికి నైవేద్యం సమర్పించండి. రుద్రునికి నైవేద్యం సమర్పించిన తర్వాత, మీ కుడి చేతిపై కొద్దిగా నీరు చల్లుకుని శుభ్రం చేసుకోండి."
            ],
            "hindi": [
              "विष्णु को एक आहुति और रुद्र को एक आहुति दें।रुद्र को आहुति देने के बाद, अपने दाहिने हाथ पर थोड़ा पानी छिड़क कर उसे धो लें।"
            ]
          },
          "slokas": {
            "english": "om̐ śrī viṣṇave svāhā ।viṣṇave paramātmana idaṁ na mama ॥ om̐ namo rudrāya paśupataye svāhā ।rudrāya paśupataya idaṁ na mama ॥",
            "telugu": "ఓం శ్రీ విష్ణవే స్వాహా ।విష్ణవే పరమాత్మన ఇదం న మమ ॥ ఓం నమో రుద్రాయ పశుపతయే స్వాహా ।రుద్రాయ పశుపతయ ఇదం న మమ ॥",
            "devanagari": "ॐ श्री विष्णवे स्वाहा।विष्णवे परमात्मन इदं न मम ॥ ॐ नमो रुद्राय पशुपतये स्वाहा।रुद्राय पशुपतय इदं न मम ॥"
          }
        }
      ]
    },
    {
      "id": 16,
      "title": {
        "english": "Uttaraangam - shorter version",
        "telugu": "ఉత్తరాంగం - సంక్షిప్త రూపం",
        "devanagari": "उत्तराङ्गम् - संक्षिप्त संस्करण"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "If you are in a hurry, you can perform a brief uttaraangam. Recite the following lines and make an offering of ghee with each line."
            ],
            "telugu": [
              "మీరు తొందరలో ఉంటే, సంక్షిప్త ఉత్తరాంగం చేయవచ్చు. ఈ క్రింది పంక్తులను పఠిస్తూ, ప్రతి పంక్తికి నెయ్యితో నైవేద్యం సమర్పించండి."
            ],
            "hindi": [
              "यदि आप जल्दी में हैं, तो आप एक संक्षिप्त उत्तरांगम् कर सकते हैं।निम्नलिखित पंक्तियों का पाठ करें और प्रत्येक पंक्ति के साथ घी की आहुति दें।"
            ]
          },
          "slokas": {
            "english": "om̐ bhūḥ svāhā ।agnaya idaṁ na mama ॥ om̐ bhuvaḥ svāhā ।vāyava idaṁ na mama ॥ om̐ suvaḥ svāhā ।sūryāyedaṁ na mama ॥ om̐ bhūrbhuvassuvaḥ svāhā ।prajāpataya idaṁ na mama ॥ om̐ śrī viṣṇave svāhā ।viṣṇave paramātmana idaṁ na mama ॥ om̐ namo rudrāya paśupataye svāhā ।rudrāya paśupataya idaṁ na mama ॥",
            "telugu": "ఓం భూః స్వాహా ।అగ్నయ ఇదం న మమ ॥ ఓం భువః స్వాహా ।వాయవ ఇదం న మమ ॥ ఓం సువః స్వాహా ।సూర్యాయేదం న మమ ॥ ఓం భూర్భువస్సువః స్వాహా ।ప్రజాపతయ ఇదం న మమ ॥ ఓం శ్రీ విష్ణవే స్వాహా ।విష్ణవే పరమాత్మన ఇదం న మమ ॥ ఓం నమో రుద్రాయ పశుపతయే స్వాహా ।రుద్రాయ పశుపతయ ఇదం న మమ ॥",
            "devanagari": "ॐ भूः स्वाहा।अग्नय इदं न मम ॥ ॐ भुवः स्वाहा ।वायव इदं न मम ॥ ॐ सुवः स्वाहा।सूर्यायेदं न मम ॥ ॐ भूर्भुवस्सुवः स्वाहा ।प्रजापतय इदं न मम ॥ ॐ श्री विष्णवे स्वाहा।विष्णवे परमात्मन इदं न मम ॥ ॐ नमो रुद्राय पशुपतये स्वाहा।रुद्राय पशुपतय इदं न मम ॥"
          }
        }
      ]
    },
    {
      "id": 17,
      "title": {
        "english": "Suddhaanna Bali",
        "telugu": "శుద్ధాన్న బలి",
        "devanagari": "शुद्धान्न बलि"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, we offer bali (sacrifice) to associated beings. Take cooked white rice (or fruit slices). Place a small amount as bali in six different places outside the homa kundam, following the order in the diagram (1. East, 2. West, 3. North, 4. South, 5. & 6. East). While offering the balis, recite the following mantra."
            ],
            "telugu": [
              "ఇప్పుడు, మనం అనుబంధ జీవులకు బలి (యాగం) సమర్పిస్తాం. వండిన తెల్ల అన్నం (లేదా పండు ముక్కలు) తీసుకోండి. రేఖాచిత్రంలోని క్రమాన్ని అనుసరించి (1. తూర్పు, 2. పడమర, 3. ఉత్తరం, 4. దక్షిణం, 5. & 6. తూర్పు) హోమ కుండం వెలుపల ఆరు వేర్వేరు ప్రదేశాలలో బలిగా కొద్ది మొత్తంలో ఉంచండి. బలులు సమర్పిస్తున్నప్పుడు, ఈ క్రింది మంత్రాన్ని పఠించండి."
            ],
            "hindi": [
              "अब, हम संबद्ध प्राणियों को बलि (बलिदान) अर्पित करते हैं।पके हुए सफेद चावल (या फल के टुकड़े) लें।चित्र में दिए गए क्रम का पालन करते हुए (1. पूर्व, 2. पश्चिम, 3. उत्तर, 4. दक्षिण, 5. और 6. पूर्व) होम कुंड के बाहर छह अलग-अलग स्थानों पर बलि के रूप में थोड़ी मात्रा में रखें।बलि अर्पित करते समय, निम्नलिखित मंत्र का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "om̐ pārṣadebhyo namaḥ ।baliṁ samarpayāmi ।",
            "telugu": "ఓం పార్షదేభ్యో నమః ।బలిం సమర్పయామి ।",
            "devanagari": "ॐ पार्षदेभ्यो नमः।बलिं समर्पयामि ।"
          },
          "diagram": "/diagrams/parsha-bali.svg"
        }
      ]
    },
    {
      "id": 18,
      "title": {
        "english": "Vasordhaaraa",
        "telugu": "వసోర్ధారా",
        "devanagari": "वसोर्धारा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take a ladleful of ghee and pour it slowly in a continuous stream into the fire while reciting the third verse from 'Rudra Chamakam' given below. This is to ensure the fire is strong enough for the Poornaahuti (final offering)."
            ],
            "telugu": [
              "ఒక గరిటెడు నెయ్యి తీసుకుని, క్రింద ఇవ్వబడిన 'రుద్ర చమకం' నుండి మూడవ శ్లోకాన్ని పఠిస్తూ, నిరంతరాయంగా అగ్నిలో పోయండి. ఇది పూర్ణాహుతి (చివరి నైవేద్యం) కోసం అగ్ని బలంగా ఉండేలా చేస్తుంది."
            ],
            "hindi": [
              "एक करछुल घी लें और नीचे दिए गए 'रुद्र चमकम्' के तीसरे श्लोक का पाठ करते हुए इसे धीरे-धीरे एक सतत धारा में अग्नि में डालें।यह सुनिश्चित करने के लिए है कि अग्नि पूर्णाहुति (अंतिम आहुति) के लिए पर्याप्त मजबूत है।"
            ]
          },
          "slokas": {
            "english": "om̐ śaṁ ca me mayaśca me priyaṁ ca me'nukāmaśca me kāmaśca me saumanasaśca me bhadraṁ ca me śreyaśca me vasyaśca me yaśaśca me bhagaśca me draviṇaṁ ca me yantā ca me dhartā ca me kṣemaśca me dhṛtiśca me viśvaṁ ca me mahaśca me saṁvicca me jñātraṁ ca me sūśca me prasūśca me sīraṁ ca me layaśca mṛtaṁ ca me'mṛtaṁ ca me'yakṣmaṁ ca me'nāmayacca me jīvātuśca me dīrghāyutvaṁ ca me'namitraṁ ca me'bhayaṁ ca me sugaṁ ca me śayanaṁ ca me sūṣā ca me sudinaṁ ca me ॥",
            "telugu": "ఓం శం చ మే మయశ్చ మే ప్రియం చ మేऽనుకామశ్చ మే కామశ్చ మే సౌమనసశ్చ మే భద్రం చ మే శ్రేయశ్చ మే వస్యశ్చ మే యశశ్చ మే భగశ్చ మే ద్రవిణం చ మే యంతా చ మే ధర్తా చ మే క్షేమశ్చ మే ధృతిశ్చ మే విశ్వం చ మే మహశ్చ మే సంవిచ్చ మే జ్ఞాత్రం చ మే సూశ్చ మే ప్రసూశ్చ మే సీరం చ మే లయశ్చ మృతం చ మేऽమృతం చ మేऽయక్ష్మం చ మేऽనామయచ్చ మే జీవాతుశ్చ మే దీర్ఘాయుత్వం చ మేऽనమిత్రం చ మేऽభయం చ మే సుగం చ మే శయనం చ మే సూషా చ మే సుదినం చ మే ॥",
            "devanagari": "ॐ शं च मे मयश्च मे प्रियं च मेऽनुकामश्च मे कामश्च मे सौमनसश्च मे भद्रं च मे श्रेयश्च मे वस्यश्च मे यशश्च मे भगश्च मे द्रविणं च मे यन्ता च मे धर्ता च मे क्षेमश्च मे धृतिश्च मे विश्वं च मे महश्च मे संविच्च मे ज्ञात्रं च मे सूश्च मे प्रसूश्च मे सीरं च मे लयश्च मऋतं च मेऽमृतं च मेऽयक्ष्मं च मेऽनामयच्च मे जीवातुश्च मे दीर्घायुत्वं च मेऽनमित्रं च मेऽभयं च मे सुगं च मे शयनं च मे सूषा च मे सुदिनं च मे ॥"
          }
        }
      ]
    },
    {
      "id": 19,
      "title": {
        "english": "Poornaahuti",
        "telugu": "పూర్ణాహుతి",
        "devanagari": "पूर्णाहुति"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Prepare the 'complete offering' (Poornaahuti). This is typically a dry coconut half filled with akshatas, a coin, sandalwood powder, turmeric, kumkum, and samples of other offered materials. Place this offering on the wooden ladle, recite the following mantras, and then carefully place it in the fire with your hand."
            ],
            "telugu": [
              "'పూర్ణాహుతి' (సంపూర్ణ నైవేద్యం) సిద్ధం చేయండి. ఇది సాధారణంగా అక్షతలు, ఒక నాణెం, గంధపు పొడి, పసుపు, కుంకుమ, మరియు ఇతర సమర్పించిన పదార్థాల నమూనాలతో నింపిన ఎండిన కొబ్బరి చిప్ప. ఈ నైవేద్యాన్ని చెక్క గరిటెపై ఉంచి, ఈ క్రింది మంత్రాలను పఠించి, ఆ తర్వాత జాగ్రత్తగా మీ చేతితో అగ్నిలో ఉంచండి."
            ],
            "hindi": [
              "'पूर्ण आहुति' (पूर्ण अर्पण) तैयार करें।यह आम तौर पर अक्षत, एक सिक्का, चंदन पाउडर, हल्दी, कुमकुम, और अन्य अर्पित सामग्रियों के नमूनों से भरा एक सूखा नारियल का आधा हिस्सा होता है।इस अर्पण को लकड़ी की करछुल पर रखें, निम्नलिखित मंत्रों का पाठ करें, और फिर इसे सावधानी से अपने हाथ से अग्नि में रखें।"
            ]
          },
          "slokas": {
            "english": "om̐ pūrṇāhutimuttamāṁ juhoti ।sarvaṁ vai pūrṇāhutiḥ ।sarvamevāpnoti ।atho iyaṁ vai pūrṇāhutiḥ ।asyāmeva pratitiṣṭhati ॥ om̐ pūrṇamadaḥ pūrṇamidaṁ pūrṇātpūrṇamudacyate ।pūrṇasya pūrṇamādāya pūrṇamevāvaśiṣyate ॥ om̐ haṁ hanumate namaḥ ।pūrṇāhutiṁ samarpayāmi ।",
            "telugu": "ఓం పూర్ణాహుతిముత్తమాం జుహోతి ।సర్వం వై పూర్ణాహుతిః ।సర్వమేవాప్నోతి ।అథో ఇయం వై పూర్ణాహుతిః ।అస్యామేవ ప్రతితిష్ఠతి ॥ ఓం పూర్ణమదః పూర్ణమిదం పూర్ణాత్పూర్ణముదచ్యతే ।పూర్ణస్య పూర్ణమాదాయ పూర్ణమేవావశిష్యతే ॥ ఓం హం హనుమతే నమః ।పూర్ణాహుతిం సమర్పయామి ।",
            "devanagari": "ॐ पूर्णाहुतिमुत्तमां जुहोति ।सर्वं वै पूर्णाहुतिः।सर्वमेवाप्नोति ।अथो इयं वै पूर्णाहुतिः ।अस्यामेव प्रतितिष्ठति ।ॐ पूर्णमदः पूर्णमिदं पूर्णात्पूर्णमुदच्यते ।पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते ॥ ॐ हं हनुमते नमः।पूर्णाहुतिं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "While placing the poornaahuti in the fire, recite the following mantra. Internally feel a sense of complete surrender, as the poornaahuti symbolizes the offering of your own ego ('I-ness') to Lord Hanuman."
            ],
            "telugu": [
              "పూర్ణాహుతిని అగ్నిలో ఉంచుతున్నప్పుడు, ఈ క్రింది మంత్రాన్ని పఠించండి. పూర్ణాహుతి మీ అహంకారాన్ని ('నేను-తనం') హనుమంతునికి సమర్పించడాన్ని సూచిస్తుంది కాబట్టి, అంతర్గతంగా సంపూర్ణ శరణాగతి భావాన్ని అనుభవించండి."
            ],
            "hindi": [
              "पूर्णाहुति को अग्नि में रखते समय, निम्नलिखित मंत्र का पाठ करें।आंतरिक रूप से पूर्ण समर्पण की भावना महसूस करें, क्योंकि पूर्णाहुति भगवान हनुमान को अपने अहंकार ('मैं-पन') के समर्पण का प्रतीक है।"
            ]
          },
          "slokas": {
            "english": "om̐ brahmārpaṇaṁ brahmahavir brahmāgnau brahmaṇā hutaṁ ।brahmaiva tena gantavyaṁ brahma karma samādhinā ॥",
            "telugu": "ఓం బ్రహ్మార్పణం బ్రహ్మహవిర్ బ్రహ్మాగ్నౌ బ్రహ్మణా హుతం ।బ్రహ్మైవ తేన గంతవ్యం బ్రహ్మ కర్మ సమాధినా ॥",
            "devanagari": "ॐ ब्रह्मार्पणं ब्रह्महविर् ब्रह्माग्नौ ब्रह्मणा हुतं ।ब्रह्मैव तेन गन्तव्यं ब्रह्म कर्म समाधिना ॥"
          }
        }
      ]
    },
    {
      "id": 20,
      "title": {
        "english": "Winding Up and Meditation",
        "telugu": "ముగింపు మరియు ధ్యానం",
        "devanagari": "समापन और ध्यान"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "The final offering is to Agni (the fire god), who carried all our offerings. Recite the following and offer a final drop of ghee into the fire."
            ],
            "telugu": [
              "చివరి నైవేద్యం అగ్ని దేవునికి, మన నైవేద్యాలన్నింటినీ చేరవేసినవాడు. ఈ క్రింది మంత్రాన్ని పఠించి, అగ్నిలో చివరి చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "अंतिम आहुति अग्नि (अग्नि देव) को है, जिन्होंने हमारी सभी आहुतियों को पहुँचाया।निम्नलिखित का पाठ करें और अग्नि में घी की एक अंतिम बूंद अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "sapta te agne samidhaḥ saptajihvāḥ sapta ṛṣayassaptaḥ dhāma priyāṇi ।sapta hotrā sapta dhātvā yajantisaptayonīrāpṛṇasvā ghṛtena svāhā ।agnaye saptavata idaṁ na mama ॥",
            "telugu": "సప్త తే అగ్నే సమిధః సప్తజిహ్వాః సప్త ఋషయస్సప్తః ధామ ప్రియాణి ।సప్త హోత్రా సప్త ధాత్వా యజంతిసప్తయోనీరాపృణస్వా ఘృతేన స్వాహా ।అగ్నయే సప్తవత ఇదం న మమ ॥",
            "devanagari": "सप्त ते अग्ने समिधः सप्तजिह्वाः सप्त ऋषयस्सप्तः धाम प्रियाणि।सप्त होत्रा सप्त धात्वा यजन्तिसप्तयोनीरापृणस्वा घृतेन स्वाहा।अग्नये सप्तवत इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Take some water and sprinkle it around the homa kundam as you did at the beginning, but using the following four mantras."
            ],
            "telugu": [
              "కొంత నీరు తీసుకుని, మీరు ప్రారంభంలో చేసినట్లుగా హోమ కుండం చుట్టూ చల్లుకోండి, కానీ ఈ క్రింది నాలుగు మంత్రాలను ఉపయోగించండి."
            ],
            "hindi": [
              "थोड़ा पानी लें और होम कुंड के चारों ओर छिड़कें जैसा कि आपने शुरुआत में किया था, लेकिन निम्नलिखित चार मंत्रों का उपयोग करते हुए।"
            ]
          },
          "slokas": {
            "english": "adite'nvamaṁsthāḥ ।anumate'nvamaṁsthāḥ ।sarasvate'nvamaṁsthāḥ ।deva savitaḥ prāsāvīḥ ।",
            "telugu": "అదితేऽన్వమంస్థాః ।అనుమతేऽన్వమంస్థాః ।సరస్వతేऽన్వమంస్థాః ।దేవ సవితః ప్రాసావీః ।",
            "devanagari": "अदितेऽन्वमंस्थाः।अनुमतेऽन्वमंस्थाः।सरस्वतेऽन्वमंस्थाः ।देव सवितः प्रासावीः ।"
          },
          "diagram": "/diagrams/agni-pratisthapana-4-dirs.svg"
        },
        {
          "instructions": {
            "english": [
              "As the poornaahuti burns, the energy is very positive and conducive to meditation. Sit still with a straight back and closed eyes in front of the fire. Meditate on your favorite deity's form with your favorite mantra for at least 5-10 minutes. Consider this an essential part of the homam."
            ],
            "telugu": [
              "పూర్ణాహుతి మండుతున్నప్పుడు, శక్తి చాలా సానుకూలంగా మరియు ధ్యానానికి అనుకూలంగా ఉంటుంది. అగ్ని ముందు నిటారుగా, కళ్ళు మూసుకుని నిశ్చలంగా కూర్చోండి. కనీసం 5-10 నిమిషాల పాటు మీకు ఇష్టమైన మంత్రంతో మీకు ఇష్టమైన దేవత రూపాన్ని ధ్యానించండి. దీనిని హోమంలో ఒక ముఖ్యమైన భాగంగా పరిగణించండి."
            ],
            "hindi": [
              "जैसे ही पूर्णाहुति जलती है, ऊर्जा बहुत सकारात्मक और ध्यान के लिए अनुकूल होती है।अग्नि के सामने सीधी पीठ और बंद आँखों के साथ स्थिर बैठें।कम से कम 5-10 मिनट के लिए अपने पसंदीदा मंत्र के साथ अपने पसंदीदा देवता के रूप का ध्यान करें।इसे होम का एक अनिवार्य हिस्सा मानें।"
            ]
          }
        }
      ]
    },
    {
      "id": 21,
      "title": {
        "english": "Rakshaa",
        "telugu": "రక్ష",
        "devanagari": "रक्षा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take the darbhas that were placed along the western boundary of the homa kundam. Apply a little ghee to their tips, light them in the fire, and then place them in a separate container to burn completely. The resulting black ash is 'rakshaa' (protection). You can apply a small amount to the idol's forehead and then to your own."
            ],
            "telugu": [
              "హోమ కుండం యొక్క పశ్చిమ సరిహద్దులో ఉంచిన దర్భలను తీసుకోండి. వాటి కొనలకు కొద్దిగా నెయ్యి రాసి, అగ్నిలో వెలిగించి, ఆపై వాటిని పూర్తిగా కాల్చడానికి ఒక ప్రత్యేక పాత్రలో ఉంచండి. ఫలితంగా వచ్చే నల్ల బూడిద 'రక్ష' (రక్షణ). మీరు కొద్ది మొత్తాన్ని విగ్రహం యొక్క నుదుటిపై మరియు ఆపై మీ నుదుటిపై అన్వయించవచ్చు."
            ],
            "hindi": [
              "होम कुंड की पश्चिमी सीमा पर रखे गए दर्भों को लें।उनके सिरों पर थोड़ा घी लगाएं, उन्हें आग में जलाएं, और फिर उन्हें पूरी तरह से जलने के लिए एक अलग बर्तन में रखें।परिणामी काली राख 'रक्षा' (सुरक्षा) है।आप थोड़ी मात्रा मूर्ति के माथे पर और फिर अपने माथे पर लगा सकते हैं।"
            ]
          }
        }
      ]
    },
    {
      "id": 22,
      "title": {
        "english": "Udvaasana",
        "telugu": "ఉద్వాసన",
        "devanagari": "उद्वासन"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take some darbhas and flowers/akshatas. Touch the sides of the homakundam and then touch the idol, leaving the flowers/akshatas there. Imagine the energy from the fire is being transferred into the idol."
            ],
            "telugu": [
              "కొన్ని దర్భలు మరియు పువ్వులు/అక్షతలు తీసుకోండి. హోమకుండం యొక్క వైపులా తాకి, ఆపై విగ్రహాన్ని తాకి, పువ్వులు/అక్షతలను అక్కడ వదిలివేయండి. అగ్ని నుండి శక్తి విగ్రహంలోకి బదిలీ చేయబడుతోందని భావించండి."
            ],
            "hindi": [
              "कुछ दर्भ और फूल/अक्षत लें।होमकुंड के किनारों को स्पर्श करें और फिर मूर्ति को स्पर्श करें, फूल/अक्षत वहीं छोड़ दें।कल्पना करें कि अग्नि से ऊर्जा मूर्ति में स्थानांतरित हो रही है।"
            ]
          },
          "slokas": null
        },
        {
          "instructions": {
            "english": [
              "Say the following, show your heart with your hands, and imagine that Sri Mahaganapathi has exited the fire and returned to your heart."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి, మీ చేతులతో మీ హృదయాన్ని చూపించి, శ్రీ మహాగణపతి అగ్ని నుండి నిష్క్రమించి మీ హృదయంలోకి తిరిగి వచ్చారని భావించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें, अपने हाथों से अपने हृदय को दिखाएं, और कल्पना करें कि श्री महागणपति अग्नि से निकलकर आपके हृदय में लौट आए हैं।"
            ]
          },
          "slokas": {
            "english": "asmādagneḥ śrīmahāgaṇapatiṁ yathāsthānaṁ pratiṣṭhāpayāmi ।",
            "telugu": "అస్మాదగ్నేః శ్రీమహాగణపతిం యథాస్థానం ప్రతిష్ఠాపయామి ।",
            "devanagari": "अस्मादग्नेः श्रीमहागणपतिं यथास्थानं प्रतिष्ठापयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say the following and imagine that Lord Hanuman has exited the fire and the idol and returned to your heart."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని చెప్పి, హనుమంతుడు అగ్ని మరియు విగ్రహం నుండి నిష్క్రమించి మీ హృదయంలోకి తిరిగి వచ్చారని భావించండి."
            ],
            "hindi": [
              "निम्नलिखित कहें और कल्पना करें कि भगवान हनुमान अग्नि और मूर्ति से निकलकर आपके हृदय में लौट आए हैं।"
            ]
          },
          "slokas": {
            "english": "asmānmūrteśca agneśca hanumaṁtaṁ yathāsthānaṁ pratiṣṭhāpayāmi ।",
            "telugu": "అస్మాన్మూర్తేశ్చ అగ్నేశ్చ హనుమంతం యథాస్థానం ప్రతిష్ఠాపయామి ।",
            "devanagari": "अस्मान्मूर्तेश्च अग्नेश्च हनुमंतं यथास्थानं प्रतिष्ठापयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say goodbye to the fire god with the following mantra and bow to the fire."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రంతో అగ్ని దేవునికి వీడ్కోలు చెప్పి, అగ్నికి నమస్కరించండి."
            ],
            "hindi": [
              "निम्नलिखित मंत्र के साथ अग्नि देव को विदाई दें और अग्नि को प्रणाम करें।"
            ]
          },
          "slokas": {
            "english": "agne naya supathā rāye asmān viśvāni deva vayunāni vidvān ।yuyodhyasmajjuhurāṇameno bhūyiṣṭhāṁ te nama uktiṁ vidhema ।agnaye namaḥ ॥",
            "telugu": "అగ్నే నయ సుపథా రాయే అస్మాన్ విశ్వాని దేవ వయునాని విద్వాన్ ।యుయోధ్యస్మజ్జుహురాణమేనో భూయిష్ఠాం తే నమ ఉక్తిం విధేమ ।అగ్నయే నమః ॥",
            "devanagari": "अग्ने नय सुपथा राये अस्मान् विश्वानि देव वयुनानि विद्वान् ।युयोध्यस्मज्जुहुराणमेनो भूयिष्ठां ते नम उक्तिं विधेम ।अग्नये नमः ॥"
          }
        }
      ]
    },
    {
      "id": 23,
      "title": {
        "english": "Conclusion",
        "telugu": "ముగింపు",
        "devanagari": "निष्कर्ष"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Recite the following verses, surrendering any errors in the ritual and the fruits of the action to the divine. Imagine that Krishna is the true doer, acting through you. As you recite, pour a little water with akshatas from your right hand into a separate bowl."
            ],
            "telugu": [
              "ఈ క్రింది శ్లోకాలను పఠిస్తూ, ఆచారంలో ఏవైనా దోషాలు మరియు కర్మ ఫలాలను దైవానికి సమర్పించండి. కృష్ణుడు మీ ద్వారా పనిచేస్తున్న నిజమైన కర్త అని భావించండి. పఠిస్తున్నప్పుడు, మీ కుడి చేతి నుండి అక్షతలతో కూడిన కొద్దిగా నీటిని ఒక ప్రత్యేక గిన్నెలో పోయండి."
            ],
            "hindi": [
              "निम्नलिखित श्लोकों का पाठ करें, अनुष्ठान में किसी भी त्रुटि और कर्म के फल को परमात्मा को समर्पित करें।कल्पना करें कि कृष्ण ही सच्चे कर्ता हैं, जो आपके माध्यम से कार्य कर रहे हैं।पाठ करते समय, अपने दाहिने हाथ से अक्षत के साथ थोड़ा पानी एक अलग कटोरे में डालें।"
            ]
          },
          "slokas": {
            "english": "maṁtrahīnaṁ kriyāhīnaṁ bhaktihīnaṁ hutāśana ।yadbhutaṁ tu mayā deva paripūrṇa tadastu te ॥ prāyaścittānyaśeṣāṇi tapaḥ karmātmakāni vai ।yāni teṣāmaśeṣāṇāṁ śrī kṛṣṇasmaraṇaṁ paraṁ ॥ śrī kṛṣṇa kṛṣṇa kṛṣṇa ।kāyena vācā manasendriyairvā buddhyātmanā vā prakṛteḥ svabhāvāt ।karomi yadyat sakalaṁ parasmai nārāyaṇāyeti samarpayāmi ॥",
            "telugu": "మంత్రహీనం క్రియాహీనం భక్తిహీనం హుతాశన ।యద్భుతం తు మయా దేవ పరిపూర్ణ తదస్తు తే ॥ ప్రాయశ్చిత్తాన్యశేషాణి తపః కర్మాత్మకాని వై ।యాని తేషామశేషాణాం శ్రీ కృష్ణస్మరణం పరం ॥ శ్రీ కృష్ణ కృష్ణ కృష్ణ ।కాయేన వాచా మనసేంద్రియైర్వా బుద్ధ్యాత్మనా వా ప్రకృతేః స్వభావాత్ ।కరోమి యద్యత్ సకలం పరస్మై నారాయణాయేతి సమర్పయామి ॥",
            "devanagari": "मंत्रहीनं क्रियाहीनं भक्तिहीनं हुताशन।यद्भुतं तु मया देव परिपूर्ण तदस्तु ते ॥ प्रायश्चित्तान्यशेषाणि तपः कर्मात्मकानि वै।यानि तेषामशेषाणां श्री कृष्णस्मरणं परं ॥ श्री कृष्ण कृष्ण कृष्ण।कायेन वाचा मनसेन्द्रियैर्वा बुद्ध्यात्मना वा प्रकृतेः स्वभावात् ।करोमि यद्यत् सकलं परस्मै नारायणायेति समर्पयामि ॥"
          }
        },
        {
            "instructions": {
              "english": [
                "Conclude by reciting the final prayer, surrendering the doership of the homam to Krishna and praying for peace."
              ],
              "telugu": [
                "హోమం యొక్క కర్తృత్వాన్ని కృష్ణునికి సమర్పించి, శాంతి కోసం ప్రార్థిస్తూ చివరి ప్రార్థనను పఠించడం ద్వారా ముగించండి."
              ],
              "hindi": [
                "अंतिम प्रार्थना का पाठ करके समाप्त करें, होम का कर्तृत्व कृष्ण को समर्पित करें और शांति के लिए प्रार्थना करें।"
              ]
            },
            "slokas": {
              "english": "anena divya mangaļa homena bhagavān sarvātmakaḥ śrīmahāganapatiḥ prīyatām om tatsat ।sarvam śrī kṛṣṇārpaņamastu ।om śāntiḥ śāntiḥ śāntih ।",
              "telugu": "అనేన దివ్య మంగళ హోమేన భగవాన్ సర్వాత్మకః శ్రీమహాగణపతిః ప్రీయతాం ఓం తత్సత్ ।సర్వం శ్రీ కృష్ణార్పణమస్తు ।ఓం శాంతిః శాంతిః శాంతిః ।",
              "devanagari": "अनेन दिव्य मङ्गल होमेन भगवान् सर्वात्मकः श्रीमहागणपतिः प्रीयताम् ॐ तत्सत् ।सर्वं श्री कृष्णार्पणमस्तु ।ॐ शान्तिः शान्तिः शान्तिः ।"
            }
          }
        ]
      }
    ]
  }