{
  "title": {
    "english": "Kaala Bhairava Homam",
    "telugu": "కాల భైరవ హోమం",
    "hindi": "काल भैरव होम"
  },
  "author": {
    "english": "P V R Narasimha Rao",
    "telugu": "పి వి ఆర్ నరసింహారావు",
    "hindi": "पी वी आर नरसिम्हा राव"
  },
  "source": "https://vedicastrologer.org/homa/regular/kala_bhairava_r_sans-.pdf",
  "sections": [
    {
      "id": 0,
      "title": {
        "english": "Introduction",
        "telugu": "పరిచయం",
        "hindi": "परिचय"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Welcome to the Kaala Bhairava Homam manual. This guide provides a short procedure (Laghu Paddhati) for performing the fire ritual.",
              "A homam (also known as homa, havan, or yajna) is a sacred Vedic practice where offerings are made into a consecrated fire. The fire acts as a medium to carry our prayers and offerings to the divine.",
              "Kaala Bhairava is a form of Shiva who has mastered Time. His worship is very auspicious, helping to dissolve delusion, increase detachment, and accelerate spiritual progress and liberation.",
              "This manual provides a step-by-step guide to the entire process, from initial preparations to the final conclusion, making the practice accessible to all sincere spiritual aspirants."
            ],
            "telugu": [
              "కాల భైరవ హోమం మార్గదర్శినికి స్వాగతం. ఈ గైడ్ అగ్ని క్రతువును నిర్వహించడానికి ఒక చిన్న విధానాన్ని (లఘు పద్ధతి) అందిస్తుంది.",
              "హోమం (హోమ, హవన, లేదా యజ్ఞం అని కూడా పిలుస్తారు) అనేది ఒక పవిత్రమైన వైదిక ఆచారం, ఇందులో పవిత్రమైన అగ్నిలో ఆహుతులు సమర్పిస్తారు. అగ్ని మన ప్రార్థనలు మరియు నైవేద్యాలను దైవానికి చేరవేసే మాధ్యమంగా పనిచేస్తుంది.",
              "కాల భైరవుడు కాలాన్ని జయించిన శివుని రూపం. ఆయన ఆరాధన చాలా శుభప్రదమైనది, భ్రమను తొలగించడానికి, వైరాగ్యాన్ని పెంచడానికి, మరియు ఆధ్యాత్మిక పురోగతి మరియు మోక్షాన్ని వేగవంతం చేయడానికి సహాయపడుతుంది.",
              "ఈ మార్గదర్శిని ప్రారంభ సన్నాహాల నుండి చివరి ముగింపు వరకు మొత్తం ప్రక్రియకు దశలవారీ మార్గదర్శినిని అందిస్తుంది, ఈ అభ్యాసాన్ని నిజాయితీ గల ఆధ్యాత్మిక సాధకులందరికీ అందుబాటులోకి తెస్తుంది."
            ],
            "hindi": [
              "काल भैरव होम नियमावली में आपका स्वागत है। यह मार्गदर्शिका अग्नि अनुष्ठान करने के लिए एक संक्षिप्त प्रक्रिया (लघु पद्धति) प्रदान करती है।",
              "होम (जिसे होम, हवन, या यज्ञ भी कहा जाता है) एक पवित्र वैदिक प्रथा है जिसमें एक प्रतिष्ठित अग्नि में आहुतियाँ दी जाती हैं। अग्नि हमारी प्रार्थनाओं और प्रसादों को परमात्मा तक पहुँचाने के लिए एक माध्यम के रूप में कार्य करती है।",
              "काल भैरव शिव का एक रूप है जिन्होंने समय पर महारत हासिल की है। उनकी पूजा बहुत शुभ है, जो भ्रम को दूर करने, वैराग्य बढ़ाने और आध्यात्मिक प्रगति और मुक्ति में तेजी लाने में मदद करती है।",
              "यह नियमावली प्रारंभिक तैयारियों से लेकर अंतिम निष्कर्ष तक पूरी प्रक्रिया के लिए एक चरण-दर-चरण मार्गदर्शिका प्रदान करती है, जिससे यह अभ्यास सभी ईमानदार आध्यात्मिक साधकों के लिए सुलभ हो जाता है।"
            ]
          },
          "slokas": {
            "english": "om śrī mahāgaṇapathaye namaḥ | om śrī gurubhyo namaḥ | om ṛṣibhyo namaḥ ||",
            "telugu": "ఓం శ్రీ మహాగణపతయే నమః | ఓం శ్రీ గురుభ్యో నమః | ఓం ఋషిభ్యో నమః ||",
            "devanagari": "ॐ श्री महागणपतये नमः । ॐ श्री गुरुभ्यो नमः । ॐ ऋषिभ्यो नमः ॥"
          }
        }
      ]
    },
    {
      "id": 1,
      "title": {
        "english": "Anujnaa",
        "telugu": "అనుజ్ఞ",
        "devanagari": "अनुज्ञा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Before starting, mentally seek permission from Mother Earth, Lord Ganesha, your favorite deity (ishta devata), your parents, the rishis of your lineage (gothra), all rishis, and all your gurus. Say the following mantra, requesting the cooperation of all deities.",
              "If you have a 'pavitram' (a ring made of darbha grass or metal), wear it now on your right-hand ring finger. If not, you can use any ring after praying to your ishta devata, or simply proceed without one."
            ],
            "telugu": [
              "ప్రారంభించే ముందు, భూమాత, గణేశుడు, మీ ఇష్ట దేవత, మీ తల్లిదండ్రులు, మీ గోత్ర ఋషులు, సర్వ ఋషులు, మరియు మీ గురువుల నుండి మానసికంగా అనుమతి తీసుకోండి. అన్ని దేవతల సహకారాన్ని కోరుతూ ఈ క్రింది మంత్రాన్ని చెప్పండి.",
              "మీ దగ్గర 'పవిత్రం' (దర్భ గడ్డితో లేదా లోహంతో చేసిన ఉంగరం) ఉంటే, దాన్ని ఇప్పుడు మీ కుడి చేతి ఉంగరపు వేలికి ధరించండి. లేకపోతే, మీ ఇష్ట దేవతకు ప్రార్థన చేసిన తర్వాత ఏదైనా ఉంగరాన్ని ఉపయోగించవచ్చు, లేదా ఉంగరం లేకుండానే కొనసాగవచ్చు."
            ],
            "hindi": [
              "शुरू करने से पहले, मानसिक रूप से पृथ्वी माता, भगवान गणेश, अपने इष्ट देवता, अपने माता-पिता, अपने वंश (गोत्र) के ऋषियों, सभी ऋषियों और अपने सभी गुरुओं से अनुमति लें। सभी देवताओं के सहयोग का अनुरोध करते हुए निम्नलिखित मंत्र का जाप करें।",
              "यदि आपके पास 'पवित्रम्' (कुश घास या धातु से बनी अंगूठी) है, तो इसे अब अपनी दाहिनी हाथ की अनामिका उंगली में पहनें। यदि नहीं, तो आप अपने इष्ट देवता से प्रार्थना करने के बाद किसी भी अंगूठी का उपयोग कर सकते हैं, या बस इसके बिना आगे बढ़ सकते हैं।"
            ]
          },
          "slokas": {
            "english": "om ṛddhyāsma havyairnamasopasadya | mitraṃ devaṃ mitradheyaṃ no astu | anūrādhān haviṣā vardhayantaḥ | śataṃ jīvema śaradaḥ savīrāḥ ||",
            "telugu": "ఓం ఋద్ధ్యాస్మ హవ్యైర్నమసోపసద్య | మిత్రం దేవం మిత్రధేయం నో అస్తు | అనూరాధాన్ హవిషా వర్ధయంతః | శతం జీవేమ శరదః సవీరాః ||",
            "devanagari": "ॐ ऋद्धयास्म हव्यैर्नमसोपसद्य । मित्रं देवं मित्रधेयं नो अस्तु। अनूराधान् हविषा वर्धयन्तः। शतं जीवेम शरदः सवीराः ॥"
          }
        }
      ]
    },
    {
      "id": 2,
      "title": {
        "english": "Aachamanam",
        "telugu": "ఆచమనం",
        "devanagari": "आचमनम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take a little water from the tumbler into your right palm with a spoon. Sip the water after reciting each of the three mantras below. Imagine that Lord Vishnu within you is receiving this water."
            ],
            "telugu": [
              "గ్లాసు నుండి కొద్దిగా నీటిని చెంచాతో మీ కుడి అరచేతిలోకి తీసుకోండి. క్రింద ఇవ్వబడిన మూడు మంత్రాలలో ప్రతి ఒక్కదానిని పఠించిన తర్వాత నీటిని సిప్ చేయండి. మీలో ఉన్న విష్ణువు ఈ నీటిని స్వీకరిస్తున్నట్లుగా భావించండి."
            ],
            "hindi": [
              "एक चम्मच से गिलास से थोड़ा पानी अपनी दाहिनी हथेली में लें। नीचे दिए गए तीन मंत्रों में से प्रत्येक का पाठ करने के बाद पानी का आचमन करें। कल्पना करें कि आपके भीतर भगवान विष्णु इस जल को प्राप्त कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om keśavāya svāhā |\nom nārāyaṇāya svāhā |\nom mādhavāya svāhā |",
            "telugu": "ఓం కేశవాయ స్వాహా |\nఓం నారాయణాయ స్వాహా |\nఓం మాధవాయ స్వాహా |",
            "devanagari": "ॐ केशवाय स्वाहा ।\nॐ नारायणाय स्वाहा।\nॐ माधवाय स्वाहा ।"
          }
        }
      ]
    },
    {
      "id": 3,
      "title": {
        "english": "Vighneswara Pooja",
        "telugu": "విఘ్నేశ్వర పూజ",
        "devanagari": "विघ्नेश्वर पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "To ensure the ritual proceeds without obstacles, we first pray to Lord Ganesha. Recite the following verses and mentally pray to Ganesha to remove all obstacles from your homam."
            ],
            "telugu": [
              "క్రతువు అడ్డంకులు లేకుండా కొనసాగడానికి, మనం మొదట గణేశుడిని ప్రార్థిస్తాం. ఈ క్రింది శ్లోకాలను పఠించి, మీ హోమం నుండి అన్ని అడ్డంకులను తొలగించమని గణేశుడిని మానసికంగా ప్రార్థించండి."
            ],
            "hindi": [
              "यह सुनिश्चित करने के लिए कि अनुष्ठान बिना किसी बाधा के आगे बढ़े, हम सबसे पहले भगवान गणेश से प्रार्थना करते हैं। निम्नलिखित श्लोकों का पाठ करें और अपने होम से सभी बाधाओं को दूर करने के लिए मानसिक रूप से गणेश से प्रार्थना करें।"
            ]
          },
          "slokas": {
            "english": "śuklāṃbaradharaṃ viṣṇuṃ śaśivarṇaṃ caturbhujaṃ | prasannavadanaṃ dhyāyet sarva vighnopaśāntaye ||\nagajānana padmārka gajānanamaharniśaṃ | anekadaṃ taṃ bhaktānāṃ ekadantaṃ upāsmahe ||\nvakratuṇḍa mahākāya koṭisūryasamaprabha | nirvighnaṃ kuru me deva sarvakāryeṣu sarvadā ||",
            "telugu": "శుక్లాంబరధరం విష్ణుం శశివర్ణం చతుర్భుజం | ప్రసన్నవదనం ధ్యాయేత్ సర్వ విఘ్నోపశాంతయే ||\nఅగజానన పద్మార్క గజాననమహర్నిశం | అనేకదం తం భక్తానాం ఏకదంతం ఉపాస్మహే ||\nవక్రతుండ మహాకాయ కోటిసూర్యసమప్రభ | నిర్విఘ్నం కురు మే దేవ సర్వకార్యేషు సర్వదా ||",
            "devanagari": "शुक्लांबरधरं विष्णुं शशिवर्णं चतुर्भुजं। प्रसन्नवदनं ध्यायेत् सर्व विघ्नोपशान्तये ॥\nअगजानन पद्मार्क गजाननमहर्निशं। अनेकदं तं भक्तानां एकदन्तं उपास्महे ॥\nवक्रतुंड महाकाय कोटिसूर्यसमप्रभ। निर्विघ्नं कुरु मे देव सर्वकार्येषु सर्वदा ॥"
          }
        }
      ]
    },
    {
      "id": 4,
      "title": {
        "english": "Praanaayaamam",
        "telugu": "ప్రాణాయామం",
        "devanagari": "प्राणायामम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Take some akshatas in your left palm and place it on your left lap. Use your right hand to control your nostrils. Close the left nostril with your ring and little fingers.",
              "Breathing in through the right nostril, mentally recite the Gayatri mantra (or 'om namo bhagavate vāsudevāya', 'om namaśśivāya', or 'om gaṃ gaṇapataye namaḥ').",
              "Close both nostrils and hold your breath while mentally reciting the mantra again.",
              "Breathing out through the left nostril, mentally recite the mantra a third time.",
              "Now, breathe in through the left nostril, reciting the mantra.",
              "Hold your breath again, reciting the mantra.",
              "Finally, breathe out through the right nostril, reciting the mantra for the sixth time. Contemplate the formless Supreme Being filling the universe."
            ],
            "telugu": [
              "కొన్ని అక్షతలను మీ ఎడమ అరచేతిలో తీసుకుని మీ ఎడమ ఒడిలో ఉంచండి. మీ ముక్కు రంధ్రాలను నియంత్రించడానికి మీ కుడి చేతిని ఉపయోగించండి. మీ ఉంగరపు మరియు చిటికెన వేళ్లతో ఎడమ ముక్కు రంధ్రాన్ని మూసివేయండి.",
              "కుడి ముక్కు రంధ్రం ద్వారా శ్వాస తీసుకుంటూ, గాయత్రీ మంత్రాన్ని (లేదా 'ఓం నమో భగవతే వాసుదేవాయ', 'ఓం నమశ్శివాయ', లేదా 'ఓం గం గణపతయే నమః') మానసికంగా జపించండి.",
              "రెండు ముక్కు రంధ్రాలను మూసి, శ్వాసను బిగపట్టి, మంత్రాన్ని మళ్ళీ మానసికంగా జపించండి.",
              "ఎడమ ముక్కు రంధ్రం ద్వారా శ్వాస వదులుతూ, మంత్రాన్ని మూడవసారి మానసికంగా జపించండి.",
              "ఇప్పుడు, ఎడమ ముక్కు రంధ్రం ద్వారా శ్వాస తీసుకుంటూ, మంత్రాన్ని జపించండి.",
              "మళ్ళీ శ్వాసను బిగపట్టి, మంత్రాన్ని జపించండి.",
              "చివరగా, కుడి ముక్కు రంధ్రం ద్వారా శ్వాస వదులుతూ, మంత్రాన్ని ఆరవసారి జపించండి. విశ్వాన్ని నింపిన నిరాకార పరబ్రహ్మాన్ని ధ్యానించండి."
            ],
            "hindi": [
              "कुछ अक्षत अपनी बाईं हथेली में लें और उसे अपनी बाईं गोद में रखें। अपनी दाहिनी हाथ से अपनी नासिकाओं को नियंत्रित करें। अपनी अनामिका और छोटी उंगली से बाईं नासिका को बंद करें।",
              "दाहिनी नासिका से सांस लेते हुए, मानसिक रूप से गायत्री मंत्र (या 'ॐ नमो भगवते वासुदेवाय', 'ॐ नमः शिवाय', या 'ॐ गं गणपतये नमः') का पाठ करें।",
              "दोनों नासिकाओं को बंद करें और अपनी सांस रोककर मानसिक रूप से मंत्र का दोबारा पाठ करें।",
              "बाईं नासिका से सांस छोड़ते हुए, मानसिक रूप से मंत्र का तीसरी बार पाठ करें।",
              "अब, बाईं नासिका से सांस लेते हुए, मंत्र का पाठ करें।",
              "फिर से अपनी सांस रोकें, मंत्र का पाठ करें।",
              "अंत में, दाहिनी नासिका से सांस छोड़ते हुए, छठी बार मंत्र का पाठ करें। ब्रह्मांड को भरने वाले निराकार परब्रह्म का चिंतन करें।"
            ]
          },
          "slokas": {
            "english": "om namo bhagavate vāsudevāya | om namaśśivāya | om gaṃ gaṇapataye namaḥ |",
            "telugu": "ఓం నమో భగవతే వాసుదేవాయ | ఓం నమశ్శివాయ | ఓం గం గణపతయే నమః |",
            "devanagari": "ॐ नमो भगवते वासुदेवाय । ॐ नमश्शिवाय । ॐ गं गणपतये नमः ।"
          }
        }
      ]
    },
    {
      "id": 5,
      "title": {
        "english": "Sankalpam",
        "telugu": "సంకల్పం",
        "devanagari": "सङ्कल्पम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Declare your intention to perform the homam. Transfer the akshatas to your right hand, close it, and place it over your open left palm on your lap. State the following vow, mentally affirming your intent to perform the homam to the best of your ability to please Kaala Bhairava.",
              "After reciting, release the akshatas in front of the homa kundam and sprinkle a little water on your palms."
            ],
            "telugu": [
              "హోమం చేయాలనే మీ సంకల్పాన్ని ప్రకటించండి. అక్షతలను మీ కుడి చేతిలోకి మార్చి, దానిని మూసి, మీ ఒడిలో ఉన్న మీ ఎడమ అరచేతిపై ఉంచండి. కాల భైరవుడిని ప్రసన్నం చేసుకోవడానికి మీ శక్తి మేరకు హోమం చేయాలనే మీ ఉద్దేశ్యాన్ని మానసికంగా ధృవీకరిస్తూ, ఈ క్రింది సంకల్పాన్ని చెప్పండి.",
              "పఠించిన తరువాత, హోమ కుండం ముందు అక్షతలను వదిలి, మీ అరచేతులపై కొద్దిగా నీటిని చల్లుకోండి."
            ],
            "hindi": [
              "होम करने के अपने इरादे की घोषणा करें। अक्षत को अपने दाहिने हाथ में स्थानांतरित करें, इसे बंद करें, और इसे अपनी गोद में अपनी खुली बाईं हथेली पर रखें। निम्नलिखित संकल्प का पाठ करें, काल भैरव को प्रसन्न करने के लिए अपनी पूरी क्षमता से होम करने के अपने इरादे की मानसिक रूप से पुष्टि करें।",
              "पाठ करने के बाद, होम कुंड के सामने अक्षत छोड़ दें और अपनी हथेलियों पर थोड़ा पानी छिड़कें।"
            ]
          },
          "slokas": {
            "english": "om mamopātta samasta duritakṣayadvārā śrī parameśvara prītyartham śrī kāla bhairava prasāda siddhayartham adya śubhadine śubhamuhūrte śrī kāla bhairava homakarma yathāśakti kariṣye |",
            "telugu": "ఓం మమోపాత్త సమస్త దురితక్షయద్వారా శ్రీ పరమేశ్వర ప్రీత్యర్థం శ్రీ కాల భైరవ ప్రసాద సిద్ధయర్థం అద్య శుభదినే శుభముహూర్తే శ్రీ కాల భైరవ హోమకర్మ యథాశక్తి కరిష్యే |",
            "devanagari": "ॐ ममोपात्त समस्त दुरितक्षयद्वारा श्री परमेश्वर प्रीत्यर्थम् श्री काल भैरव प्रसाद सिद्धयर्थम् अद्य शुभदिने शुभमुहूर्ते श्री काल भैरव होमकर्म यथाशक्ति करिष्ये ।"
          }
        }
      ]
    },
    {
      "id": 6,
      "title": {
        "english": "Kalasa Suddhi",
        "telugu": "కలశ శుద్ధి",
        "devanagari": "कलश शुद्धि"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Light the ghee/oil lamp. Place a few akshatas and a flower in the tumbler of water. Purify the water by chanting the syllable 'vaṃ' 11 times.",
              "Next, recite the following mantra to invoke the essence of the sacred rivers into the water.",
              "Then, take a little water with a flower or spoon and sprinkle it on yourself, the homa kundam, the idol, and all the ritual materials."
            ],
            "telugu": [
              "నెయ్యి/నూనె దీపాన్ని వెలిగించండి. కొన్ని అక్షతలు మరియు ఒక పువ్వును నీటి గ్లాసులో ఉంచండి. 'వం' అనే అక్షరాన్ని 11 సార్లు జపించి నీటిని శుద్ధి చేయండి.",
              "తరువాత, పవిత్ర నదుల సారాన్ని నీటిలోకి ఆహ్వానించడానికి ఈ క్రింది మంత్రాన్ని పఠించండి.",
              "అప్పుడు, పువ్వుతో లేదా చెంచాతో కొద్దిగా నీటిని తీసుకుని మీపై, హోమ కుండంపై, విగ్రహంపై మరియు అన్ని పూజా సామగ్రిపై చల్లుకోండి."
            ],
            "hindi": [
              "घी/तेल का दीपक जलाएं। पानी के गिलास में कुछ अक्षत और एक फूल डालें। 'वं' अक्षर का 11 बार जाप करके जल को शुद्ध करें।",
              "इसके बाद, पवित्र नदियों के सार को जल में आमंत्रित करने के लिए निम्नलिखित मंत्र का पाठ करें।",
              "फिर, एक फूल या चम्मच से थोड़ा पानी लें और इसे अपने ऊपर, होम कुंड, मूर्ति और सभी अनुष्ठान सामग्री पर छिड़कें।"
            ]
          },
          "slokas": {
            "english": "vaṃ ||\ngaṃge ca yamune caiva godāvari sarasvati | narmade sindhu kāveri jale'smin sannidhiṃ kuru ||\namṛtaṃ bhavatu ||",
            "telugu": "వం ||\nగంగే చ యమునే చైవ గోదావరి సరస్వతి | నర్మదే సింధు కావేరి జలేస్మిన్ సన్నిధిం కురు ||\nఅమృతం భవతు ||",
            "devanagari": "वं ॥\nगंगे च यमुने चैव गोदावरि सरस्वति । नर्मदे सिन्धु कावेरि जलेऽस्मिन् सन्निधिं कuru ॥\nअमृतं भवतु ॥"
          }
        }
      ]
    },
    {
      "id": 7,
      "title": {
        "english": "Drawing Lines in Homa Kundam",
        "telugu": "హోమ కుండంలో రేఖలు గీయడం",
        "devanagari": "होम कुण्ड में रेखाएं खींचना"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Using a blade of darbha grass, draw six lines on the base of the homa kundam as shown in the diagram. Recite the corresponding mantra for each line drawn."
            ],
            "telugu": [
              "ఒక దర్భ గడ్డితో, చిత్రంలో చూపిన విధంగా హోమ కుండం యొక్క అడుగున ఆరు రేఖలను గీయండి. గీసిన ప్రతి రేఖకు సంబంధించిన మంత్రాన్ని పఠించండి."
            ],
            "hindi": [
              "एक कुश के तिनके का उपयोग करके, होम कुंड के आधार पर चित्र में दिखाए अनुसार छह रेखाएँ खींचें। खींची गई प्रत्येक रेखा के लिए संबंधित मंत्र का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "1. om brahmaṇe namaḥ |\n2. om yamāya namaḥ |\n3. om somāya namaḥ |\n4. om rudrāya namaḥ |\n5. om viṣṇave namaḥ |\n6. om indrāya namaḥ |",
            "telugu": "౧. ఓం బ్రహ్మణే నమః |\n౨. ఓం యమాయ నమః |\n౩. ఓం సోమాయ నమః |\n౪. ఓం రుద్రాయ నమః |\n౫. ఓం విష్ణవే నమః |\n౬. ఓం ఇంద్రాయ నమః |",
            "devanagari": "१. ॐ ब्रह्मणे नमः ।\n२. ॐ यमाय नमः ।\n३. ॐ सोमाय नमः ।\n४. ॐ रुद्राय नमः।\n५. ॐ विष्णवे नमः ।\n६. ॐ इन्द्राय नमः ।"
          },
          "diagram": "/diagrams/homa-kundam-6-lines.svg"
        }
      ]
    },
    {
      "id": 8,
      "title": {
        "english": "Agni Pratishthaapana",
        "telugu": "అగ్ని ప్రతిష్ఠాపన",
        "devanagari": "अग्नि प्रतिष्ठापन"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Place two darbhas inside the homa kundam, one east-west and one north-south. Light a piece of camphor from the lamp and place it in the center of the kundam while chanting the following mantra."
            ],
            "telugu": [
              "హోమ కుండంలో రెండు దర్భలను ఉంచండి, ఒకటి తూర్పు-పడమరగా మరియు ఒకటి ఉత్తర-దక్షిణంగా. దీపం నుండి కర్పూరం ముక్కను వెలిగించి, ఈ క్రింది మంత్రాన్ని జపిస్తూ కుండం మధ్యలో ఉంచండి."
            ],
            "hindi": [
              "होम कुंड के अंदर दो कुश रखें, एक पूर्व-पश्चिम और एक उत्तर-दक्षिण। दीपक से कपूर का एक टुकड़ा जलाएं और निम्नलिखित मंत्र का जाप करते हुए उसे कुंड के केंद्र में रखें।"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvarom",
            "telugu": "ఓం భూర్భువస్సువరోం",
            "devanagari": "ॐ भूर्भुवस्सुवरोम्"
          }
        },
        {
          "instructions": {
            "english": [
              "Place dry coconut pieces or wood over the burning camphor to build the fire. Then, pray to the fire god with the following mantra, requesting him to keep away the inauspicious 'kravyaada' fire and carry offerings through the auspicious 'jaatavedas' fire."
            ],
            "telugu": [
              "మండుతున్న కర్పూరం మీద ఎండు కొబ్బరి ముక్కలు లేదా కలపను ఉంచి అగ్నిని రాజేయండి. తరువాత, అశుభకరమైన 'క్రవ్యాద' అగ్నిని దూరంగా ఉంచి, శుభకరమైన 'జాతవేద' అగ్ని ద్వారా నైవేద్యాలను చేరవేయమని అగ్ని దేవుడిని ఈ క్రింది మంత్రంతో ప్రార్థించండి."
            ],
            "hindi": [
              "आग बनाने के लिए जलते हुए कपूर के ऊपर सूखे नारियल के टुकड़े या लकड़ी रखें। फिर, अग्नि देव से निम्नलिखित मंत्र के साथ प्रार्थना करें, उनसे अशुभ 'क्रव्याद' अग्नि को दूर रखने और शुभ 'जातवेद' अग्नि के माध्यम से प्रसाद ले जाने का अनुरोध करें।"
            ]
          },
          "slokas": {
            "english": "kravyādamagniṃ prahiṇomi dūraṃ yamarājño gacchatu ripravāhaḥ | ihaivāyamitaro jātavedā devebhyo havyaṃ vahatu prajānan ||",
            "telugu": "క్రవ్యాదమగ్నిం ప్రహిణోమి దూరం యమరాజ్ఞో గచ్ఛతు రిప్రవాహః | ఇహైవాయమితరో జాతవేదా దేవేభ్యో హవ్యం వహతు ప్రజానన్ ||",
            "devanagari": "क्रव्यादमग्निं प्रहिणोमि दूरं यमराज्ञो गच्छतु रिप्रवाहः । इहैवायमितरो जातवेदा देवेभ्यो हव्यं वहतु प्रजानन् ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "To refine the fire (samskara), pour 8 drops of ghee into the fire while chanting the following mantra 8 times."
            ],
            "telugu": [
              "అగ్నిని శుద్ధి చేయడానికి (సంస్కారం), ఈ క్రింది మంత్రాన్ని 8 సార్లు జపిస్తూ అగ్నిలో 8 చుక్కల నెయ్యి పోయండి."
            ],
            "hindi": [
              "अग्नि को परिष्कृत (संस्कार) करने के लिए, निम्नलिखित मंत्र का 8 बार जाप करते हुए अग्नि में 8 बूंद घी डालें।"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvaḥ svāhā |",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా |",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Place darbhas or twigs along the four outer boundaries of the homa kundam (east, south, west, north). Then, sprinkle water around the four boundaries as shown in the diagram, reciting the following four mantras in order."
            ],
            "telugu": [
              "హోమ కుండం యొక్క నాలుగు బయటి సరిహద్దుల (తూర్పు, దక్షిణం, పడమర, ఉత్తరం) వెంబడి దర్భలు లేదా కొమ్మలను ఉంచండి. తరువాత, చిత్రంలో చూపిన విధంగా నాలుగు సరిహద్దుల చుట్టూ నీటిని చల్లుతూ, ఈ క్రింది నాలుగు మంత్రాలను వరుసగా పఠించండి."
            ],
            "hindi": [
              "होम कुंड की चार बाहरी सीमाओं (पूर्व, दक्षिण, पश्चिम, उत्तर) पर कुश या टहनियाँ रखें। फिर, चित्र में दिखाए अनुसार चारों सीमाओं के चारों ओर पानी छिड़कें, क्रम में निम्नलिखित चार मंत्रों का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "adite'numanyasva | anumate'numanyasva | sarasvate'numanyasva | deva savitaḥ prasuva |",
            "telugu": "అదితేऽనుమన్యస్వ | అనుమతేऽనుమన్యస్వ | సరస్వతేऽనుమన్యస్వ | దేవ సవితః ప్రసువ |",
            "devanagari": "अदितेऽनुमन्यस्व । अनुमतेऽनुमन्यस्व । सरस्वतेऽनुमन्यस्व । देव सवितः प्रसुव ।"
          },
          "diagram_placeholder": "Figure 2: Sprinkling water around the homa kundam."
        },
        {
          "instructions": {
            "english": [
              "Now, pray to Agni (fire god) with the following mantra, asking him to be present and face you."
            ],
            "telugu": [
              "ఇప్పుడు, అగ్ని దేవుడిని ఈ క్రింది మంత్రంతో ప్రార్థించండి, ఆయనను హాజరై మిమ్మల్ని ఎదుర్కోమని కోరండి."
            ],
            "hindi": [
              "अब, अग्नि (अग्नि देव) से निम्नलिखित मंत्र के साथ प्रार्थना करें, उनसे उपस्थित रहने और आपका सामना करने के लिए कहें।"
            ]
          },
          "slokas": {
            "english": "catvāri śṛṃgāstrayo asya pādā dve śīrṣe saptahastāso asya | tridhā baddho vṛṣabho roravīti maho devo martyā āviveśa || eṣa hi devaḥ pradiśo nu sarvāḥ pūrvo hi jātaḥ sa u garbhe antaḥ | sa vijāyamānaḥ sa janiṣyamāṇaḥ pratyaṅ‌mukhāstiṣṭhati viśvatomukhaḥ | prāṅ‌mukho deva | he agne | mamābhimukho bhava ||",
            "telugu": "చత్వారి శృంగాస్త్రయో అస్య పాదా ద్వే శీర్షే సప్తహస్తాసో అస్య | త్రిధా బద్ధో వృషభో రోరవీతి మహో దేవో మర్త్యా ఆవివేశ || ఏష హి దేవః ప్రదిశో ను సర్వాః పూర్వో హి జాతః స ఉ గర్భే అంతః | స విజాయమానః స జనిష్యమాణః ప్రత్యఙ్‌ముఖాస్తిష్ఠతి విశ్వతోముఖః | ప్రాఙ్‌ముఖో దేవ | హే అగ్నే | మమాభిముఖో భవ ||",
            "devanagari": "चत्वारि शृंगास्त्रयो अस्य पादा द्वे शीर्षे सप्तहस्तसो अस्य । त्रिधा बद्धो वृषभो रोरवीति महो देवो मर्त्या आविवेश ॥ एष हि देवः प्रदिशो नु सर्वाः पूर्वो हि जातः स उ गर्ने अन्तः । स विजायमानः स जनिष्यमाणः प्रत्यङ्‌मुखास्तिष्ठति विश्वतोमुखः । प्राङ्‌मुखो देव। हे अग्ने। ममाभिमुखो भव ॥"
          }
        }
      ]
    },
    {
      "id": 9,
      "title": {
        "english": "Dikpaalaka Pooja",
        "telugu": "దిక్పాలక పూజ",
        "devanagari": "दिक्पालक पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Offer akshatas and flowers to the rulers of the directions. Place them on the edges of the homa kundam, starting from the East and moving clockwise through the eight directions. Then, make offerings for Brahma (upward, between NE and E), Sesha (downward, between SW and W), Agni (in the middle of the kundam), and finally to your Self (by touching your heart). Recite the following 12 mantras for the 12 offerings."
            ],
            "telugu": [
              "దిక్పాలకులకు అక్షతలు మరియు పువ్వులు సమర్పించండి. వాటిని హోమ కుండం అంచులపై ఉంచండి, తూర్పు నుండి ప్రారంభించి ఎనిమిది దిశలలో సవ్యదిశలో కదలండి. తరువాత, బ్రహ్మ (పైకి, ఈశాన్యం మరియు తూర్పు మధ్య), శేషుడు (కిందికి, నైరుతి మరియు పడమర మధ్య), అగ్ని (కుండం మధ్యలో), మరియు చివరగా మీ ఆత్మకు (మీ హృదయాన్ని తాకడం ద్వారా) నైవేద్యాలు చేయండి. 12 నైవేద్యాల కోసం ఈ క్రింది 12 మంత్రాలను పఠించండి."
            ],
            "hindi": [
              "दिशाओं के शासकों को अक्षत और फूल अर्पित करें। उन्हें होम कुंड के किनारों पर रखें, पूर्व से शुरू होकर आठ दिशाओं में दक्षिणावर्त घूमते हुए। फिर, ब्रह्मा (ऊपर, उत्तर-पूर्व और पूर्व के बीच), शेष (नीचे, दक्षिण-पश्चिम और पश्चिम के बीच), अग्नि (कुंड के बीच में), और अंत में स्वयं (अपने हृदय को छूकर) के लिए प्रसाद चढ़ाएं। 12 प्रसादों के लिए निम्नलिखित 12 मंत्रों का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "om indrāya namaḥ | om agnaye namaḥ | om yamāya namaḥ | om nirṛtaye namaḥ | om varuṇāya namaḥ | om vāyave namaḥ | om somāya namaḥ | om īśānāya namaḥ | om brahmaṇe namaḥ | om śeṣāya namaḥ | om agnaye namaḥ | om ātmane namaḥ |",
            "telugu": "ఓం ఇంద్రాయ నమః | ఓం అగ్నయే నమః | ఓం యమాయ నమః | ఓం నిరృతయే నమః | ఓం వరుణాయ నమః | ఓం వాయవే నమః | ఓం సోమాయ నమః | ఓం ఈశానాయ నమః | ఓం బ్రహ్మణే నమః | ఓం శేషాయ నమః | ఓం అగ్నయే నమః | ఓం ఆత్మనే నమః |",
            "devanagari": "ॐ इन्द्राय नमः। ॐ अग्नये नमः। ॐ यमाय नमः। ॐ निर्ऋतये नमः। ॐ वरुणाय नमः। ॐ वायवे नमः। ॐ सोमाय नमः। ॐ ईशानाय नमः । ॐ ब्रह्मणे नमः। ॐ शेषाय नमः। ॐ अग्नये नमः। ॐ आत्मने नमः।"
          },
          "diagram": "/diagrams/dikpalakas.svg"
        }
      ]
    },
    {
      "id": 10,
      "title": {
        "english": "Poorvaangam",
        "telugu": "పూర్వాంగం",
        "devanagari": "पूर्वाङ्गम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Make preliminary offerings of ghee. First, for Prajapati, pointing the ladle from northwest to southeast. Second, for Indra, pointing from southwest to northeast. Third, for Agni, in the middle. Fourth, for Soma, in the northern part of the fire."
            ],
            "telugu": [
              "నెయ్యితో ప్రాథమిక నైవేద్యాలు చేయండి. మొదట, ప్రజాపతికి, స్రువాన్ని వాయువ్యం నుండి ఆగ్నేయం వైపు చూపిస్తూ. రెండవది, ఇంద్రుడికి, నైరుతి నుండి ఈశాన్యం వైపు చూపిస్తూ. మూడవది, అగ్నికి, మధ్యలో. నాల్గవది, సోముడికి, అగ్ని యొక్క ఉత్తర భాగంలో."
            ],
            "hindi": [
              "घी की प्रारंभिक आहुतियाँ दें। सबसे पहले, प्रजापति के लिए, करछुल को उत्तर-पश्चिम से दक्षिण-पूर्व की ओर इंगित करते हुए। दूसरा, इंद्र के लिए, दक्षिण-पश्चिम से उत्तर-पूर्व की ओर इंगित करते हुए। तीसरा, अग्नि के लिए, बीच में। चौथा, सोम के लिए, अग्नि के उत्तरी भाग में।"
            ]
          },
          "slokas": {
            "english": "om prajāpataye svāhā | prajāpataya idaṃ na mama ||\nom indrāya svāhā | indrāyedaṃ na mama ||\nom agnaye svāhā | agnaya idaṃ na mama ||\nom somāya svāhā | somāyedaṃ na mama ||",
            "telugu": "ఓం ప్రజాపతయే స్వాహా | ప్రజాపతయ ఇదం న మమ ||\nఓం ఇంద్రాయ స్వాహా | ఇంద్రాయేదం న మమ ||\nఓం అగ్నయే స్వాహా | అగ్నయ ఇదం న మమ ||\nఓం సోమాయ స్వాహా | సోమాయేదం న మమ ||",
            "devanagari": "ॐ प्रजापतये स्वाहा। प्रजापतय इदं न मम ॥\nॐ इन्द्राय स्वाहा। इन्द्रायेदं न मम ॥\nॐ अग्नये स्वाहा। अग्नय इदं न मम ॥\nॐ सोमाय स्वाहा। सोमायेदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, offer a 'forgiveness offering' to Prajapati for any mistakes made up to this point."
            ],
            "telugu": [
              "ఇప్పుడు, ఈ సమయం వరకు జరిగిన ఏవైనా తప్పులకు ప్రజాపతికి 'క్షమాపణ నైవేద్యం' సమర్పించండి."
            ],
            "hindi": [
              "अब तक हुई किसी भी गलती के लिए प्रजापति को 'क्षमा आहुति' दें।"
            ]
          },
          "slokas": {
            "english": "āraṃbhaprabhṛti etat-kṣaṇa-paryantaṃ madhye saṃbhāvita samasta doṣa prāyaścittārthaṃ sarva prāyaścittaṃ hoṣyāmi | om bhūrbhuvassuvaḥ svāhā | prajāpataya idaṃ na mama ||",
            "telugu": "ఆరంభప్రభృతి ఏतत्-క్షణ-పర్యంతం మధ్యే సంభාවිත సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తం హోష్యామి | ఓం భూర్భువస్సువః స్వాహా | ప్రజాపతయ ఇదం న మమ ||",
            "devanagari": "आरंभप्रभृति एतत्क्षणपर्यन्तं मध्ये संभावित समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्तं होष्यामि। ॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥"
          }
        }
      ]
    },
    {
      "id": 11,
      "title": {
        "english": "Quick Homam for Mahaganapathi",
        "telugu": "మహా గణపతికి శీఘ్ర హోమం",
        "devanagari": "महागणपति के लिए त्वरित होम"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "For the removal of obstacles, first perform a quick pooja for Mahaganapathi. Invoke him into the fire with the following mantra, asking him to come, be established, be present, be confined, be veiled, and be pleased."
            ],
            "telugu": [
              "అడ్డంకుల నివారణ కోసం, మొదట మహాగణపతికి శీఘ్ర పూజ చేయండి. ఈ క్రింది మంత్రంతో ఆయనను అగ్నిలోకి ఆహ్వానించండి, రమ్మని, స్థాపించబడమని, హాజరుకావాలని, పరిమితం చేయబడమని, ఆవరించబడమని మరియు ప్రసన్నం కమ్మని కోరండి."
            ],
            "hindi": [
              "बाधाओं को दूर करने के लिए, पहले महागणपति के लिए एक त्वरित पूजा करें। निम्नलिखित मंत्र के साथ उन्हें अग्नि में आमंत्रित करें, उनसे आने, स्थापित होने, उपस्थित होने, सीमित होने, आच्छादित होने और प्रसन्न होने के लिए कहें।"
            ]
          },
          "slokas": {
            "english": "om gaṃ gaṇapataye namaḥ | asunī te punarasmāsu cakṣuḥ punaḥ prāṇamiha no dehi bhogaṃ | jyokpaśyema sūryamuccarantamanumate mṛḷayā naḥ svasti | om śrī mahāgaṇapati prāṇaśatktyai namaḥ | atra āgaccha | āvāhito bhava | sthāpito bhava | sannihito bhava | sanniruddho bhava | avakuṇṭhito bhava | prasīda prasīda ||",
            "telugu": "ఓం గం గణపతయే నమః | అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం | జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి | ఓం శ్రీ మహాగణపతి ప్రాణశత్క్త్యై నమః | అత్ర ఆగచ్ఛ | ఆవాహితో భవ | స్థాపిటో భవ | సన్నిహితో భవ | సన్నిరుద్ధో భవ | అవకుంఠితో భవ | ప్రసీద ప్రసీద ||",
            "devanagari": "ॐ गं गणपतये नमः। असुनी ते पुनरस्मासु चक्षुः पुनः प्राणमिह नो देहि भोगं। ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति । ॐ श्री महागणपति प्राणशत्क्त्यै नमः। अत्र आगच्छ। आवाहितो भव । स्थापितो भव । सन्निहितो भव । सन्निरुद्धो भव । अवकुंठितो भव । प्रसीद प्रसीद ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer sandalwood powder with 'laṃ', a flower with 'haṃ', incense with 'yaṃ', a lamp with 'raṃ', food with 'vaṃ', and finally all services with 'saṃ' by offering akshatas."
            ],
            "telugu": [
              "'లం' తో గంధపు పొడిని, 'హం' తో ఒక పువ్వును, 'యం' తో ధూపాన్ని, 'రం' తో దీపాన్ని, 'వం' తో ఆహారాన్ని, మరియు చివరగా 'సం' తో అక్షతలను సమర్పించడం ద్వారా అన్ని సేవలను సమర్పించండి."
            ],
            "hindi": [
              "'लं' के साथ चंदन पाउडर, 'हं' के साथ एक फूल, 'यं' के साथ धूप, 'रं' के साथ एक दीपक, 'वं' के साथ भोजन, और अंत में 'सं' के साथ अक्षत चढ़ाकर सभी सेवाएं प्रदान करें।"
            ]
          },
          "slokas": {
            "english": "laṃ pṛthivyātmane namaḥ | gandhaṃ samarpayāmi ||\nhaṃ ākāśātmane namaḥ | puṣpaṃ samarpayāmi ||\nyaṃ vāyvātmane namaḥ | dhūpaṃ āghrāpayāmi ||\nraṃ agnyātmane namaḥ | dīpaṃ darśayāmi ||\nvaṃ amṛtātmane namaḥ | naivedyaṃ samarpayāmi ||\nsaṃ sarvātmane namaḥ | sarvopacārān samarpayāmi ||",
            "telugu": "లం పృథివ్యాత్మనే నమః | గంధం సమర్పయామి ||\nహం ఆకాశాత్మనే నమః | పుష్పం సమర్పయామి ||\nయం వాయ్వాత్మనే నమః | ధూపం ఆఘ్రాపయామి ||\nరం అగ్న్యాత్మనే నమః | దీపం దర్శయామి ||\nవం అమృతాత్మనే నమః | నైవేద్యం సమర్పయామి ||\nసం సర్వాత్మనే నమః | సర్వోపచారాన్ సమర్పయామి ||",
            "devanagari": "लं पृथिव्यात्मने नमः। गन्धं समर्पयामि ॥\nहं आकाशात्मने नमः। पुष्पं समर्पयामि ॥\nयं वाय्वात्मने नमः। धूपं आघ्रापयामि ॥\nरं अग्न्यात्मने नमः। दीपं दर्शयामि ॥\nवं अमृतात्मने नमः । नैवेद्यं समर्पयामि ॥\nसं सर्वात्मने नमः । सर्वोपचारान् समर्पयामि ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Now, offer ghee into the fire for Mahaganapathi, repeating the following mantra 4, 8, or 12 times."
            ],
            "telugu": [
              "ఇప్పుడు, మహాగణపతి కోసం అగ్నిలో నెయ్యి సమర్పించండి, ఈ క్రింది మంత్రాన్ని 4, 8, లేదా 12 సార్లు పునరావృతం చేయండి."
            ],
            "hindi": [
              "अब, महागणपति के लिए अग्नि में घी चढ़ाएं, निम्नलिखित मंत्र को 4, 8 या 12 बार दोहराएं।"
            ]
          },
          "slokas": {
            "english": "om gaṃ gaṇapataye namaḥ svāhā |",
            "telugu": "ఓం గం గణపతయే నమః స్వాహా |",
            "devanagari": "ॐ गं गणपतये नमः स्वाहा ।"
          }
        }
      ]
    },
    {
      "id": 12,
      "title": {
        "english": "Praana Pratishthaapanaa",
        "telugu": "ప్రాణ ప్రతిష్ఠాపన",
        "devanagari": "प्राण प्रतिष्ठापन"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, invoke the main deity, Kaala Bhairava. Recite the following for the rishis, chandas, devata, bija, shakti, and kilakam of the mantra, followed by nyasam (if known)."
            ],
            "telugu": [
              "ఇప్పుడు, ప్రధాన దేవత అయిన కాల భైరవుడిని ఆహ్వానించండి. మంత్రం యొక్క ఋషులు, ఛందస్సు, దేవత, బీజం, శక్తి మరియు కీలకం కోసం ఈ క్రింది వాటిని పఠించండి, ఆ తర్వాత న్యాసం (తెలిస్తే) చేయండి."
            ],
            "hindi": [
              "अब, मुख्य देवता, काल भैरव का आह्वान करें। मंत्र के ऋषियों, छंद, देवता, बीज, शक्ति और कीलक के लिए निम्नलिखित का पाठ करें, उसके बाद न्यास (यदि ज्ञात हो) करें।"
            ]
          },
          "slokas": {
            "english": "asya śrī prāṇapratiṣṭhāpana maṃtrasya brahma viṣṇu maheśvarā ṛṣayaḥ ṛgyajussāmātharvāṇi chandāṃsi śrī kālabhairavo devatā | hāṃ bījaṃ | hrīṃ śaktiḥ | hūṃ kīlakaṃ | hāṃ aṃguṣṭhābhyāṃ namaḥ | hrīṃ tarjanībhyāṃ namaḥ | hūṃ madhyamābhyāṃ namaḥ | haiṃ anāmikābhyāṃ namaḥ | hauṃ kaniṣṭhikābhāṃ namaḥ | hraḥ karatala karapṛṣṭhābhyāṃ namaḥ | hrāṃ hṛdayāya namaḥ | hrīṃ śirase svāhā | hūṃ śikhāyai vaṣaṭ | haiṃ kavacāya hūṃ | hauṃ netratrayāya vauṣaṭ | hraḥ astrāya phaṭ | bhūrbhuvassuvaromiti digbaṃdhaḥ ||",
            "telugu": "అస్య శ్రీ ప్రాణప్రతిష్ఠాపన మంత్రస్య బ్రహ్మ విష్ణు మహేశ్వరా ఋషయః ఋగ్యజుస్సామాథర్వాణి ఛందాంసి శ్రీ కాలభైరవో దేవతా | హాం బీజం | హ్రీం శక్తిః | హూం కీలకం | హాం అంగుష్ఠాభ్యాం నమః | హ్రీం తర్జనీభ్యాం నమః | హూం మధ్యమాభ్యాం నమః | హైం అనామికాభ్యాం నమః | హౌం కనిష్ఠికాభాం నమః | హ్రః కరతల కరపృష్ఠాభ్యాం నమః | హ్రాం హృదయాయ నమః | హ్రీం శిరసే స్వాహా | హూం శిఖాయై వషట్ | హైం కవచాయ హూం | హౌం నేత్రత్రయాయ వౌషట్ | హ్రః అస్త్రాయ ఫట్ | భూర్భువస్సువరోమితి దిగ్బంధః ||",
            "devanagari": "अस्य श्री प्राणप्रतिष्ठापन मंत्रस्य ब्रह्म विष्णु महेश्वरा ऋषयः ऋग्यजुस्सामाथर्वाणि छन्दासि श्री कालभैरवो देवता । हां बीजं । ह्रीं शक्तिः। हूं कीलकं । हां अंगुष्ठाभ्यां नमः। ह्रीं तर्जनीभ्यां नमः। हूं मध्यमाभ्यां नमः। हैं अनामिकाभ्यां नमः । हौं कनिष्ठिकाभां नमः । ह्रः करतल करपृष्ठाभ्यां नमः। ह्रां हृदयाय नमः। ह्रीं शिरसे स्वाहा। हूं शिखायै वषट् । हैं कवचाय हूं। हों नेत्रत्रयाय वौषट्। ह्रः अस्त्राय फट् । भूर्भुवस्सुवरोमिति दिग्बंधः ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Meditate on Kaala Bhairava with the following Dhyana sloka."
            ],
            "telugu": [
              "ఈ క్రింది ధ్యాన శ్లోకంతో కాల భైరవుడిని ధ్యానించండి."
            ],
            "hindi": [
              "निम्नलिखित ध्यान श्लोक के साथ काल भैरव का ध्यान करें।"
            ]
          },
          "slokas": {
            "english": "dhyānaṃ - om mohaghnaṃ jñānadaṃ nityaṃ vaṭukaṃ muktidāyakaṃ | kāśīpuranivāsaṃ ca kālabhairavamāśraye ||",
            "telugu": "ధ్యానం - ఓం మోహఘ్నం జ్ఞానదం నిత్యం వటుకం ముక్తిదాయకం | కాశీపురనివాసం చ కాలభైరవమాశ్రయే ||",
            "devanagari": "ध्यानं - ॐ मोहघ्नं ज्ञानदं नित्यं वटुकं मुक्तिदायकं । काशीपुरनिवासं च कालभैरवमाश्रये ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Invoke the life force (prana) of Kaala Bhairava into the fire and idol. Imagine the deity from your heart entering the fire and idol while chanting the following mantras."
            ],
            "telugu": [
              "కాల భైరవుని ప్రాణశక్తిని అగ్ని మరియు విగ్రహంలోకి ఆహ్వానించండి. మీ హృదయం నుండి దేవత అగ్ని మరియు విగ్రహంలోకి ప్రవేశిస్తున్నట్లు ఊహించుకుంటూ ఈ క్రింది మంత్రాలను జపించండి."
            ],
            "hindi": [
              "काल भैरव की प्राण शक्ति को अग्नि और मूर्ति में स्थापित करें। कल्पना करें कि आपके हृदय से देवता अग्नि और मूर्ति में प्रवेश कर रहे हैं, जबकि आप निम्नलिखित मंत्रों का जाप करते हैं।"
            ]
          },
          "slokas": {
            "english": "om hrāṃ hrīṃ hūṃ yaṃ raṃ laṃ vaṃśaṃ ṣaṃ saṃ haṃḻaṃ kṣaṃ | om haṃsaḥ so'haṃ so'haṃ haṃsaḥ | śrī kāla bhairavasya prāṇa iha prāṇaḥ | jīva iha sthitaḥ | sarvendriyāṇi vāṅmanastvak cakṣuḥ śrotra jihvāghrāṇa prāṇāpānavyānodānasamānāḥ ihaivāgatya sukhaṃ ciraṃ tiṣṭhantu svāhā | sānnidhyaṃ kurvantu svāhā || asunī te punarasmāsu cakṣuḥ punaḥ prāṇamiha no dehi bhogaṃ | jyokpaśyema sūryamuccarantamanumate mṛḷayā naḥ svasti | hāṃ hrīṃ hūṃ | hūṃ hrīṃ hāṃ | om śrī kāla bhairava prāṇaśatktyai namaḥ | atra āgaccha ||",
            "telugu": "ఓం హ్రాం హ్రీం హూం యం రం లం వంశం షం సం హంళం క్షం | ఓం హంసః సోऽహం సోऽహం హంసః | శ్రీ కాల భైరవస్య ప్రాణ ఇహ ప్రాణః | జీవ ఇహ స్థితః | సర్వేంద్రియాణి వాఙ్మనస్త్వక్ చక్షుః శ్రోత్ర జిహ్వాఘ్రాణ ప్రాణాపానవ్యానోదానసమానాః ఇహైవాగత్య సుఖం చిరం తిష్ఠన్తు స్వాహా | సాన్నిధ్యం కుర్వన్తు స్వాహా || అసునీ తే పునరస్మాసు చక్షుః పునః ప్రాణమిహ నో దేహి భోగం | జ్యోక్పశ్యేమ సూర్యముచ్చరంతమనుమతే మృళయా నః స్వస్తి | హాం హ్రీం హూం | హూం హ్రీం హాం | ఓం శ్రీ కాల భైరవ ప్రాణశత్క్త్యై నమః | అత్ర ఆగచ్ఛ ||",
            "devanagari": "ॐ ह्रां ह्रीं हूं यं रं लं वंशं षं सं हंळं क्षं । ॐ हंसः सोऽहं सोऽहं हंसः । श्री काल भैरवस्य प्राण इह प्राणः। जीव इह स्थितः । सर्वेन्द्रियाणि वाङ्मनस्त्वक् चक्षुः श्रोत्र जिह्वाघ्राण प्राणापानव्यानोदानसमानाः इहैवागत्य सुखं चिरं तिष्ठन्तु स्वाहा । सान्निध्यं कुर्वन्तु स्वाहा। असुनी ते पुनरस्मासु चक्षुः पुनः प्राणमिह नो देहि भोगं। ज्योक्पश्येम सूर्यमुच्चरन्तमनुमते मृळया नः स्वस्ति। हां हीं हूं । हूं हीं हां। ॐ श्री काल भैरव प्राणशत्क्त्यै नमः । अत्र आगच्छ ।"
          }
        },
        {
          "instructions": {
            "english": [
              "Recite the following and, if you know them, show the aavaahani, samsthaapani, sannidhaapani, sannirodhini and avakunthana mudras. Pray for Lord Kaala Bhairava to remain in the fire and idol until the end of the homam."
            ],
            "telugu": [
              "ఈ క్రింది వాటిని పఠించండి మరియు, మీకు తెలిస్తే, ఆవాహని, సంస్థాపని, సన్నిధాపని, సన్నిరోధిని మరియు అవకుంఠన ముద్రలను చూపండి. హోమం ముగిసే వరకు కాల భైరవుడు అగ్ని మరియు విగ్రహంలో ఉండాలని ప్రార్థించండి."
            ],
            "hindi": [
              "निम्नलिखित का पाठ करें और, यदि आप उन्हें जानते हैं, तो आवाहनी, संस्थापनी, सन्निधापनी, सन्निरोधिनी और अवकुण्ठन मुद्राएं दिखाएं। भगवान काल भैरव से होम के अंत तक अग्नि और मूर्ति में रहने की प्रार्थना करें।"
            ]
          },
          "slokas": {
            "english": "āvāhito bhava | sthāpito bhava | sannihito bhava | sanniruddho bhava | avakuṇṭhito bhava | deva prasīda prasīda | yāvaddhomāvasānakam | tāvattvaṃ prītibhāvena mūrtau agnau ca sannidhiṃ kuru ||",
            "telugu": "ఆవాహితో భవ | స్థాపిటో భవ | సన్నిహితో భవ | సన్నిరుద్ధో భవ | అవకుంఠితో భవ | దేవ ప్రసీద ప్రసీద | యావద్ధోమావసానకమ్ | తావత్త్వం ప్రీతిభావేన మూర్తౌ అగ్నౌ చ సన్నిధిం కురు ||",
            "devanagari": "आवाहितो भव । स्थापितो भव । सन्निहितो भव। सन्निरुद्धो भव। अवकुंठितो भव । देव प्रसीद प्रसीद । यावद्धोमावसानकम् । तावत्त्वं प्रीतिभावेन मूर्तों अग्नौ च सन्निधिं कुरु ॥"
          }
        }
      ]
    },
    {
      "id": 13,
      "title": {
        "english": "Panchopachaara Pooja",
        "telugu": "పంచోపచార పూజ",
        "devanagari": "पञ्चोपचार पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, offer five services to Kaala Bhairava in the fire and idol. Offer sandalwood paste/powder with 'laṃ', a flower with 'haṃ', incense with 'yaṃ', a lamp with 'raṃ', a food offering with 'vaṃ', and finally, offer akshatas for 'all services' with 'saṃ'."
            ],
            "telugu": [
              "ఇప్పుడు, అగ్ని మరియు విగ్రహంలో కాల భైరవునికి ఐదు సేవలు చేయండి. 'లం' తో గంధం/పొడి, 'హం' తో ఒక పువ్వు, 'యం' తో ధూపం, 'రం' తో దీపం, 'వం' తో నైవేద్యం, మరియు చివరగా, 'సం' తో 'అన్ని సేవల' కోసం అక్షతలను సమర్పించండి."
            ],
            "hindi": [
              "अब, अग्नि और मूर्ति में काल भैरव को पांच सेवाएं प्रदान करें। 'लं' के साथ चंदन का लेप/पाउडर, 'हं' के साथ एक फूल, 'यं' के साथ धूप, 'रं' के साथ एक दीपक, 'वं' के साथ भोजन का प्रसाद, और अंत में, 'सं' के साथ 'सभी सेवाओं' के लिए अक्षत चढ़ाएं।"
            ]
          },
          "slokas": {
            "english": "laṃ pṛthivyātmane namaḥ | gandhaṃ samarpayāmi ||\nhaṃ ākāśātmane namaḥ | puṣpaṃ samarpayāmi ||\nyaṃ vāyvātmane namaḥ | dhūpaṃ āghrāpayāmi ||\nraṃ agnyātmane namaḥ | dīpaṃ darśayāmi ||\nvaṃ amṛtātmane namaḥ | naivedyaṃ samarpayāmi ||\nsaṃ sarvātmane namaḥ | sarvopacārān samarpayāmi ||",
            "telugu": "లం పృథివ్యాత్మనే నమః | గంధం సమర్పయామి ||\nహం ఆకాశాత్మనే నమః | పుష్పం సమర్పయామి ||\nయం వాయ్వాత్మనే నమః | ధూపం ఆఘ్రాపయామి ||\nరం అగ్న్యాత్మనే నమః | దీపం దర్శయామి ||\nవం అమృతాత్మనే నమః | నైవేద్యం సమర్పయామి ||\nసం సర్వాత్మనే నమః | సర్వోపచారాన్ సమర్పయామి ||",
            "devanagari": "लं पृथिव्यात्मने नमः। गन्धं समर्पयामि ॥\nहं आकाशात्मने नमः। पुष्पं समर्पयामि ॥\nयं वाय्वात्मने नमः। धूपं आघ्रापयामि ॥\nरं अग्न्यात्मने नमः। दीपं दर्शयामि ॥\nवं अमृतात्मने नमः । नैवेद्यं समर्पयामि ॥\nसं सर्वात्मने नमः। सर्वोपचारान् समर्पयामि ॥"
          }
        }
      ]
    },
    {
      "id": 14,
      "title": {
        "english": "Parivaara Devata Aahutis",
        "telugu": "పరివార దేవత ఆహుతులు",
        "devanagari": "परिवार देवता आहुति"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "For a brief ritual, make a single offering of ghee for all of Kaala Bhairava's associate deities with the first mantra. If you have more time, make individual ghee offerings for each associate deity listed in the second set of mantras."
            ],
            "telugu": [
              "సంక్షిప్త క్రతువు కోసం, మొదటి మంత్రంతో కాల భైరవుని పరివార దేవతలందరికీ ఒకేసారి నెయ్యి సమర్పించండి. మీకు ఎక్కువ సమయం ఉంటే, రెండవ మంత్రాల సమితిలో జాబితా చేయబడిన ప్రతి పరివార దేవతకు వ్యక్తిగతంగా నెయ్యి సమర్పించండి."
            ],
            "hindi": [
              "एक संक्षिप्त अनुष्ठान के लिए, पहले मंत्र के साथ काल भैरव के सभी सहयोगी देवताओं के लिए घी की एक ही आहुति दें। यदि आपके पास अधिक समय है, तो मंत्रों के दूसरे सेट में सूचीबद्ध प्रत्येक सहयोगी देवता के लिए व्यक्तिगत रूप से घी की आहुति दें।"
            ]
          },
          "slokas": {
            "english": "Short version:\nom kāla bhairava parivāra devatābhyo namaḥ svāhā | kāla bhairava parivāra devatābhya idaṃ na mama ||\n\nLong version:\nom gaṃ gaṇapataye namaḥ svāhā | om kṣeṃ kṣetrapālakāya namaḥ svāhā | om vaṃ vaṭukāya namaḥ svāhā | om yoṃ yoginībhyo namaḥ svāhā | om aṃ asitāṃga bhairavāya namaḥ svāhā | om ruṃ ruru bhairavāya namaḥ svāhā | om caṃ caṃḍa bhairavāya namaḥ svāhā | om kroṃ krodhana bhairavāya namaḥ svāhā | om uṃ unmatta bhairavāya namaḥ svāhā | om kaṃ kapāla bhairavāya namaḥ svāhā | om bhīṃ bhīṣaṇa bhairavāya namaḥ svāhā | om saṃ saṃhāra bhairavāya namaḥ svāhā |",
            "telugu": "సంక్షిప్త రూపం:\nఓం కాల భైరవ పరివార దేవతాభ్యో నమః స్వాహా | కాల భైరవ పరివార దేవతాభ్య ఇదం న మమ ||\n\nవివరణాత్మక రూపం:\nఓం గం గణపతయే నమః స్వాహా | ఓం క్షేం క్షేత్రపాలకాయ నమః స్వాహా | ఓం వం వటుకాయ నమః స్వాహా | ఓం యోం యోగినీభ్యో నమః స్వాహా | ఓం అం అశితాంగ భైరవాయ నమః స్వాహా | ఓం రం రురు భైరవాయ నమః స్వాహా | ఓం చం చండ భైరవాయ నమః స్వాహా | ఓం క్రోం క్రోధన భైరవాయ నమః స్వాహా | ఓం ఉం ఉన్మత్త భైరవాయ నమః స్వాహా | ఓం కం కపాల భైరవాయ నమః స్వాహా | ఓం భీం భీషణ భైరవాయ నమః స్వాహా | ఓం సం సంహార భైరవాయ నమః స్వాహా |",
            "devanagari": "संक्षिप्त संस्करण:\nॐ काल भैरव परिवार देवताभ्यो नमः स्वाहा। काल भैरव परिवार देवताभ्य इदं न मम ॥\n\nविस्तृत संस्करण:\nॐ गं गणपतये नमः स्वाहा। ॐ क्षे क्षेत्रपालकाय नमः स्वाहा। ॐ वं वटुकाय नमः स्वाहा। ॐ यों योगिनीभ्यो नमः स्वाहा। ॐ अं असितांग भैरवाय नमः स्वाहा। ॐ रुं रुरु भैरवाय नमः स्वाहा। ॐ चं चंड भैरवाय नमः स्वाहा। ॐ क्रों क्रोधन भैरवाय नमः स्वाहा। ॐ उं उन्मत्त भैरवाय नमः स्वाहा। ॐ कं कपाल भैरवाय नमः स्वाहा। ॐ भीं भीषण भैरवाय नमः स्वाहा। ॐ सं संहार भैरवाय नमः स्वाहा।"
          }
        }
      ]
    },
    {
      "id": 15,
      "title": {
        "english": "Pradhaana Homam",
        "telugu": "ప్రధాన హోమం",
        "devanagari": "प्रधान होमम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "This is the main part of the homam. You can offer any mantras of Kaala Bhairava you prefer. It is advisable to pick one mantra and repeat it many times, rather than chanting many different mantras a few times. Add 'svāhā' at the end of the mantra for each offering. For the final offering of a particular mantra, use 'vauṣaṭ' instead. Offerings can include ghee, sesame seeds, puffed rice, or dry coconut pieces."
            ],
            "telugu": [
              "ఇది హోమం యొక్క ప్రధాన భాగం. మీకు నచ్చిన కాల భైరవ మంత్రాలను మీరు సమర్పించవచ్చు. అనేక విభిన్న మంత్రాలను కొన్నిసార్లు జపించడం కంటే, ఒక మంత్రాన్ని ఎంచుకుని దాన్ని చాలాసార్లు పునరావృతం చేయడం మంచిది. ప్రతి నైవేద్యానికి మంత్రం చివర 'స్వాహా' అని జోడించండి. ఒక నిర్దిష్ట మంత్రం యొక్క చివరి నైవేద్యం కోసం, బదులుగా 'వౌషట్' అని ఉపయోగించండి. నైవేద్యాలలో నెయ్యి, నువ్వులు, మరమరాలు లేదా ఎండు కొబ్బరి ముక్కలు ఉండవచ్చు."
            ],
            "hindi": [
              "यह होम का मुख्य भाग है। आप अपनी पसंद के किसी भी काल भैरव मंत्र का जाप कर सकते हैं। सलाह दी जाती है कि कई अलग-अलग मंत्रों को कुछ बार जपने के बजाय, एक मंत्र चुनें और उसे कई बार दोहराएं। प्रत्येक आहुति के लिए मंत्र के अंत में 'स्वाहा' जोड़ें। किसी विशेष मंत्र की अंतिम आहुति के लिए, इसके बजाय 'वौषट्' का उपयोग करें। आहुतियों में घी, तिल, मुरमुरे, या सूखे नारियल के टुकड़े शामिल हो सकते हैं।"
            ]
          },
          "slokas": {
            "english": "Mantra options:\n1. om kāla bhairavāya namaḥ | svāhā ||\n2. om hrīṃ vaṭukāya āpaduddharaṇāya kuru kuru vaṭukāya hrīṃ | svāhā ||\n3. om hrīṃ vaṃ vaṭukāya āpaduddharaṇāya vaṭukāya hrīṃ | svāhā ||\n4. om hrāṃ hrīṃ hūṃ haiṃ hauṃ hrīṃ kṣetrapālāya kāla bhairavāya namaḥ | svāhā ||\n5. (Gayatri) om kālakālāya vidmahe kālātītāya dhīmahi | tannaḥ kāla bhairavaḥ pracodayāt | svāhā ||",
            "telugu": "మంత్ర ఎంపికలు:\n౧. ఓం కాల భైరవాయ నమః | స్వాహా ||\n౨. ఓం హ్రీం వటుకాయ ఆపదుద్ధరణాయ కురు కురు వటుకాయ హ్రీం | స్వాహా ||\n౩. ఓం హ్రీం వం వటుకాయ ఆపదుద్ధరణాయ వటుకాయ హ్రీం | స్వాహా ||\n౪. ఓం హ్రాం హ్రీం హూం హైం హౌం హ్రీం క్షేత్రపాలాయ కాల భైరవాయ నమః | స్వాహా ||\n౫. (గాయత్రి) ఓం కాలకాలాయ విద్మహే కలాతీతాయ ధీమహి | తన్నః కాల భైరవః ప్రచోదయాత్ | స్వాహా ||",
            "devanagari": "मंत्र विकल्प:\n१. ॐ काल भैरवाय नमः । स्वाहा ॥\n२. ॐ ह्रीं वटुकाय आपदुद्धरणाय कुरु कुरु वटुकाय हीं। स्वाहा।\n३. ॐ ह्रीं वं वटुकाय आपदुद्धरणाय वटुकाय हीं । स्वाहा।\n४. ॐ ह्रां ह्रीं हूं हैं ह्रौं क्षें क्षेत्रपालाय काल भैरवाय नमः । स्वाहा ।\n५. (गायत्री) ॐ कालकालाय विद्महे कालातीताय धीमहि । तन्नः काल भैरवः प्रचोदयात् । स्वाहा ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Alternatively, you can offer the eight verses of the Kaala Bhairavaashtakam, making an offering after each verse."
            ],
            "telugu": [
              "ప్రత్యామ్నాయంగా, మీరు కాల భైరవాష్టకం యొక్క ఎనిమిది శ్లోకాలను సమర్పించవచ్చు, ప్రతి శ్లోకం తర్వాత ఒక నైవేద్యం చేయవచ్చు."
            ],
            "hindi": [
              "वैकल्पिक रूप से, आप काल भैरवाष्टकम् के आठ श्लोकों का पाठ कर सकते हैं, प्रत्येक श्लोक के बाद एक आहुति दे सकते हैं।"
            ]
          },
          "slokas": {
            "english": "1. devarāja sevyamāna pāvanāṃghri paṃkajaṃ | vyāla yajña sūtramindu śekharaṃ kṛpākaraṃ | nāradādi yogivṛnda vanditaṃ digambaraṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||\n2. bhānukoṭi bhāsvaraṃ bhavābdhi tārakaṃ paraṃ | nīla kaṇṭhamīpsitārtha dāyakaṃ trilocanaṃ | kāla kālamambujākṣamakṣa śūlamakṣaraṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||\n3. śūla ṭaṃka pāśa daṇḍa pāṇimādikāraṇaṃ | śyāma kāyamādi devamākṣaraṃ nirāmayaṃ | bhīmavikramaṃ prabhuṃ vicitra tāṇḍavapriyaṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||\n4. bhukti mukti dāyakaṃ praśasta cāru vigrahaṃ | bhakta vatsalaṃ sthitaṃ samasta loka vigrahaṃ | vinikvaṇanmanojña hema kiṃkiṇī lasatkaṭiṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||\n5. dharmasetupālakaṃ svadharmamārganāśanaṃ | karmapāśamocakaṃ suśarmadhāyakaṃ vibhuṃ | svarṇavarṇaśeṣapāśaśobhitāṃgamaṇḍalaṃ | kāśikāpurādhināthakālabhairavaṃ bhaje || svāhā ||\n6. ratna pādukā prabhābhirāma pāda yugmakaṃ | nityamadvitīyamiṣṭa daivataṃ niraṃjanaṃ | mṛtyu darpa nāśanaṃ karāla daṃṣṭra mokṣaṇaṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||\n7. aṭṭahāsa bhinna padmajāṇḍa kośa saṃtatiṃ | dṛṣṭipātta naṣṭa pāpa jālamugra śāsanaṃ | aṣṭa siddhi dāyakaṃ kapāla mālikādharaṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||\n8. bhūtasaṃgha nāyakaṃ viśāla kīrti dāyakaṃ | kāśi vāsa loka puṇya pāpa śodhakaṃ vibhuṃ | nīti mārga kovidaṃ purātanaṃ jagatpatiṃ | kāśikā purādhinātha kālabhairavaṃ bhaje || svāhā ||",
            "telugu": "౧. దేవరాజ సేవ్యమాన పావనాంఘ్రి పంకజం | వ్యాల యజ్ఞ సూత్రమిందు శేఖరం కృపాకరం | నారదాది యోగివృంద వందితం దిగంబరం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||\n౨. భానుకోటి భాస్వరం భవాబ్ధి తారకం పరం | నీల కంఠమీప్సితార్థ దాయకం త్రిలోచనం | కాల కాలమంబుజాక్షమక్ష శూలమక్షరం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||\n౩. శూల టంక పాశ దండ పాణిమాదికారణం | శ్యామ కాయమాది దేవమక్షరం నిరామయం | భీమవిక్రమం ప్రభుం విచిత్ర తాండవప్రియం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||\n౪. భుక్తి ముక్తి దాయకం ప్రశస్త చారు విగ్రహం | భక్త వత్సలం స్థితం సమస్త లోక విగ్రహం | వినిక్వణన్మనోజ్ఞ హేమ కింకిణీ లసత్కటిం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||\n౫. ధర్మసేతుపాలకం స్వధర్మమార్గనాశనం | కర్మపాశమోచకం సుశర్మధాయకం విభుం | స్వర్ణవర్ణశేషపాశశోభితాంగమండలం | కాశికాపురాధినాథకాలభైరవం భజే || స్వాహా ||\n౬. రత్న పాదుకా ప్రభాభిరామ పాద యుగ్మకం | నిత్యమద్వితీయమిష్ట దైవతం నిరంజనం | మృత్యు దర్ప నాశనం కరాల దంష్ట్ర మోక్షణం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||\n౭. అట్టహాస భిన్న పద్మజాండ కోశ సంతతిం | దృష్టిపాత నష్ట పాప జాలముగ్ర శాసనం | అష్ట సిద్ధి దాయకం కపాల మాలికాధరం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||\n౮. భూతసంఘ నాయకం విశాల కీర్తి దాయకం | కాశి వాస లోక పుణ్య పాప శోధకం విభుం | నీతి మార్గ కోవిదం పురాతనం జగత్పతిం | కాశికా పురాధినాథ కాలభైరవం భజే || స్వాహా ||",
            "devanagari": "१. देवराज सेव्यमान पावनांघ्रि पंकजं। व्याल यज्ञ सूत्रमिन्दु शेखरं कृपाकरं । नारदादि योगिवृन्द वन्दितं दिगंबरं । काशिका पुराधिनाथ कालभैरवं भजे ॥ स्वाहा।\n२. भानुकोटि भास्वरं भवाब्धि तारकं परं । नील कण्ठमीप्सितार्थ दायकं त्रिलोचनं । काल कालमंबुजाक्षमक्ष शूलमक्षरं । काशिका पुराधिनाथ कालभैरवं भजे ॥ स्वाहा।\n३. शूल टंक पाश दण्ड पाणिमादिकारणं। श्याम कायमादि देवमक्षरं निरामयं । भीमविक्रमं प्रभुं विचित्र ताण्डवप्रियं । काशिका पुराधिनाथ कालभैरवं भजे ॥ स्वाहा ।\n४. भुक्ति मुक्ति दायकं प्रशस्त चारु विग्रहं । भक्त वत्सलं स्थितं समस्त लोक विग्रहं । विनिक्वणन्मनोज्ञ हेम किंकिणी लसत्कटिं। काशिका पुराधिनाथ कालभैरवं भजे। स्वाहा।\n५. धर्मसेतुपालकं स्वधर्ममार्गनाशनं । कर्मपाशमोचकं सुशर्मधायकं विभुं । स्वर्णवर्णशेषपाशशोभितांगमण्डलं । काशिकापुराधिनाथकालभैरवं भजे ॥ स्वाहा।\n६. रत्न पादुका प्रभाभिराम पाद युग्मकं । नित्यमद्वितीयमिष्ट दैवतं निरंजनं । मृत्यु दर्प नाशनं कराल दंष्ट्र मोक्षणं । काशिका पुराधिनाथ कालभैरवं भजे ॥ स्वाहा।\n७. अट्टहास भिन्न पद्मजाण्ड कोश संततिं । दृष्टिपात्त नष्ट पाप जालमुग्र शासनं । अष्ट सिद्धि दायकं कपाल मालिकाधरं। काशिका पुराधिनाथ कालभैरवं भजे ॥ स्वाहा।\n८. भूतसंघ नायकं विशाल कीर्ति दायकं । काशि वास लोक पुण्य पाप शोधकं विभुं । नीति मार्ग कोविदं पुरातनं जगत्पतिं। काशिका पुराधिनाथ कालभैरवं भजे ॥ स्वाहा।"
          }
        }
      ]
    },
    {
      "id": 16,
      "title": {
        "english": "Punah Pooja",
        "telugu": "పునః పూజ",
        "devanagari": "पुनः पूजा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "After the main offerings, worship Kaala Bhairava again. Offer food (Naivedyam) to the fire and idol with the first mantra. Then, light a piece of camphor and show it to the fire (Neerajanam) with the second mantra. Finally, get up and perform one or three clockwise circumambulations (pradakshinas) around the homa kundam."
            ],
            "telugu": [
              "ప్రధాన నైవేద్యాల తరువాత, కాల భైరవుడిని మళ్ళీ పూజించండి. మొదటి మంత్రంతో అగ్నికి మరియు విగ్రహానికి ఆహారాన్ని (నైవేద్యం) సమర్పించండి. తరువాత, కర్పూరం ముక్కను వెలిగించి రెండవ మంత్రంతో అగ్నికి (నీరాజనం) చూపండి. చివరగా, లేచి హోమ కుండం చుట్టూ ఒకటి లేదా మూడు సవ్యదిశ ప్రదక్షిణలు చేయండి."
            ],
            "hindi": [
              "मुख्य आहुतियों के बाद, काल भैरव की फिर से पूजा करें। पहले मंत्र के साथ अग्नि और मूर्ति को भोजन (नैवेद्य) अर्पित करें। फिर, कपूर का एक टुकड़ा जलाएं और दूसरे मंत्र के साथ इसे अग्नि (नीराजन) को दिखाएं। अंत में, उठकर होम कुंड के चारों ओर एक या तीन दक्षिणावर्त परिक्रमा करें।"
            ]
          },
          "slokas": {
            "english": "om kāla bhairavāya namaḥ | naivedyaṃ samarpayāmi ||\nom kāla bhairavāya namaḥ | nīrājanaṃ samarpayāmi ||",
            "telugu": "ఓం కాల భైరవాయ నమః | నైవేద్యం సమర్పయామి ||\nఓం కాల భైరవాయ నమః | నీరాజనం సమర్పయామి ||",
            "devanagari": "ॐ काल भैरवाय नमः। नैवेद्यं समर्पयामि।\nॐ काल भैरवाय नमः। नीराजनं समर्पयामि ।"
          }
        }
      ]
    },
    {
      "id": 17,
      "title": {
        "english": "Uttaraangam",
        "telugu": "ఉత్తరాంగం",
        "devanagari": "उत्तराङ्गम्"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Make concluding offerings. Offer ghee for Prajapati, for the three worlds (Bhuh - Agni, Bhuvah - Vayu, Suvah - Surya), for Agni Svishtakrut (the one who makes offerings perfect), and again for Prajapati."
            ],
            "telugu": [
              "ముగింపు నైవేద్యాలు చేయండి. ప్రజాపతికి, మూడు లోకాలకు (భూః - అగ్ని, భువః - వాయు, సువః - సూర్య), అగ్ని స్విష్టకృత్‌కు (నైవేద్యాలను పరిపూర్ణం చేసేవాడు), మరియు మళ్ళీ ప్రజాపతికి నెయ్యి సమర్పించండి."
            ],
            "hindi": [
              "समापन आहुतियाँ दें। प्रजापति के लिए, तीन लोकों (भूः - अग्नि, भुवः - वायु, सुवः - सूर्य) के लिए, अग्नि स्विष्टकृत (जो आहुतियों को उत्तम बनाता है) के लिए, और फिर से प्रजापति के लिए घी अर्पित करें।"
            ]
          },
          "slokas": {
            "english": "om prajāpate na tvadetānyanyo viśvā jātāni pari tā babhūva | yatkāmāste juhumastanno astu vayaḥ syāma patayo rayīṇām | svāhā | prajāpataya idaṃ na mama ||\nom bhūḥ svāhā | agnaya idaṃ na mama ||\nom bhuvaḥ svāhā | vāyava idaṃ na mama ||\nom suvaḥ svāhā | sūryāyedaṃ na mama ||\nyadasya karmaṇo'tyarīricaṃ yadvānyūnamihākaram | agniṣṭat sviṣṭakṛdvidvān sarvaṃ sviṣṭaṃ suhuṃtaṃ karotu svāhā | agnaye sviṣṭakṛta idaṃ na mama ||\nom bhūrbhuvassuvaḥ svāhā | prajāpataya idaṃ na mama ||",
            "telugu": "ఓం ప్రజాపతే న త్వదేతాన్యన్యో విశ్వా జాతాని పరి తా బభూవ | యత్కామాస్తే జుహుమస్తన్నో అస్తు వయః స్యామ పతయో రయీణామ్ | స్వాహా | ప్రజాపతయ ఇదం న మమ ||\nఓం భూః స్వాహా | అగ్నయ ఇదం న మమ ||\nఓం భువః స్వాహా | వాయవ ఇదం న మమ ||\nఓం సువః స్వాహా | సూర్యాయేదం న మమ ||\nయదస్య కర్మణోऽత్యరీరిచం యద్వాన్యూనమిహాకరం | అగ్నిష్టత్ స్విష్టకృద్విద్వాన్ సర్వం స్విష్టం సుహుతం కరోతు స్వాహా | అగ్నయే స్విష్టకృత ఇదం న మమ ||\nఓం భూర్భువస్సువః స్వాహా | ప్రజాపతయ ఇదం న మమ ||",
            "devanagari": "ॐ प्रजापते न त्वदेतान्यन्यो विश्वा जातानि परि ता बभूव । यत्कामास्ते जुहुमस्तन्नो अस्तु वयः स्याम पतयो रयीणाम्। स्वाहा। प्रजापतय इदं न मम ॥\nॐ भूः स्वाहा। अग्नय इदं न मम ॥\nॐ भुवः स्वाहा। वायव इदं न मम ॥\nॐ सुवः स्वाहा। सूर्यायेदं न मम ॥\nयदस्य कर्मणोऽत्यरीरिचं यद्वान्यूनमिहाकरम् । अग्निष्टत् स्विष्टकृद्विद्वान् सर्वं स्विष्टं सुहुतं करोतु स्वाहा। अग्नये स्विष्टकृत इदं न मम ॥\nॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Perform Pranaayaamam again. Then, make three offerings to Agni for forgiveness for any mistakes committed knowingly or unknowingly."
            ],
            "telugu": [
              "మళ్ళీ ప్రాణాయామం చేయండి. తరువాత, తెలిసి లేదా తెలియక చేసిన ఏవైనా తప్పులకు క్షమాపణ కోసం అగ్నికి మూడు నైవేద్యాలు చేయండి."
            ],
            "hindi": [
              "फिर से प्राणायाम करें। फिर, जाने-अनजाने में हुई किसी भी गलती के लिए क्षमा के लिए अग्नि को तीन आहुतियाँ दें।"
            ]
          },
          "slokas": {
            "english": "anājñātaṃ yadājñātaṃ yajñasya kriyate mithu | agne tadasya kalpaya tvaṃ hi vettha yathātatham | svāhā | agnaya idaṃ na mama ||\npuruṣasaṃmito yajño yajñaḥ puruṣasaṃmitaḥ | agne tadasya kalpaya tvaṃ hi vettha yathātatham | svāhā | agnaya idaṃ na mama ||\nyatpākatrā manasā dīnadakṣā na | yajñasya manvate martāsaḥ | agniṣṭaddhotā kratuvidvijānan | yajiṣṭho devān ṛtuśo yajāti | svāhā | agnaya idaṃ na mama ||",
            "telugu": "అనాజ్ఞాతం యదాజ్ఞాతం యజ్ఞస్య క్రియతే మిథు | అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ | స్వాహా | అగ్నయ ఇదం న మమ ||\nపురుషసంమితో యజ్ఞో యజ్ఞః పురుషసంమితః | అగ్నే తదస్య కల్పయ త్వం హి వేత్థ యథాతథమ్ | స్వాహా | అగ్నయ ఇదం న మమ ||\nయత్పాకత్రా మనసా దీనదక్షా న | యజ్ఞస్య మన్వతే మర్తాసః | అగ్నిష్టద్ధోతా క్రతువిద్విజానన్ | యజిష్ఠో దేవాన్  ऋतुशो యజాతి | స్వాహా | అగ్నయ ఇదం న మమ ||",
            "devanagari": "अनाज्ञातं यदाज्ञातं यज्ञस्य क्रियते मिथु । अग्ने तदस्य कल्पय त्वং हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥\nपुरुषसंमितो यज्ञो यज्ञः पुरुषसंमितः । अग्ने तदस्य कल्पय त्वং हि वेत्थ यथातथम्। स्वाहा। अग्नय इदं न मम ॥\nयत्पाकत्रा मनसा दीनदक्षा न । यज्ञस्य मन्वते मर्तासः। अग्निष्टद्धोता क्रतुविद्विजानन् । यजिष्ठो देवान् ऋतुशो यजाति । स्वाहा। अग्नय इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Make three more offerings to the controllers of the three worlds. Then, make a final comprehensive forgiveness offering for all possible mistakes in mantra, procedure, devotion, materials, etc. Finally, make an offering to Vishnu and an offering to Rudra. Wash your hand after the offering to Rudra."
            ],
            "telugu": [
              "మూడు లోకాల నియంతలకు మరో మూడు నైవేద్యాలు చేయండి. తరువాత, మంత్రం, విధానం, భక్తి, సామగ్రి మొదలైన వాటిలో అన్ని రకాల తప్పులకు చివరి సమగ్ర క్షమాపణ నైవేద్యం చేయండి. చివరగా, విష్ణువుకు మరియు రుద్రునికి నైవేద్యం చేయండి. రుద్రునికి నైవేద్యం చేసిన తరువాత మీ చేతిని కడుక్కోండి."
            ],
            "hindi": [
              "तीन लोकों के नियंत्रकों को तीन और आहुतियाँ दें। फिर, मंत्र, प्रक्रिया, भक्ति, सामग्री आदि में सभी संभावित गलतियों के लिए एक अंतिम व्यापक क्षमा आहुति दें। अंत में, विष्णु को एक आहुति और रुद्र को एक आहुति दें। रुद्र को आहुति देने के बाद अपना हाथ धो लें।"
            ]
          },
          "slokas": {
            "english": "om bhūḥ svāhā | agnaya idaṃ na mama ||\nom bhuvaḥ svāhā | vāyava idaṃ na mama ||\nom suvaḥ svāhā | sūryāyedaṃ na mama ||\nasmin homakarmaṇi madhye saṃbhāvita samasta maṃtralopa taṃtralopa kriyālopa bhaktilopa śraddhālopa niyamalopa niṣṭhālopa dravyalopādi samasta doṣa prāyaścittārthaṃ sarva prāyaścittāhutiṃ hoṣyāmi | om bhūrbhuvassuvaḥ svāhā | prajāpataya idaṃ na mama ||\nom śrī viṣṇave svāhā | viṣṇave paramātmana idaṃ na mama ||\nom namo rudrāya paśupataye svāhā | rudrāya paśupataya idaṃ na mama ||",
            "telugu": "ఓం భూః స్వాహా | అగ్నయ ఇదం న మమ ||\nఓం భువః స్వాహా | వాయవ ఇదం న మమ ||\nఓం సువః స్వాహా | సూర్యాయేదం న మమ ||\nఅస్మిన్ హోమకర్మణి మధ్యే సంభාවිත సమస్త మంత్రలోప తంత్రలోప క్రియాలోప భక్తిలోప శ్రద్ధాలోప నియమలోప నిష్ఠాలోప ద్రవ్యలోపాది సమస్త దోష ప్రాయశ్చిత్తార్థం సర్వ ప్రాయశ్చిత్తాహుతిం హోష్యామి | ఓం భూర్భువస్సువః స్వాహా | ప్రజాపతయ ఇదం న మమ ||\nఓం శ్రీ విష్ణవే స్వాహా | విష్ణవే పరమాత్మన ఇదం న మమ ||\nఓం నమో రుద్రాయ పశుపతయే స్వాహా | రుద్రాయ పశుపతయ ఇదం న మమ ||",
            "devanagari": "ॐ भूः स्वाहा। अग्नय इदं न मम ॥\nॐ भुवः स्वाहा । वायव इदं न मम ॥\nॐ सुवः स्वाहा। सूर्यायदं न मम ॥\nअस्मिन् होमकर्मणि मध्ये संभावित समस्त मंत्रलोप तंत्रलोप क्रियालोप भक्तिलोप श्रद्धालोप नियमलोप निष्ठालोप द्रव्यलोपादि समस्त दोष प्रायश्चित्तार्थं सर्व प्रायश्चित्ताहुतिं होष्यामि। ॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥\nॐ श्री विष्णवे स्वाहा। विष्णवे परमात्मन इदं न मम ॥\nॐ नमो रुद्राय पशुपतये स्वाहा। रुद्राय पशुपतय इदं न मम ॥"
          }
        }
      ]
    },
    {
      "id": 18,
      "title": {
        "english": "Uttaraangam - shorter version",
        "telugu": "ఉత్తరాంగం - సంక్షిప్త రూపం",
        "devanagari": "उत्तराङ्गम् - संक्षिप्त संस्करण"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "When in a hurry, you can perform a brief Uttaraangam by making these six offerings of ghee."
            ],
            "telugu": [
              "తొందరలో ఉన్నప్పుడు, మీరు ఈ ఆరు నెయ్యి నైవేద్యాలు చేసి సంక్షిప్త ఉత్తరాంగం చేయవచ్చు."
            ],
            "hindi": [
              "जल्दी में होने पर, आप घी की इन छह आहुतियों को देकर एक संक्षिप्त उत्तरांग कर सकते हैं।"
            ]
          },
          "slokas": {
            "english": "om bhūḥ svāhā | agnaya idaṃ na mama ||\nom bhuvaḥ svāhā | vāyava idaṃ na mama ||\nom suvaḥ svāhā | sūryāyedaṃ na mama ||\nom bhūrbhuvassuvaḥ svāhā | prajāpataya idaṃ na mama ||\nom śrī viṣṇave svāhā | viṣṇave paramātmana idaṃ na mama ||\nom namo rudrāya paśupataye svāhā | rudrāya paśupataya idaṃ na mama ||",
            "telugu": "ఓం భూః స్వాహా | అగ్నయ ఇదం న మమ ||\nఓం భువః స్వాహా | వాయవ ఇదం న మమ ||\nఓం సువః స్వాహా | సూర్యాయేదం న మమ ||\nఓం భూర్భువస్సువః స్వాహా | ప్రజాపతయ ఇదం న మమ ||\nఓం శ్రీ విష్ణవే స్వాహా | విష్ణవే పరమాత్మన ఇదం న మమ ||\nఓం నమో రుద్రాయ పశుపతయే స్వాహా | రుద్రాయ పశుపతయ ఇదం న మమ ||",
            "devanagari": "ॐ भूः स्वाहा। अग्नय इदं न मम ॥\nॐ भुवः स्वाहा। वायव इदं न मम ॥\nॐ सुवः स्वाहा। सूर्यायेदं न मम ॥\nॐ भूर्भुवस्सुवः स्वाहा। प्रजापतय इदं न मम ॥\nॐ श्री विष्णवे स्वाहा। विष्णवे परमात्मन इदं न मम ॥\nॐ नमो रुद्राय द्राय पशुपतये स्वाहा। रुद्राय पशुपतय इदं न मम ॥"
          }
        }
      ]
    },
    {
      "id": 19,
      "title": {
        "english": "Suddhaanna Bali",
        "telugu": "శుద్ధాన్న బలి",
        "devanagari": "शुद्धान्न बलि"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Offer a sacrifice (bali) to other associated beings. Place a small amount of cooked white rice or fruit slices in six different places outside the homa kundam as shown in the diagram, while reciting the following mantra."
            ],
            "telugu": [
              "ఇతర సంబంధిత జీవులకు బలి సమర్పించండి. చిత్రంలో చూపిన విధంగా హోమ కుండం వెలుపల ఆరు వేర్వేరు ప్రదేశాలలో కొద్దిగా వండిన తెల్ల అన్నం లేదా పండ్ల ముక్కలను ఉంచి, ఈ క్రింది మంత్రాన్ని పఠించండి."
            ],
            "hindi": [
              "अन्य संबद्ध प्राणियों को बलि (बलिदान) दें। पका हुआ सफेद चावल या फलों के टुकड़े थोड़ी मात्रा में होम कुंड के बाहर छह अलग-अलग स्थानों पर रखें, जैसा कि चित्र में दिखाया गया है, और निम्नलिखित मंत्र का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "om pārṣadebhyo namaḥ | baliṃ samarpayāmi |",
            "telugu": "ఓం పార్షదేభ్యో నమః | బలిం సమర్పయామి |",
            "devanagari": "ॐ पार्षदेभ्यो नमः। बलिं समर्पयामि ।"
          },
          "diagram_placeholder": "Figure 3: Placement of bali offerings."
        }
      ]
    },
    {
      "id": 20,
      "title": {
        "english": "Vasordhaaraa",
        "telugu": "వసోర్ధారా",
        "devanagari": "वसोर्धारा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Pour a slow, continuous stream of ghee into the fire. This stream should be just enough to make the fire burn brightly for the upcoming Poornaahuti. As you pour, recite the third verse from 'Rudra Chamakam' given below."
            ],
            "telugu": [
              "అగ్నిలో నెమ్మదిగా, నిరంతరంగా నెయ్యి ధారను పోయండి. ఈ ధార రాబోయే పూర్ణాహుతి కోసం అగ్నిని ప్రకాశవంతంగా మండించడానికి సరిపోయేంతగా ఉండాలి. పోసేటప్పుడు, క్రింద ఇవ్వబడిన 'రుద్ర చమకం' నుండి మూడవ శ్లోకాన్ని పఠించండి."
            ],
            "hindi": [
              "आग में घी की धीमी, निरंतर धारा डालें। यह धारा आगामी पूर्णाहुति के लिए आग को उज्ज्वल रूप से जलाने के लिए पर्याप्त होनी चाहिए। डालते समय, नीचे दिए गए 'रुद्र चमकम्' से तीसरे श्लोक का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "om śaṃ ca me mayaśca me priyaṃ ca me'nukāmaśca me kāmaśca me saumanasaśca me bhadraṃ ca me śreyaśca me vasyaśca me yaśaśca me bhagaśca me draviṇaṃ ca me yantā ca me dhartā ca me kṣemaśca me dhṛtiśca me viśvaṃ ca me mahaśca me saṃvicca me jñātraṃ ca me sūśca me prasūśca me sīraṃ ca me layaśca maṛtaṃ ca me'mṛtaṃ ca me'yakṣmaṃ ca me'nāmayacca me jīvātuśca me dīrghāyutvaṃ ca me'namitraṃ ca me'bhayaṃ ca me sugaṃ ca me śayanaṃ ca me sūṣā ca me sudinaṃ ca me ||",
            "telugu": "ఓం శం చ మే మయశ్చ మే ప్రియం చ మేऽనుకామశ్చ మే కామశ్చ మే సౌమనసశ్చ మే భద్రం చ మే శ్రేయశ్చ మే వస్యశ్చ మే యశశ్చ మే భగశ్చ మే ద్రవిణం చ మే యంతా చ మే ధర్తా చ మే క్షేమశ్చ మే ధృతిశ్చ మే విశ్వం చ మే మహశ్చ మే సంవిచ్చ మే జ్ఞాత్రం చ మే సూశ్చ మే ప్రసూశ్చ మే సీరం చ మే లయశ్చ మఋతం చ మేऽమృతం చ మేऽయక్ష్మం చ మేऽనామయచ్చ మే జీవాతుశ్చ మే దీర్ఘాయుత్వం చ మేऽనమిత్రం చ మేऽభయం చ మే సుగం చ మే శయనం చ మే సూషా చ మే సుదినం చ మే ||",
            "devanagari": "ॐ शं च मे मयश्च मे प्रियं च मेऽनुकामश्च मे कामश्च मे सौमनसश्च मे भद्रं च मे श्रेयश्च मे वस्यश्च मे यशश्च मे भगश्च मे द्रविणं च मे यन्ता च मे धर्ता च मे क्षेमश्च मे धृतिश्च मे विश्वं च मे महश्च मे संविच्च मे ज्ञात्रं च मे सूश्च मे प्रसूश्च मे सीरं च मे लयश्च मऋतं च मेऽमृतं च मेऽयक्ष्मं च मेऽनामयच्च मे जीवातुश्च मे दीर्घायुत्वं च मेऽनमित्रं च मेऽभयं च मे सुगं च मे शयनं च मे सूषा च मे सुदिनं च मे ॥"
          }
        }
      ]
    },
    {
      "id": 21,
      "title": {
        "english": "Poornaahuti",
        "telugu": "పూర్ణాహుతి",
        "devanagari": "पूर्णाहुति"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Prepare the 'complete offering' (Poornaahuti). For a simple homam, this can be a dry coconut half filled with a coin, akshatas, and samples of offering materials. Place this in the fire while reciting the following mantras. This act symbolizes the complete surrender of one's ego."
            ],
            "telugu": [
              "'పూర్ణాహుతి'ని సిద్ధం చేసుకోండి. ఒక సాధారణ హోమం కోసం, ఇది ఒక నాణెం, అక్షతలు మరియు నైవేద్య సామగ్రి నమూనాలతో నింపిన ఎండు కొబ్బరి చిప్ప కావచ్చు. ఈ క్రింది మంత్రాలను పఠిస్తూ దీనిని అగ్నిలో ఉంచండి. ఈ చర్య ఒకరి అహంకారం యొక్క పూర్తి సమర్పణను సూచిస్తుంది."
            ],
            "hindi": [
              "'पूर्ण आहुति' तैयार करें। एक साधारण होम के लिए, यह एक सूखा नारियल का आधा हिस्सा हो सकता है जिसमें एक सिक्का, अक्षत और आहुति सामग्री के नमूने हों। निम्नलिखित मंत्रों का पाठ करते हुए इसे अग्नि में रखें। यह क्रिया किसी के अहंकार के पूर्ण समर्पण का प्रतीक है।"
            ]
          },
          "slokas": {
            "english": "om pūrṇāhutimuttamāṃ juhoti | sarvaṃ vai pūrṇāhutiḥ | sarvamevāpnoti | atho iyaṃ vai pūrṇāhutiḥ | asyāmeva pratitiṣṭhati ||\nom pūrṇamadaḥ pūrṇamidaṃ pūrṇātpūrṇamudacyate | pūrṇasya pūrṇamādāya pūrṇamevāvaśiṣyate ||\nom kāla bhairavāya namaḥ | pūrṇāhutiṃ samarpayāmi ||",
            "telugu": "ఓం పూర్ణాహుతిముత్తమాం జుహోతి | సర్వం వై పూర్ణాహుతిః | సర్వమేవాప్నోతి | అథో ఇయం వై పూర్ణాహుతిః | అస్యామేవ ప్రతితిష్ఠతి ||\nఓం పూర్ణమదః పూర్ణమిదం పూర్ణాత్పూర్ణముదచ్యతే | పూర్ణస్య పూర్ణమాదాయ పూర్ణమేవావశిష్యతే ||\nఓం కాల భైరవాయ నమః | పూర్ణాహుతిం సమర్పయామి ||",
            "devanagari": "ॐ पूर्णाहुतिमुत्तमां जुहोति । सर्वं वै पूर्णाहुतिः । सर्वमेवाप्नोति । अथो इयं वै पूर्णाहुतिः । अस्यामेव प्रतितिष्ठति ।\nॐ पूर्णमदः पूर्णमिदं पूर्णात्पूर्णमुदच्यते । पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते ॥\nॐ काल भैरवाय नमः। पूर्णाहुतिं समर्पयामि ।"
          }
        },
        {
          "instructions": {
            "english": [
              "While or after placing the poornaahuti in the fire, chant the following mantra, contemplating that the act, the offering, the fire, and the offerer are all Brahman (the Supreme Being)."
            ],
            "telugu": [
              "పూర్ణాహుతిని అగ్నిలో ఉంచేటప్పుడు లేదా తరువాత, ఈ క్రింది మంత్రాన్ని జపించండి, చర్య, నైవేద్యం, అగ్ని మరియు సమర్పించేవాడు అన్నీ బ్రహ్మమే (పరమాత్మ) అని భావించండి."
            ],
            "hindi": [
              "पूर्णाहुति को अग्नि में रखते समय या उसके बाद, निम्नलिखित मंत्र का जाप करें, यह विचार करते हुए कि कर्म, आहुति, अग्नि और आहुति देने वाला सभी ब्रह्म (परमात्मा) हैं।"
            ]
          },
          "slokas": {
            "english": "om brahmārpaṇaṃ brahmahavir brahmāgnau brahmaṇā hutaṃ | brahmaiva tena gantavyaṃ brahma karma samādhinā ||",
            "telugu": "ఓం బ్రహ్మార్పణం బ్రహ్మహవిర్ బ్రహ్మాగ్నౌ బ్రహ్మణా హుతం | బ్రహ్మైవ తేన గంతవ్యం బ్రహ్మ కర్మ సమాధినా ||",
            "devanagari": "ॐ ब्रह्मार्पणं ब्रह्महविर् ब्रह्माग्नौ ब्रह्मणा हुतं । ब्रह्मैव तेन गन्तव्यं ब्रह्म कर्म समाधिना ॥"
          }
        }
      ]
    },
    {
      "id": 22,
      "title": {
        "english": "Winding Up and Meditation",
        "telugu": "ముగింపు మరియు ధ్యానం",
        "devanagari": "समापन और ध्यान"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Make a final offering of ghee to Agni with the following mantra."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రంతో అగ్నికి చివరిగా నెయ్యి సమర్పించండి."
            ],
            "hindi": [
              "निम्नलिखित मंत्र के साथ अग्नि को घी की अंतिम आहुति दें।"
            ]
          },
          "slokas": {
            "english": "sapta te agne samidhaḥ saptajihvāḥ sapta ṛṣayassaptaḥ dhāma priyāṇi | sapta hotrā sapta dhātvā yajantisaptayonīrāpṛṇasvā ghṛtena svāhā | agnaye saptavata idaṃ na mama ||",
            "telugu": "సప్త తే అగ్నే సమిధః సప్తజిహ్వాః సప్త ఋషయస్సప్తః ధామ ప్రియాణి | సప్త హోత్రా సప్త ధాత్వా యజంతిసప్తయోనీరాపృణస్వా ఘృతేన స్వాహా | అగ్నయే సప్తవత ఇదం న మమ ||",
            "devanagari": "सप्त ते अग्ने समिधः सप्तजिह्वाः सप्त ऋषयस्सप्तः धाम प्रियाणि। सप्त होत्रा सप्त धात्वा यजन्तिसप्तयोनीरापृणस्वा घृतेन स्वाहा। अग्नये सप्तवत इदं न मम ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Sprinkle water around the homa kundam as you did at the beginning, but using the following new set of mantras.",
              "As the poornaahuti burns, sit still with a straight back and meditate for at least 5-10 minutes. This is a very potent time for meditation."
            ],
            "telugu": [
              "ప్రారంభంలో చేసిన విధంగా హోమ కుండం చుట్టూ నీటిని చల్లండి, కానీ ఈ క్రింది కొత్త మంత్రాలను ఉపయోగించండి.",
              "పూర్ణాహుతి మండుతున్నప్పుడు, నిటారుగా కూర్చుని కనీసం 5-10 నిమిషాలు ధ్యానం చేయండి. ఇది ధ్యానానికి చాలా శక్తివంతమైన సమయం."
            ],
            "hindi": [
              "होम कुंड के चारों ओर पानी छिड़कें जैसा कि आपने शुरुआत में किया था, लेकिन निम्नलिखित नए मंत्रों का उपयोग करते हुए।",
              "जैसे ही पूर्णाहुति जलती है, सीधी पीठ के साथ स्थिर बैठें और कम से-कम 5-10 मिनट तक ध्यान करें। यह ध्यान के लिए एक बहुत ही शक्तिशाली समय है।"
            ]
          },
          "slokas": {
            "english": "adite'nvamaṃsthāḥ | anumate'nvamaṃsthāḥ | sarasvate'nvamaṃsthāḥ | deva savitaḥ prāsāvīḥ |",
            "telugu": "అదితేऽన్వమంస్థాః | అనుమతేऽన్వమంస్థాః | సరస్వతేऽన్వమంస్థాః | దేవ సవితః ప్రాసావీః |",
            "devanagari": "अदितेऽन्वमंस्थाः । अनुमतेऽन्वमंस्थाः। सरस्वतेऽन्वमंस्थाः । देव सवितः प्रासावीः ।"
          }
        }
      ]
    },
    {
      "id": 23,
      "title": {
        "english": "Rakshaa",
        "telugu": "రక్ష",
        "devanagari": "रक्षा"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Create 'rakshaa' (protective ash) by taking the darbhas placed on the western side of the kundam, applying ghee to their tips, and burning them in a separate container. The resulting black ash can be applied to the forehead for protection."
            ],
            "telugu": [
              "కుండం యొక్క పశ్చిమ వైపున ఉంచిన దర్భలను తీసుకుని, వాటి చివర్లకు నెయ్యి రాసి, వేరే పాత్రలో కాల్చడం ద్వారా 'రక్ష' (రక్షణ బూడిద)ను సృష్టించండి. ఫలితంగా వచ్చే నల్ల బూడిదను రక్షణ కోసం నుదుటిపై పూయవచ్చు."
            ],
            "hindi": [
              "कुंड के पश्चिमी तरफ रखे गए कुश को लेकर, उनके सिरों पर घी लगाकर, और उन्हें एक अलग पात्र में जलाकर 'रक्षा' (सुरक्षात्मक राख) बनाएं। परिणामी काली राख को सुरक्षा के लिए माथे पर लगाया जा सकता है।"
            ]
          }
        }
      ]
    },
    {
      "id": 24,
      "title": {
        "english": "Udvaasana",
        "telugu": "ఉద్వాసన",
        "devanagari": "उद्वासन"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Transfer the energy from the fire back into your heart. First, say goodbye to Mahaganapathi, imagining him returning to your heart.",
              "Then, say goodbye to Kaala Bhairava, imagining him exiting the fire and idol and returning to your heart.",
              "Finally, bid farewell to Agni, the fire god, with the last mantra."
            ],
            "telugu": [
              "అగ్ని నుండి శక్తిని మీ హృదయంలోకి తిరిగి బదిలీ చేయండి. మొదట, మహాగణపతికి వీడ్కోలు చెప్పండి, ఆయన మీ హృదయంలోకి తిరిగి వస్తున్నట్లు ఊహించుకోండి.",
              "తరువాత, కాల భైరవునికి వీడ్కోలు చెప్పండి, ఆయన అగ్ని మరియు విగ్రహం నుండి నిష్క్రమించి మీ హృదయంలోకి తిరిగి వస్తున్నట్లు ఊహించుకోండి.",
              "చివరగా, చివరి మంత్రంతో అగ్ని దేవుడికి వీడ్కోలు చెప్పండి."
            ],
            "hindi": [
              "अग्नि से ऊर्जा को वापस अपने हृदय में स्थानांतरित करें। सबसे पहले, महागणपति को विदाई दें, कल्पना करें कि वे आपके हृदय में लौट रहे हैं।",
              "फिर, काल भैरव को विदाई दें, कल्पना करें कि वे अग्नि और मूर्ति से निकलकर आपके हृदय में लौट रहे हैं।",
              "अंत में, अंतिम मंत्र के साथ अग्नि देव को विदाई दें।"
            ]
          },
          "slokas": {
            "english": "asmādagneḥ śrīmahāgaṇapatiṃ yathāsthānaṃ pratiṣṭhāpayāmi ||\nasmānmūrteśca agneśca kāla bhairavaṃ yathāsthānaṃ pratiṣṭhāpayāmi ||\nagne naya supathā rāye asmān viśvāni deva vayunāni vidvān | yuyodhyasmajjuhurāṇameno bhūyiṣṭhāṃ te nama uktiṃ vidhema | agnaye namaḥ ||",
            "telugu": "అస్మాదగ్నేః శ్రీమహాగణపతిం యథాస్థానం ప్రతిష్ఠాపయామి ||\nఅస్మాన్మూర్తేశ్చ అగ్నేశ్చ కాల భైరవం యథాస్థానం ప్రతిష్ఠాపయామి ||\nఅగ్నే నయ సుపథా రాయే అస్మాన్ విశ్వాని దేవ వయునాని విద్వాన్ | యుయోధ్యస్మజ్జుహురాణమేనో భూయిష్ఠాం తే నమ ఉక్తిం విధేమ | అగ్నయే నమః ||",
            "devanagari": "अस्मादग्नेः श्रीमहागणपतिं यथास्थानं प्रतिष्ठापयामि ।\nअस्मान्मूर्तेश्च अग्नेश्च काल भैरवं यथास्थानं प्रतिष्ठापयामि ।\nअग्ने नय सुपथा राये अस्मान् विश्वानि देव वयुनानि विद्वान् । युयोध्यस्मज्जुहुराणमेनो भूयिष्ठां ते नम उक्तिं विधेम । अग्नये नमः ॥"
          }
        }
      ]
    },
    {
      "id": 25,
      "title": {
        "english": "Conclusion",
        "telugu": "ముగింపు",
        "devanagari": "निष्कर्ष"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Recite the following verses to ask for forgiveness for any deficiencies in the ritual and to surrender the entire act and its fruits to the Supreme Being (Narayana/Krishna)."
            ],
            "telugu": [
              "క్రతువులో ఏవైనా లోపాలకు క్షమాపణ కోరడానికి మరియు మొత్తం చర్యను మరియు దాని ఫలాలను పరమాత్మకు (నారాయణ/కృష్ణ) సమర్పించడానికి ఈ క్రింది శ్లోకాలను పఠించండి."
            ],
            "hindi": [
              "अनुष्ठान में किसी भी कमी के लिए क्षमा मांगने और पूरे कार्य और उसके फलों को परमात्मा (नारायण/कृष्ण) को समर्पित करने के लिए निम्नलिखित श्लोकों का पाठ करें।"
            ]
          },
          "slokas": {
            "english": "maṃtrahīnaṃ kriyāhīnaṃ bhaktihīnaṃ hutāśana | yadbhutaṃ tu mayā deva paripūrṇa tadastu te ||\nprāyaścittānyaśeṣāṇi tapaḥ karmātmakāni vai | yāni teṣāmaśeṣāṇāṃ śrī kṛṣṇasmaraṇaṃ paraṃ || śrī kṛṣṇa kṛṣṇa kṛṣṇa ||\nkāyena vācā manasendriyairvā buddhyātmanā vā prakṛteḥ svabhāvāt | karomi yadyat sakalaṃ parasmai nārāyaṇāyeti samarpayāmi ||",
            "telugu": "మంత్రహీనం క్రియాహీనం భక్తిహీనం హుతాశన | యద్భుతం తు మయా దేవ పరిపూర్ణ తదస్తు తే ||\nప్రాయశ్చిత్తాన్యశేషాణి తపః కర్మాత్మకాని వై | యాని తేషామశేషాణాం శ్రీ కృష్ణస్మరణం పరం || శ్రీ కృష్ణ కృష్ణ కృష్ణ ||\nకాయేన వాచా మనసేంద్రియైర్వా బుద్ధ్యాత్మనా వా ప్రకృతేః స్వభావత్ | కరోమి యద్యత్ సకలం పరస్మై నారాయణాయేతి సమర్పయామి ||",
            "devanagari": "मंत्रहीनं क्रियाहीनं भक्तिहीनं हुताशन। यद्भुतं तु मया देव परिपूर्ण तदस्तु ते ॥\nप्रायश्चित्तान्यशेषाणि तपः कर्मात्मकानि वै। यानि तेषामशेषाणां श्री कृष्णस्मरणं परं ॥ श्री कृष्ण कृष्ण कृष्ण ।\nकायेन वाचा मनसेन्द्रियैर्वा बुद्धयात्मना वा प्रकृतेः स्वभावात् । करोमि यद्यत् सकलं परस्मै नारायणायेति समर्पयामि ॥"
          }
        },
        {
          "instructions": {
            "english": [
              "Conclude by stating that the homam was performed for the pleasure of the all-pervading Lord Kaala Bhairava, surrendering everything to Krishna, and chanting for peace."
            ],
            "telugu": [
              "సర్వవ్యాపి అయిన కాల భైరవుని ప్రసన్నం కోసం హోమం చేయబడిందని, సర్వం కృష్ణునికి సమర్పించబడిందని, మరియు శాంతి కోసం జపిస్తూ ముగించండి."
            ],
            "hindi": [
              "यह कहकर समाप्त करें कि होम सर्वव्यापी भगवान काल भैरव की प्रसन्नता के लिए किया गया था, सब कुछ कृष्ण को समर्पित करते हुए, और शांति के लिए जप करते हुए।"
            ]
          },
          "slokas": {
            "english": "anena divya maṃgaḷa homena bhagavān sarvātmakaḥ kāla bhairavaḥ prīyatām | om tatsat | sarvam śrī kṛṣṇārpaṇamastu | om śāntiḥ śāntiḥ śāntiḥ ||",
            "telugu": "అనేన దివ్య మంగళ హోమేన భగవాన్ సర్వాత్మకః కాల భైరవః ప్రీయతామ్ | ఓం తత్సత్ | సర్వం శ్రీ కృష్ణార్పణమస్తు | ఓం శాంతిః శాంతిః శాంతిః ||",
            "devanagari": "अनेन दिव्य मंगळ होमेन भगवान् सर्वात्मकः काल भैरवः प्रीयताम् । ॐ तत्सत्। सर्वम् श्री कृष्णार्पणमस्तु । ॐ शान्तिः शान्तिः शान्तिः ॥"
          }
        }
      ]
    }
  ]
}