{
  "title": {
    "english": "Simple Lalita Homam",
    "telugu": "సరళ లలితా హోమం",
    "hindi": "सरल ललिता होम"
  },
  "author": {
    "english": "P V R Narasimha Rao",
    "telugu": "పి వి ఆర్ నరసింహారావు",
    "hindi": "पी वी आर नरसिम्हा राव"
  },
  "sections": [
    {
      "id": 0,
      "source": "https://vedicastrologer.org/homa/simple/lalita_s_sans-.pdf",
      "title": {
        "english": "Introduction",
        "telugu": "పరిచయం",
        "devanagari": "परिचय"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Lalita literally means the gentle one. She is the mother of three worlds (physical, mental and spiritual).",
              "She gently fulfills all dharmik desires of a devotee. Her homa can be done every day or every Wednesday or every Ashtami/Navami tithi."
            ],
            "telugu": [
              "లలిత అంటే అక్షరాలా సౌమ్యురాలు. ఆమె మూడు లోకాలకు (భౌతిక, మానసిక మరియు ఆధ్యాత్మిక) తల్లి.",
              "ఆమె ఒక భక్తుని యొక్క అన్ని ధార్మిక కోరికలను సున్నితంగా నెరవేరుస్తుంది. ఆమె హోమం ప్రతిరోజూ లేదా ప్రతి బుధవారం లేదా ప్రతి అష్టమి/నవమి తిథి నాడు చేయవచ్చు."
            ],
            "hindi": [
              "ललिता का शाब्दिक अर्थ है कोमल। वह तीन लोकों (भौतिक, मानसिक और आध्यात्मिक) की माता हैं।",
              "वह एक भक्त की सभी धार्मिक इच्छाओं को धीरे-धीरे पूरा करती हैं। उनका होम हर दिन या हर बुधवार या हर अष्टमी/नवमी तिथि को किया जा सकता है।"
            ]
          },
          "slokas": {
            "english": "om śrī mahāgaṇapataye namaḥ | om śrī gurubhyo namaḥ | om ṛṣibhyo namaḥ |",
            "telugu": "ఓం శ్రీ మహాగణపతయే నమః | ఓం శ్రీ గురుభ్యో నమః | ఓం ఋషిభ్యో నమః |",
            "devanagari": "ॐ श्री महागणपतये नमः । ॐ श्री गुरुभ्यो नमः । ॐ ऋषिभ्यो नमः ।"
          }
        }
      ]
    },
    {
      "id": 1,
      "title": {
        "english": "Preparation",
        "telugu": "సిద్ధత",
        "devanagari": "तैयारी"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Find a standard homa kunda or simply a small vessel/utensil made of copper/silver/bronze/steel, in a square/circular/rectangular shape. Clean it thoroughly, dry it and use it.",
              "Find some ghee (clarified butter). If not available, use sesame oil or some other oil. Find a copper/silver/steel cup/tumbler/vessel to keep melted ghee and a spoon for offering it.",
              "Find another tumbler and spoon for water. Keep a matchbox and camphor (if available) ready.",
              "If possible, get some dry coconut (copra) halves and make small pieces (roughly 1 inch x 1 inch). If not, collect some fallen dry twigs from nearby trees (or other firewood). Dried cowdung pieces can also be used.",
              "If you have black/brown/white sesame seeds and any unsalted plain nuts (e.g. cashews, almonds etc), you can use them too."
            ],
            "telugu": [
              "ఒక ప్రామాణిక హోమ కుండం లేదా కేవలం రాగి/వెండి/కంచు/ఉక్కుతో చేసిన ఒక చిన్న పాత్ర/పాత్రను చతురస్రం/వృత్తాకారం/దీర్ఘచతురస్రాకారంలో తీసుకోండి. దానిని పూర్తిగా శుభ్రపరిచి, ఆరబెట్టి ఉపయోగించండి.",
              "కొంత నెయ్యి (శుద్ధి చేసిన వెన్న) తీసుకోండి. అందుబాటులో లేకపోతే, నువ్వుల నూనె లేదా మరేదైనా నూనెను వాడండి. కరిగిన నెయ్యిని ఉంచడానికి ఒక రాగి/వెండి/ఉక్కు కప్పు/గ్లాసు/పాత్రను మరియు దానిని సమర్పించడానికి ఒక చెంచాను తీసుకోండి.",
              "నీటి కోసం మరొక గ్లాసు మరియు చెంచాను తీసుకోండి. అగ్గిపెట్టె మరియు కర్పూరం (అందుబాటులో ఉంటే) సిద్ధంగా ఉంచుకోండి.",
              "వీలైతే, కొన్ని ఎండిన కొబ్బరి (కొబ్బరి) చిప్పలను తీసుకుని చిన్న ముక్కలుగా (సుమారు 1 అంగుళం x 1 అంగుళం) చేయండి. లేకపోతే, సమీపంలోని చెట్ల నుండి రాలిన కొన్ని ఎండిన కొమ్మలను (లేదా ఇతర కట్టెలను) సేకరించండి. ఎండిన ఆవు పేడ ముక్కలను కూడా ఉపయోగించవచ్చు.",
              "మీ దగ్గర నలుపు/గోధుమ/తెల్ల నువ్వులు మరియు ఉప్పులేని సాదా గింజలు (ఉదా. జీడిపప్పు, బాదం మొదలైనవి) ఉంటే, వాటిని కూడా ఉపయోగించవచ్చు."
            ],
            "hindi": [
              "एक मानक होम कुंड या तांबे/चांदी/कांस्य/स्टील से बना एक छोटा बर्तन/बर्तन, चौकोर/वृत्ताकार/आयताकार आकार में खोजें। इसे अच्छी तरह साफ करें, सुखाएं और इस्तेमाल करें।",
              "थोड़ा घी (स्पष्ट मक्खन) लें। यदि उपलब्ध न हो तो तिल का तेल या कोई अन्य तेल प्रयोग करें। पिघला हुआ घी रखने के लिए एक तांबे/चांदी/स्टील का कप/गिलास/बर्तन और इसे चढ़ाने के लिए एक चम्मच खोजें।",
              "पानी के लिए एक और गिलास और चम्मच लें। एक माचिस और कपूर (यदि उपलब्ध हो) तैयार रखें।",
              "यदि संभव हो, तो कुछ सूखे नारियल (खोपरा) के आधे हिस्से लें और छोटे टुकड़े (लगभग 1 इंच x 1 इंच) बना लें। यदि नहीं, तो आस-पास के पेड़ों से कुछ गिरी हुई सूखी टहनियाँ (या अन्य जलाऊ लकड़ी) इकट्ठा करें। सूखे गोबर के टुकड़ों का भी उपयोग किया जा सकता है।",
              "यदि आपके पास काले/भूरे/सफेद तिल और कोई भी बिना नमक वाले सादे मेवे (जैसे काजू, बादाम आदि) हैं, तो आप उनका भी उपयोग कर सकते हैं।"
            ]
          }
        }
      ]
    },
    {
      "id": 2,
      "title": {
        "english": "Some Precautions",
        "telugu": "కొన్ని జాగ్రత్తలు",
        "devanagari": "कुछ सावधानियां"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Do NOT consume meat or alcohol or drugs on the previous day.",
              "Sleep well and get up early on the day of homa.",
              "Take bath and wear clean clothes that you feel comfortable in. Being in a calm state of mind is more important than externalities.",
              "If possible, it is ideal to do homa in an open space outdoors.",
              "When doing in a closed room, one should have enough ventilation to avoid accumulation of smoke. One should also take precautions and avoid fire hazards like inflammable substances near the homa."
            ],
            "telugu": [
              "ముందు రోజు మాంసం, మద్యం లేదా మాదకద్రవ్యాలు సేవించవద్దు.",
              "హోమం రోజున బాగా నిద్రపోయి, తొందరగా లేవండి.",
              "స్నానం చేసి, మీకు సౌకర్యవంతంగా ఉండే శుభ్రమైన బట్టలు ధరించండి. బాహ్య విషయాల కంటే ప్రశాంతమైన మానసిక స్థితిలో ఉండటం ముఖ్యం.",
              "వీలైతే, ఆరుబయట బహిరంగ ప్రదేశంలో హోమం చేయడం ఉత్తమం.",
              "ఒక మూసి ఉన్న గదిలో చేస్తున్నప్పుడు, పొగ పేరుకుపోకుండా తగినంత వెంటిలేషన్ ఉండాలి. హోమం దగ్గర మండే పదార్థాల వంటి అగ్ని ప్రమాదాలను నివారించడానికి జాగ్రత్తలు తీసుకోవాలి."
            ],
            "hindi": [
              "पिछले दिन मांस, शराब या नशीली दवाओं का सेवन न करें।",
              "अच्छी तरह सोएं और होम के दिन जल्दी उठें।",
              "स्नान करें और साफ कपड़े पहनें जिसमें आप सहज महसूस करें। बाहरी चीजों से ज्यादा मन की शांत अवस्था में रहना महत्वपूर्ण है।",
              "यदि संभव हो, तो खुले स्थान पर होम करना आदर्श है।",
              "एक बंद कमरे में करते समय, धुएं के संचय से बचने के लिए पर्याप्त वेंटिलेशन होना चाहिए। किसी को सावधानियां भी बरतनी चाहिए और होम के पास ज्वलनशील पदार्थों जैसे आग के खतरों से बचना चाहिए।"
            ]
          }
        }
      ]
    },
    {
      "id": 3,
      "title": {
        "english": "Procedure: Pre-Fire Stage",
        "telugu": "ప్రక్రియ: అగ్ని-పూర్వ దశ",
        "devanagari": "प्रक्रिया: अग्नि-पूर्व चरण"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Sit down facing east and place the homa kunda in front of you. Think of Mother Earth with gratitude for bearing your weight.",
              "Clean your palm, pour some water in your palm 3 times and drink it after saying the following:"
            ],
            "telugu": [
              "తూర్పు ముఖంగా కూర్చుని, హోమ కుండాన్ని మీ ముందు ఉంచుకోండి. మీ భారాన్ని మోస్తున్నందుకు భూమాతకు కృతజ్ఞతలు తెలుపుకోండి.",
              "మీ అరచేతిని శుభ్రం చేసుకోండి, మీ అరచేతిలో 3 సార్లు నీరు పోసి, ఈ క్రింది వాటిని చెప్పిన తర్వాత త్రాగండి:"
            ],
            "hindi": [
              "पूर्व की ओर मुंह करके बैठ जाएं और होम कुंड को अपने सामने रखें। आपका भार वहन करने के लिए पृथ्वी माता का कृतज्ञता से ध्यान करें।",
              "अपनी हथेली साफ करें, अपनी हथेली में 3 बार थोड़ा पानी डालें और निम्नलिखित कहने के बाद उसे पी लें:"
            ]
          },
          "slokas": {
            "english": "(1) om keśavāya svāhā\n(2) om nārāyaṇāya svāhā\n(3) om mādhavāya svāhā",
            "telugu": "(౧) ఓం కేశవాయ స్వాహా\n(౨) ఓం నారాయణాయ స్వాహా\n(౩) ఓం మాధవాయ స్వాహా",
            "devanagari": "(१) ॐ केशवाय स्वाहा\n(२) ॐ नारायणाय स्वाहा\n(३) ॐ माधवाय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Light a lamp and think of fire in it with gratitude.",
              "While saying any mantra you like (or just remaining silent), breathe in and out calmly while focusing the mind on your breath. You can either do alternate nostril breathing or normal breathing. Stop when your mind is calm."
            ],
            "telugu": [
              "దీపం వెలిగించి, అందులోని అగ్నిని కృతజ్ఞతతో స్మరించుకోండి.",
              "మీకు నచ్చిన ఏదైనా మంత్రాన్ని జపిస్తూ (లేదా నిశ్శబ్దంగా ఉంటూ), మీ శ్వాసపై మనస్సును కేంద్రీకరించి ప్రశాంతంగా శ్వాస పీల్చి వదలండి. మీరు అనులోమ విలోమ ప్రాణాయామం లేదా సాధారణ శ్వాస చేయవచ్చు. మీ మనస్సు ప్రశాంతంగా మారినప్పుడు ఆపండి."
            ],
            "hindi": [
              "एक दीपक जलाएं और उसमें अग्नि का कृतज्ञता से ध्यान करें।",
              "अपनी पसंद का कोई भी मंत्र कहते हुए (या सिर्फ चुप रहते हुए), अपने मन को अपनी सांस पर केंद्रित करते हुए शांति से सांस अंदर और बाहर लें। आप या तो वैकल्पिक नासिका श्वास या सामान्य श्वास कर सकते हैं। जब आपका मन शांत हो जाए तो रुक जाएं।"
            ]
          }
        },
        {
          "instructions": {
            "english": [
              "Place some water in your right palm. If you are not comfortable with Sanskrit, say this:",
              "'For the establishment of Dharma on earth and for the well-being and peace of all people, I shall do a Lalita Homa within my abilities.'",
              "If you are comfortable with Sanskrit, say this:"
            ],
            "telugu": [
              "మీ కుడి అరచేతిలో కొంచెం నీరు ఉంచండి. మీకు సంస్కృతం సౌకర్యంగా లేకపోతే, ఇలా చెప్పండి:",
              "'భూమిపై ధర్మ స్థాపన కోసం మరియు ప్రజలందరి శ్రేయస్సు మరియు శాంతి కోసం, నా శక్తి మేరకు నేను లలితా హోమం చేస్తాను.'",
              "మీకు సంస్కృతం సౌకర్యంగా ఉంటే, ఇలా చెప్పండి:"
            ],
            "hindi": [
              "अपनी दाहिनी हथेली में थोड़ा पानी रखें। यदि आप संस्कृत में सहज नहीं हैं, तो यह कहें:",
              "'पृथ्वी पर धर्म की स्थापना के लिए और सभी लोगों की भलाई और शांति के लिए, मैं अपनी क्षमताओं के भीतर एक ललिता होम करूँगा।'",
              "यदि आप संस्कृत में सहज हैं, तो यह कहें:"
            ]
          },
          "slokas": {
            "english": "bhūloke dharma sthāpanārthaṃ sarveṣāṃ janānāṃ sukha śānti siddhyarthaṃ lalitā tripura sundarī homakarma yathāśakti kariṣye",
            "telugu": "భూలోకే ధర్మ స్థాపనార్థం సర్వేషాం జనానాం సుఖ శాంతి సిద్ధ్యర్థం లలితా త్రిపుర సుందరీ హోమకర్మ యథాశక్తి కరిష్యే",
            "devanagari": "भूलोके धर्म स्थापनार्थं सर्वेषां जनानां सुख शान्ति सिद्ध्यर्थं ललिता त्रिपुर सुन्दरी होमकर्म यथाशक्ति करिष्ये"
          }
        },
        {
          "instructions": {
            "english": [
              "After saying it, drop the water in front of you, over the tips of fingers."
            ],
            "telugu": [
              "అలా చెప్పిన తరువాత, మీ వేళ్ల కొనల మీదుగా నీటిని మీ ముందు వదలండి."
            ],
            "hindi": [
              "यह कहने के बाद, पानी को अपनी उंगलियों के सिरों पर से अपने सामने गिरा दें।"
            ]
          }
        },
        {
          "instructions": {
            "english": [
              "Place a couple of copra pieces (or twigs) in homa kunda and light them with a matchstick (use a camphor for ease if you have), while saying the following and imagining that Holy Fire will cooperate in this ritual:"
            ],
            "telugu": [
              "హోమ కుండంలో రెండు కొబ్బరి ముక్కలు (లేదా కొమ్మలు) ఉంచి, అగ్గిపుల్లతో వెలిగించండి (మీ దగ్గర ఉంటే సులభంగా వెలిగించడానికి కర్పూరం వాడండి), ఈ క్రింది మంత్రాన్ని జపిస్తూ మరియు పవిత్రాగ్ని ఈ ఆచారంలో సహకరిస్తుందని ఊహించుకోండి:"
            ],
            "hindi": [
              "होम कुंड में कुछ खोपरे के टुकड़े (या टहनियाँ) रखें और उन्हें एक माचिस से जलाएं (यदि आपके पास है तो आसानी के लिए कपूर का उपयोग करें), निम्नलिखित कहते हुए और यह कल्पना करते हुए कि पवित्र अग्नि इस अनुष्ठान में सहयोग करेगी:"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvarom",
            "telugu": "ఓం భూర్భువస్సువరోం",
            "devanagari": "ॐ भूर्भुवस्सुवरोम्"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer drops of ghee in fire 8 times while saying this and imagining that fire is becoming holy and stronger:"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపిస్తూ, అగ్ని పవిత్రంగా మరియు బలంగా మారుతోందని ఊహించుకుంటూ అగ్నిలో 8 సార్లు నెయ్యి చుక్కలను సమర్పించండి:"
            ],
            "hindi": [
              "यह कहते हुए आग में 8 बार घी की बूंदें चढ़ाएं और कल्पना करें कि आग पवित्र और मजबूत हो रही है:"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvaḥ svāhā",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा"
          }
        }
      ]
    },
    {
      "id": 4,
      "title": {
        "english": "Procedure: Initial Offerings in Fire",
        "telugu": "ప్రక్రియ: అగ్నిలో ప్రారంభ నైవేద్యాలు",
        "devanagari": "प्रक्रिया: अग्नि में प्रारंभिक आहुतियाँ"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your consciousness to Prajapati, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ చైతన్యాన్ని ప్రజాపతికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपनी चेतना को प्रजापति को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om prajāpataye svāhā",
            "telugu": "ఓం ప్రజాపతయే స్వాహా",
            "devanagari": "ॐ प्रजापतये स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your faculty of inspired perception to Indra, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ ప్రేరిత అవగాహన శక్తిని ఇంద్రునికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपनी प्रेरित धारणा की क्षमता को इंद्र को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om indrāya svāhā",
            "telugu": "ఓం ఇంద్రాయ స్వాహా",
            "devanagari": "ॐ इन्द्राय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your faculty of logical and structured thinking to Agni, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ తార్కిక మరియు నిర్మాణాత్మక ఆలోచనా శక్తిని అగ్నికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपनी तार्किक और संरचित सोच की क्षमता को अग्नि को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om agnaye svāhā",
            "telugu": "ఓం అగ్నయే స్వాహా",
            "devanagari": "ॐ अग्नये स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your faculty of feeling and intuition to Soma, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ భావన మరియు అంతర్ దృష్టి శక్తిని సోమునికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपनी भावना और अंतर्ज्ञान की क्षमता को सोम को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om somāya svāhā",
            "telugu": "ఓం సోమాయ స్వాహా",
            "devanagari": "ॐ सोमाय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your awareness of physical, mental and spiritual realms to Prajapati, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, భౌతిక, మానసిక మరియు ఆధ్యాత్మిక రంగాల మీ అవగాహనను ప్రజాపతికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से भौतिक, मानसिक और आध्यात्मिक क्षेत्रों की अपनी जागरूकता को प्रजापति को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvaḥ svāhā",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your ability to plan and avoid obstacles to Ganesha, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, ప్రణాళిక వేయడానికి మరియు అడ్డంకులను నివారించడానికి మీ సామర్థ్యాన్ని గణేశునికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से योजना बनाने और बाधाओं से बचने की अपनी क्षमता को गणेश को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om gaṃ gaṇapataye namaḥ svāhā",
            "telugu": "ఓం గం గణపతయే నమః స్వాహా",
            "devanagari": "ॐ गं गणपतये नमः स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your ability to persist and overcome problems to Varuna, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, పట్టుదలతో ఉండటానికి మరియు సమస్యలను అధిగమించడానికి మీ సామర్థ్యాన్ని వరుణునికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से दृढ़ रहने और समस्याओं पर काबू पाने की अपनी क्षमता को वरुण को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om vaṃ varuṇāya namaḥ svāhā",
            "telugu": "ఓం వం వరుణాయ నమః స్వాహా",
            "devanagari": "ॐ वं वरुणाय नमः स्वाहा"
          }
        }
      ]
    },
    {
      "id": 5,
      "title": {
        "english": "Procedure: Services to Main Deity",
        "telugu": "ప్రక్రియ: ప్రధాన దేవతకు సేవలు",
        "devanagari": "प्रक्रिया: मुख्य देवता की सेवाएं"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Saying this, imagine that Mother Lalita has entered Holy Fire and is accepting your offerings."
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపిస్తూ, లలితా దేవి పవిత్రాగ్నిలో ప్రవేశించి మీ నైవేద్యాలను స్వీకరిస్తోందని ఊహించుకోండి."
            ],
            "hindi": [
              "यह कहते हुए, कल्पना करें कि माता ललिता ने पवित्र अग्नि में प्रवेश किया है और आपकी भेंट स्वीकार कर रही हैं।"
            ]
          },
          "slokas": {
            "english": "atra āgaccha। āvāhitā bhava।",
            "telugu": "అత్ర ఆగచ్ఛ। ఆవాహితా భవ।",
            "devanagari": "अत्र आगच्छ। आवाहिता भव।"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer sandalwood powder in fire (or a drop of ghee in its absence):"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, అగ్నిలో గంధపు పొడిని (లేదా అది లేనప్పుడు ఒక చుక్క నెయ్యిని) సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और आग में चंदन पाउडर (या उसकी अनुपस्थिति में घी की एक बूंद) चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om laṃ pṛthivyātmikāyai namaḥ",
            "telugu": "ఓం లం పృథివ్యాత్మికాయై నమః",
            "devanagari": "ॐ लं पृथिव्यात्मिकायै नमः"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a flower or dried flower powder (or a drop of ghee in its absence):"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, ఒక పువ్వు లేదా ఎండిన పువ్వుల పొడిని (లేదా అది లేనప్పుడు ఒక చుక్క నెయ్యిని) సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और एक फूल या सूखे फूल का पाउडर (या उसकी अनुपस्थिति में घी की एक बूंद) चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om haṃ ākāśātmikāyai namaḥ",
            "telugu": "ఓం హం ఆకాశాత్మికాయై నమః",
            "devanagari": "ॐ हं आकाशात्मिकायै नमः"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this, light an incense stick and place it near the homa kunda (or offer a drop of ghee in its absence):"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, ఒక అగరుబత్తిని వెలిగించి హోమ కుండం దగ్గర ఉంచండి (లేదా అది లేనప్పుడు ఒక చుక్క నెయ్యిని సమర్పించండి):"
            ],
            "hindi": [
              "यह कहें, एक अगरबत्ती जलाएं और उसे होम कुंड के पास रखें (या उसकी अनुपस्थिति में घी की एक बूंद चढ़ाएं):"
            ]
          },
          "slokas": {
            "english": "om yaṃ vāyvātmikāyai namaḥ",
            "telugu": "ఓం యం వాయ్వాత్మికాయై నమః",
            "devanagari": "ॐ यं वाय्वात्मिकायै नमः"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and show the lamp to the homa kunda (or offer a drop of ghee in its absence):"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, దీపాన్ని హోమ కుండానికి చూపించండి (లేదా అది లేనప్పుడు ఒక చుక్క నెయ్యిని సమర్పించండి):"
            ],
            "hindi": [
              "यह कहें और दीपक को होम कुंड को दिखाएं (या उसकी अनुपस्थिति में घी की एक बूंद चढ़ाएं):"
            ]
          },
          "slokas": {
            "english": "om raṃ agnyātmikāyai namaḥ",
            "telugu": "ఓం రం అగ్న్యాత్మికాయై నమః",
            "devanagari": "ॐ रं अग्न्यात्मिकायै नमः"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a raisin or piece of a fruit or some unused cooked food in fire (or a drop of ghee in its absence):"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, ఒక ఎండుద్రాక్ష లేదా పండు ముక్క లేదా ఉపయోగించని వండిన ఆహారాన్ని అగ్నిలో సమర్పించండి (లేదా అది లేనప్పుడు ఒక చుక్క నెయ్యిని):"
            ],
            "hindi": [
              "यह कहें और आग में एक किशमिश या फल का टुकड़ा या कुछ अप्रयुक्त पका हुआ भोजन चढ़ाएं (या उसकी अनुपस्थिति में घी की एक बूंद):"
            ]
          },
          "slokas": {
            "english": "om vaṃ jalātmikāyai namaḥ",
            "telugu": "ఓం వం జలాత్మికాయై నమః",
            "devanagari": "ॐ वं जलात्मिकायै नमः"
          }
        }
      ]
    },
    {
      "id": 6,
      "title": {
        "english": "Procedure: Offerings to Main Deity",
        "telugu": "ప్రక్రియ: ప్రధాన దేవతకు నైవేద్యాలు",
        "devanagari": "प्रक्रिया: मुख्य देवता को आहुतियाँ"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Say one of the following 4 mantras and offer a drop of ghee (or sesame seeds or nuts) in fire while imagining that Mother Lalita is accepting it.",
              "You can do this as many times as you can. You can also use any other mantras you are attached to.",
              "Don't rush. Imagine that the Divine Mother is in the fire, accepting your offerings and mantra. Imagine that her blessings are coming to you. Try to develop that feeling and enjoy it."
            ],
            "telugu": [
              "కింది 4 మంత్రాలలో ఒకదాన్ని చెప్పి, లలితా దేవి దానిని స్వీకరిస్తోందని ఊహించుకుంటూ అగ్నిలో ఒక చుక్క నెయ్యి (లేదా నువ్వులు లేదా గింజలు) సమర్పించండి.",
              "మీరు దీన్ని మీకు వీలైనన్ని సార్లు చేయవచ్చు. మీరు ఇష్టపడే ఇతర మంత్రాలను కూడా ఉపయోగించవచ్చు.",
              "తొందరపడకండి. దివ్య మాత అగ్నిలో ఉందని, మీ నైవేద్యాలను మరియు మంత్రాన్ని స్వీకరిస్తోందని ఊహించుకోండి. ఆమె ఆశీస్సులు మీకు వస్తున్నాయని ఊహించుకోండి. ఆ భావనను పెంపొందించుకోవడానికి ప్రయత్నించి ఆనందించండి."
            ],
            "hindi": [
              "निम्नलिखित 4 मंत्रों में से एक कहें और यह कल्पना करते हुए अग्नि में घी (या तिल या मेवे) की एक बूंद चढ़ाएं कि माता ललिता इसे स्वीकार कर रही हैं।",
              "आप इसे जितनी बार कर सकते हैं कर सकते हैं। आप किसी अन्य मंत्र का भी उपयोग कर सकते हैं जिससे आप जुड़े हुए हैं।",
              "जल्दबाजी न करें। कल्पना करें कि दिव्य माता अग्नि में हैं, आपकी भेंट और मंत्र स्वीकार कर रही हैं। कल्पना करें कि उनका आशीर्वाद आप तक आ रहा है। उस भावना को विकसित करने का प्रयास करें और उसका आनंद लें।"
            ]
          },
          "slokas": {
            "english": "1. om aiṃ hrīṃ śrīṃ lalitā tripura sundaryai namaḥ svāhā\n2. aiṃ klīṃ sauḥ svāhā\n3. om kaeīlahīṃ। hasakahalahīṃ। sakalahīṃ। svāhā।\n4. om aruṇāṃ karuṇā taraṃgitākṣīṃ। dhṛta pāśāṃkuśa bāṇa cāpa hastāṃ। aṇimādibhirāvṛtāṃ mayūkhaiḥ। ahamityeva vibhāvaye bhavānīṃ। svāhā।",
            "telugu": "౧. ఓం ఐం హ్రీం శ్రీం లలితా త్రిపుర సుందర్యై నమః స్వాహా\n౨. ఐం క్లీం సౌః స్వాహా\n౩. ఓం కఏఈలహీం। హసకహలహీం। సకలహీం। స్వాహా।\n౪. ఓం అరుణాం కరుణా తరంగితాక్షీం। ధృత పాశాంకుశ బాణ చాప హస్తాం। అణిమాదిభిరావృతాం మయూఖైః। అహమిత్యేవ విభావయే భవానీం। స్వాహా।",
            "devanagari": "१. ॐ ऐं ह्रीं श्रीं ललिता त्रिपुर सुन्दर्यै नमः स्वाहा\n२. ऐं क्लीं सौः स्वाहा\n३. ॐ कएईलहीं। हसकहलहीं। सकलहीं। स्वाहा।\n४. ॐ अरुणां करुणा तरंगिताक्षीं। धृत पाशांकुश बाण चाप हस्तां। अणिमादिभिरावृतां मयूखैः। अहमित्येव विभावये भवानीं। स्वाहा।"
          }
        }
      ]
    },
    {
      "id": 7,
      "title": {
        "english": "Procedure: Final Offerings in Fire",
        "telugu": "ప్రక్రియ: అగ్నిలో చివరి నైవేద్యాలు",
        "devanagari": "प्रक्रिया: अग्नि में अंतिम आहुतियाँ"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your physical experiences to Agni, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ భౌతిక అనుభవాలను అగ్నికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपने भौतिक अनुभवों को अग्नि को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om bhūḥ agnaye svāhā",
            "telugu": "ఓం భూః అగ్నయే స్వాహా",
            "devanagari": "ॐ भूः अग्नये स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your mental experiences to Vayu, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ మానసిక అనుభవాలను వాయువుకు సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपने मानसिक अनुभवों को वायु को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om bhuvaḥ vāyave svāhā",
            "telugu": "ఓం భువః వాయవే స్వాహా",
            "devanagari": "ॐ भुवः वायवे स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering your spiritual experiences to Surya, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీ ఆధ్యాత్మిక అనుభవాలను సూర్యునికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से अपने आध्यात्मिक अनुभवों को सूर्य को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om suvaḥ sūryāya svāhā",
            "telugu": "ఓం సువః సూర్యాయ స్వాహా",
            "devanagari": "ॐ सुवः सूर्याय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering everything physical, mental and spiritual that is being created inside you, to Prajapati, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీలో సృష్టించబడుతున్న భౌతిక, మానసిక మరియు ఆధ్యాత్మికమైన ప్రతిదాన్ని ప్రజాపతికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से आपके भीतर बनाए जा रहे भौतिक, मानसिक और आध्यात्मिक सब कुछ प्रजापति को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvaḥ svāhā",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering everything physical, mental and spiritual that is being sustained inside you, to Vishnu, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీలో నిలబెట్టబడుతున్న భౌతిక, మానసిక మరియు ఆధ్యాత్మికమైన ప్రతిదాన్ని విష్ణువుకు సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से आपके भीतर बनाए रखे जा रहे भौतिक, मानसिक और आध्यात्मिक सब कुछ विष्णु को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om viṣṇave svāhā",
            "telugu": "ఓం విష్ణవే స్వాహా",
            "devanagari": "ॐ विष्णवे स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that you are surrendering everything physical, mental and spiritual that is being destroyed inside you, to Rudra, via Holy Fire:"
            ],
            "telugu": [
              "పవిత్రాగ్ని ద్వారా, మీలో నాశనం చేయబడుతున్న భౌతిక, మానసిక మరియు ఆధ్యాత్మికమైన ప్రతిదాన్ని రుద్రునికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ, ఈ మంత్రాన్ని జపించి, అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और पवित्र अग्नि के माध्यम से आपके भीतर नष्ट हो रहे भौतिक, मानसिक और आध्यात्मिक सब कुछ रुद्र को समर्पित करने की कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om rudrāya svāhā",
            "telugu": "ఓం రుద్రాయ స్వాహా",
            "devanagari": "ॐ रुद्राय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Take 6 raisins or 6 pieces of a fruit or 6 fruits. Offer them to those ethereal associates of the deity, who cannot accept via Holy Fire and who like to consume food via sense of smell. You can throw away that food later in woods or trash or feed it to animals or birds."
            ],
            "telugu": [
              "6 ఎండుద్రాక్షలు లేదా 6 పండు ముక్కలు లేదా 6 పండ్లను తీసుకోండి. పవిత్రాగ్ని ద్వారా స్వీకరించలేని మరియు వాసన ద్వారా ఆహారాన్ని స్వీకరించడానికి ఇష్టపడే దేవత యొక్క ఆ అగోచర సహచరులకు వాటిని సమర్పించండి. ఆ ఆహారాన్ని తరువాత అడవిలో లేదా చెత్తలో పారవేయవచ్చు లేదా జంతువులకు లేదా పక్షులకు పెట్టవచ్చు."
            ],
            "hindi": [
              "6 किशमिश या 6 फल के टुकड़े या 6 फल लें। उन्हें देवता के उन दिव्य सहयोगियों को अर्पित करें, जो पवित्र अग्नि के माध्यम से स्वीकार नहीं कर सकते हैं और जो गंध की भावना के माध्यम से भोजन का सेवन करना पसंद करते हैं। आप उस भोजन को बाद में जंगल या कचरे में फेंक सकते हैं या जानवरों या पक्षियों को खिला सकते हैं।"
            ]
          },
          "slokas": {
            "english": "om pārṣadebhyo namaḥ",
            "telugu": "ఓం పార్షదేభ్యో నమః",
            "devanagari": "ॐ पार्षदेभ्यो नमः"
          }
        }
      ]
    },
    {
      "id": 8,
      "title": {
        "english": "Procedure: Poornahuti (Complete Offering)",
        "telugu": "ప్రక్రియ: పూర్ణాహుతి (సంపూర్ణ సమర్పణ)",
        "devanagari": "प्रक्रिया: पूर्णाहुति (पूर्ण आहुति)"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Say this and offer a big copra piece or a nut or a twig or a big drop of ghee in fire while imagining that you are surrendering your sense of being to Mother Lalita:"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, మీ అస్తిత్వ భావాన్ని లలితా దేవికి సమర్పిస్తున్నట్లు ఊహించుకుంటూ అగ్నిలో ఒక పెద్ద కొబ్బరి ముక్క లేదా గింజ లేదా కొమ్మ లేదా ఒక పెద్ద నెయ్యి చుక్కను సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और अपनी सत्ता की भावना को माता ललिता को समर्पित करने की कल्पना करते हुए आग में एक बड़ा खोपरे का टुकड़ा या एक मेवा या एक टहनी या घी की एक बड़ी बूंद चढ़ाएं:"
            ]
          },
          "slokas": {
            "english": "om aiṃ hrīṃ śrīṃ lalitā tripura sundaryai namaḥ svāhā",
            "telugu": "ఓం ఐం హ్రీం శ్రీం లలితా త్రిపుర సుందర్యై నమః స్వాహా",
            "devanagari": "ॐ ऐं ह्रीं श्रीं ललिता त्रिपुर सुन्दर्यै नमः स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Say this and offer a drop of ghee in fire while imagining that Holy Fire with seven tongues is pleased:"
            ],
            "telugu": [
              "ఈ మంత్రాన్ని జపించి, ఏడు నాలుకలతో కూడిన పవిత్రాగ్ని ప్రసన్నమైందని ఊహించుకుంటూ అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి:"
            ],
            "hindi": [
              "यह कहें और यह कल्पना करते हुए अग्नि में घी की एक बूंद चढ़ाएं कि सात जिह्वाओं वाली पवित्र अग्नि प्रसन्न है:"
            ]
          },
          "slokas": {
            "english": "om agnaye saptavate svāhā",
            "telugu": "ఓం అగ్నయే సప్తవతే స్వాహా",
            "devanagari": "ॐ अग्नये सप्तवते स्वाहा"
          }
        }
      ]
    },
    {
      "id": 9,
      "title": {
        "english": "Meditation",
        "telugu": "ధ్యానం",
        "devanagari": "ध्यान"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, meditate as long as you can, with the following mantra (or any other mantra you like)."
            ],
            "telugu": [
              "ఇప్పుడు, కింది మంత్రంతో (లేదా మీకు నచ్చిన మరేదైనా మంత్రంతో) మీకు వీలైనంత సేపు ధ్యానం చేయండి."
            ],
            "hindi": [
              "अब, निम्नलिखित मंत्र (या अपनी पसंद के किसी अन्य मंत्र) के साथ जब तक आप कर सकते हैं तब तक ध्यान करें।"
            ]
          },
          "slokas": {
            "english": "om aiṃ hrīṃ śrīṃ lalitā tripura sundaryai namaḥ",
            "telugu": "ఓం ఐం హ్రీం శ్రీం లలితా త్రిపుర సుందర్యై నమః",
            "devanagari": "ॐ ऐं ह्रीं श्रीं ललिता त्रिपुर सुन्दर्यै नमः"
          }
        },
        {
          "instructions": {
            "english": [
              "At the end, say this while imagining that peace descends on you and others:"
            ],
            "telugu": [
              "చివరగా, మీపై మరియు ఇతరులపై శాంతి వర్షిస్తోందని ఊహించుకుంటూ ఇది చెప్పండి:"
            ],
            "hindi": [
              "अंत में, यह कल्पना करते हुए कहें कि आप पर और दूसरों पर शांति उतरती है:"
            ]
          },
          "slokas": {
            "english": "śāntiḥ śāntiḥ śāntiḥ",
            "telugu": "శాంతిః శాంతిః శాంతిః",
            "devanagari": "शान्तिः शान्तिः शान्तिः"
          }
        }
      ]
    }
  ]
}