{
  "title": {
    "english": "Simple Taaraa Homa",
    "telugu": "సరళ తారా హోమం",
    "hindi": "सरल तारा होम"
  },
  "author": {
    "english": "P V R Narasimha Rao",
    "telugu": "పి వి ఆర్ నరసింహారావు",
    "hindi": "पी वी आर नरसिम्हा राव"
  },
  "sections": [
    {
      "id": 0,
      "source": "https://vedicastrologer.org/homa/simple/tara_s_sans-.pdf",
      "title": {
        "english": "Introduction",
        "telugu": "పరిచయం",
        "devanagari": "परिचय"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Taaraa literally means \"one who crosses over\". She helps devotees cross over the world appearance.",
              "Her homa can be done every day or every Thursday (or weekend) or on every Sukla Navami tithi."
            ],
            "telugu": [
              "తార అంటే సాహిత్యపరంగా \"దాటించునది\" అని అర్థం. ఆమె భక్తులను ప్రపంచ మాయ నుండి దాటడానికి సహాయపడుతుంది.",
              "ఆమె హోమాన్ని ప్రతిరోజూ లేదా ప్రతి గురువారం (లేదా వారాంతంలో) లేదా ప్రతి శుక్ల నవమి తిథి నాడు చేయవచ్చు."
            ],
            "hindi": [
              "तारा का शाब्दिक अर्थ है \"पार कराने वाली\"। वह भक्तों को सांसारिक माया से पार पाने में मदद करती हैं।",
              "उनका होम हर दिन या हर गुरुवार (या सप्ताहांत) या हर शुक्ल नवमी तिथि को किया जा सकता है।"
            ]
          },
          "slokas": {
            "english": "om śrī mahāgaṇapataye namaḥ | om śrī gurubhyo namaḥ | om ṛṣibhyo namaḥ",
            "telugu": "ఓం శ్రీ మహాగణపతయే నమః | ఓం శ్రీ గురుభ్యో నమః | ఓం ఋషిభ్యో నమః",
            "devanagari": "ॐ श्री महागणपतये नमः । ॐ श्री गुरुभ्यो नमः । ॐ ऋषिभ्यो नमः"
          }
        }
      ]
    },
    {
      "id": 1,
      "title": {
        "english": "Preparation",
        "telugu": "సిద్ధత",
        "devanagari": "तैयारी"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Find a standard homa kunda or simply a small vessel/utensil made of copper/silver/bronze/steel, in square/circular/rectangular shape. Clean it thoroughly, dry it and use it.",
              "Find some ghee (clarified butter). If not available, use sesame oil or some other oil. Also find a cup/tumbler and a spoon for offering ghee.",
              "Keep a tumbler and spoon for water, a matchbox, and camphor (if available) ready.",
              "For fuel, use small pieces (roughly 1 inch x 1 inch) of dry coconut (copra), or fallen dry twigs from trees, or dried cowdung pieces.",
              "For other offerings, you can use black/brown/white sesame seeds and any unsalted plain nuts (e.g. cashews, almonds etc)."
            ],
            "telugu": [
              "ఒక ప్రామాణిక హోమ కుండం లేదా కేవలం రాగి/వెండి/కంచు/స్టీల్‌తో చేసిన చతురస్ర/వృత్తాకార/దీర్ఘచతురస్రాకారంలో ఉన్న ఒక చిన్న పాత్ర/పాత్రను తీసుకోండి. దానిని పూర్తిగా శుభ్రపరచి, ఆరబెట్టి ఉపయోగించండి.",
              "కొంత నెయ్యి (శుద్ధి చేసిన వెన్న) తీసుకోండి. అందుబాటులో లేకపోతే, నువ్వుల నూనె లేదా మరేదైనా నూనెను ఉపయోగించండి. నెయ్యి సమర్పించడానికి ఒక కప్పు/గ్లాసు మరియు ఒక చెంచా కూడా తీసుకోండి.",
              "నీటి కోసం ఒక గ్లాసు మరియు చెంచా, అగ్గిపెట్టె, మరియు కర్పూరం (అందుబాటులో ఉంటే) సిద్ధంగా ఉంచుకోండి.",
              "ఇంధనం కోసం, ఎండు కొబ్బరి (కొబ్బరి చిప్ప) చిన్న ముక్కలు (సుమారు 1 అంగుళం x 1 అంగుళం), లేదా చెట్ల నుండి రాలిన ఎండు పుల్లలు, లేదా ఎండిన ఆవు పేడ ముక్కలను ఉపయోగించండి.",
              "ఇతర నైవేద్యాల కోసం, మీరు నలుపు/గోధుమ/తెలుపు నువ్వులు మరియు ఉప్పు లేని సాదా గింజలు (ఉదా. జీడిపప్పు, బాదం మొదలైనవి) ఉపయోగించవచ్చు."
            ],
            "hindi": [
              "एक मानक होम कुंड या तांबे/चांदी/कांस्य/स्टील से बना एक छोटा बर्तन लें, जो चौकोर/वृत्ताकार/आयताकार आकार का हो। इसे अच्छी तरह साफ करें, सुखाएं और प्रयोग करें।",
              "कुछ घी (स्पष्ट मक्खन) लें। यदि उपलब्ध न हो, तो तिल का तेल या कोई अन्य तेल प्रयोग करें। घी चढ़ाने के लिए एक कप/गिलास और एक चम्मच भी लें।",
              "पानी के लिए एक गिलास और चम्मच, एक माचिस और कपूर (यदि उपलब्ध हो) तैयार रखें।",
              "ईंधन के लिए, सूखे नारियल (खोपरा) के छोटे टुकड़े (लगभग 1 इंच x 1 इंच), या पेड़ों से गिरी सूखी टहनियाँ, या सूखे गोबर के उपले का उपयोग करें।",
              "अन्य आहुतियों के लिए, आप काले/भूरे/सफेद तिल और कोई भी बिना नमक वाले सादे मेवे (जैसे काजू, बादाम आदि) का उपयोग कर सकते हैं।"
            ]
          }
        }
      ]
    },
    {
      "id": 2,
      "title": {
        "english": "Some Precautions",
        "telugu": "కొన్ని జాగ్రత్తలు",
        "devanagari": "कुछ सावधानियां"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Do NOT consume meat, alcohol, or drugs on the previous day.",
              "Sleep well and get up early on the day of the homa. Take a bath and wear clean, comfortable clothes.",
              "Being in a calm state of mind is more important than externalities like traditional clothes.",
              "If possible, it is ideal to do the homa in an open space outdoors.",
              "When performing indoors, ensure there is enough ventilation to avoid smoke accumulation. Take precautions to avoid fire hazards, like keeping inflammable substances away from the homa."
            ],
            "telugu": [
              "ముందు రోజు మాంసం, మద్యం, లేదా మత్తుపదార్థాలు సేవించవద్దు.",
              "హోమం రోజున బాగా నిద్రపోయి తొందరగా లేవండి. స్నానం చేసి, శుభ్రమైన, సౌకర్యవంతమైన బట్టలు ధరించండి.",
              "సాంప్రదాయ దుస్తులు వంటి బాహ్య విషయాల కంటే ప్రశాంతమైన మానసిక స్థితిలో ఉండటం ముఖ్యం.",
              "వీలైతే, ఆరుబయట బహిరంగ ప్రదేశంలో హోమం చేయడం ఉత్తమం.",
              "గదిలో చేస్తున్నప్పుడు, పొగ పేరుకుపోకుండా తగినంత వెంటిలేషన్ ఉండేలా చూసుకోండి. హోమం దగ్గర మండే పదార్థాలను దూరంగా ఉంచడం వంటి అగ్ని ప్రమాదాలను నివారించడానికి జాగ్రత్తలు తీసుకోండి."
            ],
            "hindi": [
              "पिछले दिन मांस, शराब या नशीली दवाओं का सेवन न करें।",
              "होम के दिन अच्छी तरह सोएं और जल्दी उठें। स्नान करें और साफ, आरामदायक कपड़े पहनें।",
              "पारंपरिक कपड़ों जैसी बाहरी चीजों से ज्यादा महत्वपूर्ण मन की शांत स्थिति में होना है।",
              "यदि संभव हो, तो होम को बाहर کھلی जगह में करना आदर्श है।",
              "घर के अंदर करते समय, यह सुनिश्चित करें कि धुएं के जमाव से बचने के लिए पर्याप्त वेंटिलेशन हो। आग के खतरों से बचने के लिए सावधानियां बरतें, जैसे ज्वलनशील पदार्थों को होम से दूर रखना।"
            ]
          }
        }
      ]
    },
    {
      "id": 3,
      "title": {
        "english": "Procedure: Pre-Fire Stage",
        "telugu": "ప్రక్రియ: అగ్ని-పూర్వ దశ",
        "devanagari": "प्रक्रिया: पूर्व-अग्नि चरण"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Sit down facing east and place the homa kunda in front of you. Think of Mother Earth with gratitude for bearing your weight.",
              "Clean your palm, pour some water in your palm 3 times and drink it after saying the following mantras."
            ],
            "telugu": [
              "తూర్పు ముఖంగా కూర్చుని, హోమ కుండాన్ని మీ ముందు ఉంచుకోండి. మీ భారాన్ని మోస్తున్నందుకు భూమాతకు కృతజ్ఞతలు తెలుపుకోండి.",
              "మీ అరచేతిని శుభ్రం చేసుకోండి, మీ అరచేతిలో 3 సార్లు కొద్దిగా నీరు పోసుకుని, ఈ క్రింది మంత్రాలను చెప్పిన తర్వాత త్రాగండి."
            ],
            "hindi": [
              "पूर्व की ओर मुंह करके बैठें और होम कुंड को अपने सामने रखें। आपका भार सहन करने के लिए धरती माता का कृतज्ञता से ध्यान करें।",
              "अपनी हथेली साफ करें, अपनी हथेली में 3 बार थोड़ा पानी डालें और निम्नलिखित मंत्रों को कहने के बाद उसे पी लें।"
            ]
          },
          "slokas": {
            "english": "om keśavāya svāhā | om nārāyaṇāya svāhā | om mādhavāya svāhā",
            "telugu": "ఓం కేశవాయ స్వాహా | ఓం నారాయణాయ స్వాహా | ఓం మాధవాయ స్వాహా",
            "devanagari": "ॐ केशवाय स्वाहा । ॐ नारायणाय स्वाहा । ॐ माधवाय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Light a lamp and think of the fire in it with gratitude. Calm your mind by focusing on your breath, either with normal or alternate nostril breathing.",
              "Place some water in your right palm and make a resolution (Sankalpa). If you are not comfortable with Sanskrit, say this in English: 'For the establishment of Dharma on earth and for the well-being and peace of all people, I shall do a Taaraa Homa within my abilities.' After saying it, drop the water in front of you over the tips of your fingers."
            ],
            "telugu": [
              "ఒక దీపం వెలిగించి, దానిలోని అగ్నికి కృతజ్ఞతలు తెలుపుకోండి. సాధారణ లేదా అనులోమ విలోమ శ్వాసతో మీ శ్వాసపై దృష్టి కేంద్రీకరించి మీ మనస్సును ప్రశాంతంగా ఉంచుకోండి.",
              "మీ కుడి అరచేతిలో కొద్దిగా నీరు తీసుకుని సంకల్పం చేసుకోండి. మీకు సంస్కృతం సౌకర్యంగా లేకపోతే, ఆంగ్లంలో ఇలా చెప్పండి: 'భూమిపై ధర్మ స్థాపన కోసం మరియు ప్రజలందరి శ్రేయస్సు మరియు శాంతి కోసం, నేను నా శక్తి మేరకు తారా హోమాన్ని చేస్తాను.' ఇలా చెప్పిన తర్వాత, మీ వేళ్ల కొనల మీదుగా నీటిని మీ ముందు వదలండి."
            ],
            "hindi": [
              "एक दीपक जलाएं और उसमें मौजूद अग्नि का कृतज्ञता से ध्यान करें। अपनी श्वास पर ध्यान केंद्रित करके अपने मन को शांत करें, चाहे सामान्य श्वास हो या अनुलोम-विलोम प्राणायाम।",
              "अपनी दाहिनी हथेली में थोड़ा पानी लें और एक संकल्प लें। यदि आप संस्कृत में सहज नहीं हैं, तो अंग्रेजी में यह कहें: 'पृथ्वी पर धर्म की स्थापना के लिए और सभी लोगों की भलाई और शांति के लिए, मैं अपनी क्षमताओं के भीतर एक तारा होम करूंगा।' इसे कहने के बाद, पानी को अपनी उंगलियों के सिरों पर से अपने सामने गिरा दें।"
            ]
          },
          "slokas": {
            "english": "bhūloke dharma sthāpanārtha sarveṣāṃ janānāṃ sukha śānti siddhyarthaṃ tārā homakarma yathāśakti kariṣye",
            "telugu": "భూలోకే ధర్మ స్థాపనార్థ సర్వేషాం జనానాం సుఖ శాంతి సిద్ధ్యర్థం తారా హోమకర్మ యథాశక్తి కరిష్యే",
            "devanagari": "भूलोके धर्म स्थापनार्थ सर्वेषां जनानां सुख शान्ति सिद्ध्यर्थं तारा होमकर्म यथाशक्ति करिष्ये"
          }
        },
        {
          "instructions": {
            "english": [
              "Place a couple of copra pieces (or twigs) in the homa kunda and light them, using camphor for ease if you have it. While lighting, say the following mantra and imagine that the Holy Fire will cooperate in this ritual."
            ],
            "telugu": [
              "కొన్ని కొబ్బరి ముక్కలు (లేదా పుల్లలు) హోమ కుండంలో ఉంచి, వాటిని వెలిగించండి, సులభంగా వెలిగించడానికి కర్పూరం ఉంటే ఉపయోగించండి. వెలిగిస్తున్నప్పుడు, ఈ క్రింది మంత్రాన్ని జపించండి మరియు పవిత్ర అగ్ని ఈ కర్మలో సహకరిస్తుందని భావించండి."
            ],
            "hindi": [
              "होम कुंड में कुछ खोपरे के टुकड़े (या टहनियाँ) रखें और उन्हें जलाएँ, यदि आपके पास कपूर है तो आसानी के लिए उसका उपयोग करें। जलाते समय, निम्नलिखित मंत्र का जाप करें और कल्पना करें कि पवित्र अग्नि इस अनुष्ठान में सहयोग करेगी।"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvarom",
            "telugu": "ఓం భూర్భువస్సువరోం",
            "devanagari": "ॐ भूर्भुवस्सुवरोम्"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer drops of ghee into the fire 8 times while saying the following mantra. Imagine that the fire is becoming holy and stronger."
            ],
            "telugu": [
              "ఈ క్రింది మంత్రాన్ని జపిస్తూ 8 సార్లు అగ్నిలో నెయ్యి చుక్కలను సమర్పించండి. అగ్ని పవిత్రంగా మరియు బలంగా మారుతోందని భావించండి."
            ],
            "hindi": [
              "निम्नलिखित मंत्र का जाप करते हुए आग में 8 बार घी की बूंदें चढ़ाएं। कल्पना कीजिए कि अग्नि पवित्र और बलवान हो रही है।"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvaḥ svāhā",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा"
          }
        }
      ]
    },
    {
      "id": 4,
      "title": {
        "english": "Procedure: Initial Offerings in Fire",
        "telugu": "ప్రక్రియ: అగ్నిలో ప్రారంభ నైవేద్యాలు",
        "devanagari": "प्रक्रिया: अग्नि में प्रारंभिक आहुतियाँ"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Offer a drop of ghee, imagining you are surrendering your consciousness to Prajapati.",
              "Offer a drop of ghee, imagining you are surrendering your faculty of inspired perception to Indra.",
              "Offer a drop of ghee, imagining you are surrendering your faculty of logical and structured thinking to Agni.",
              "Offer a drop of ghee, imagining you are surrendering your faculty of feeling and intuition to Soma.",
              "Offer a drop of ghee, imagining you are surrendering your awareness of physical, mental and spiritual realms to Prajapati.",
              "Offer a drop of ghee, imagining you are surrendering your ability to plan and avoid obstacles to Ganesha.",
              "Offer a drop of ghee, imagining you are surrendering your ability to persist and overcome problems to Varuna."
            ],
            "telugu": [
              "మీ చైతన్యాన్ని ప్రజాపతికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీ ప్రేరేపిత గ్రహణ శక్తిని ఇంద్రునికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీ తార్కిక మరియు నిర్మాణాత్మక ఆలోచనా శక్తిని అగ్నికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీ భావన మరియు అంతర్ దృష్టి శక్తిని సోమునికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "భౌతిక, మానసిక మరియు ఆధ్యాత్మిక రంగాల గురించిన మీ అవగాహనను ప్రజాపతికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "ప్రణాళిక వేసి అడ్డంకులను నివారించే మీ సామర్థ్యాన్ని గణేశునికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "సమస్యలను అధిగమించి నిలబడే మీ సామర్థ్యాన్ని వరుణునికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपनी चेतना प्रजापति को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपनी प्रेरित धारणा की शक्ति इंद्र को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपनी तार्किक और संरचित सोच की शक्ति अग्नि को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपनी भावना और अंतर्ज्ञान की शक्ति सोम को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप भौतिक, मानसिक और आध्यात्मिक क्षेत्रों की अपनी जागरूकता प्रजापति को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप योजना बनाने और बाधाओं से बचने की अपनी क्षमता गणेश को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप समस्याओं पर काबू पाने और बने रहने की अपनी क्षमता वरुण को समर्पित कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om prajāpataye svāhā | om indrāya svāhā | om agnaye svāhā | om somāya svāhā | om bhūrbhuvassuvaḥ svāhā | om gaṃ gaṇapataye namaḥ svāhā | om vaṃ varuṇāya namaḥ svāhā",
            "telugu": "ఓం ప్రజాపతయే స్వాహా | ఓం ఇంద్రాయ స్వాహా | ఓం అగ్నయే స్వాహా | ఓం సోమాయ స్వాహా | ఓం భూర్భువస్సువః స్వాహా | ఓం గం గణపతయే నమః స్వాహా | ఓం వం వరుణాయ నమః స్వాహా",
            "devanagari": "ॐ प्रजापतये स्वाहा । ॐ इन्द्राय स्वाहा । ॐ अग्नये स्वाहा । ॐ सोमाय स्वाहा । ॐ भूर्भुवस्सुवः स्वाहा । ॐ गं गणपतये नमः स्वाहा । ॐ वं वरुणाय नमः स्वाहा"
          }
        }
      ]
    },
    {
      "id": 5,
      "title": {
        "english": "Procedure: Services to Main Deity",
        "telugu": "ప్రక్రియ: ప్రధాన దేవతకు సేవలు",
        "devanagari": "प्रक्रिया: मुख्य देवता की सेवाएं"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Saying this, imagine that Mother Taaraa has entered the Holy Fire and is accepting your offerings."
            ],
            "telugu": [
              "ఇలా చెబుతూ, తారా మాత పవిత్ర అగ్నిలోకి ప్రవేశించి మీ నైవేద్యాలను స్వీకరిస్తోందని భావించండి."
            ],
            "hindi": [
              "यह कहते हुए, कल्पना करें कि माँ तारा पवित्र अग्नि में प्रवेश कर चुकी हैं और आपकी आहुतियाँ स्वीकार कर रही हैं।"
            ]
          },
          "slokas": {
            "english": "atra āgaccha। āvāhitā bhava।",
            "telugu": "అత్ర ఆగచ్ఛ। ఆవాహితా భవ।",
            "devanagari": "अत्र आगच्छ। आवाहिता भव।"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer sandalwood powder (or a drop of ghee in its absence).",
              "Offer a flower or dried flower powder (or a drop of ghee in its absence).",
              "Light an incense stick and place it near the homa kunda (or offer a drop of ghee in its absence).",
              "Show the lamp to the homa kunda (or offer a drop of ghee in its absence).",
              "Offer a raisin, a piece of fruit, or some unused cooked food (or a drop of ghee in its absence)."
            ],
            "telugu": [
              "గంధపు పొడిని (లేదా దాని లేనప్పుడు ఒక చుక్క నెయ్యి) సమర్పించండి.",
              "ఒక పువ్వు లేదా ఎండిన పువ్వుల పొడిని (లేదా దాని లేనప్పుడు ఒక చుక్క నెయ్యి) సమర్పించండి.",
              "ఒక అగరుబత్తిని వెలిగించి హోమ కుండం దగ్గర ఉంచండి (లేదా దాని లేనప్పుడు ఒక చుక్క నెయ్యి సమర్పించండి).",
              "దీపాన్ని హోమ కుండానికి చూపించండి (లేదా దాని లేనప్పుడు ఒక చుక్క నెయ్యి సమర్పించండి).",
              "ఒక ఎండుద్రాక్ష, ఒక పండు ముక్క, లేదా ఉపయోగించని వండిన ఆహారాన్ని (లేదా దాని లేనప్పుడు ఒక చుక్క నెయ్యి) సమర్పించండి."
            ],
            "hindi": [
              "चंदन पाउडर (या उसकी अनुपस्थिति में घी की एक बूंद) चढ़ाएं।",
              "एक फूल या सूखे फूल का पाउडर (या उसकी अनुपस्थिति में घी की एक बूंद) चढ़ाएं।",
              "एक अगरबत्ती जलाएं और उसे होम कुंड के पास रखें (या उसकी अनुपस्थिति में घी की एक बूंद चढ़ाएं)।",
              "दीपक को होम कुंड को दिखाएं (या उसकी अनुपस्थिति में घी की एक बूंद चढ़ाएं)।",
              "एक किशमिश, फल का एक टुकड़ा, या कुछ अप्रयुक्त पके हुए भोजन (या उसकी अनुपस्थिति में घी की एक बूंद) चढ़ाएं।"
            ]
          },
          "slokas": {
            "english": "om laṃ pṛthivyātmikāyai namaḥ | om haṃ ākāśātmikāyai namaḥ | om yaṃ vāyvātmikāyai namaḥ | om raṃ agnyātmikāyai namaḥ | om vaṃ jalātmikāyai namaḥ",
            "telugu": "ఓం లం పృథివ్యాత్మికాయై నమః | ఓం హం ఆకాశాత్మికాయై నమః | ఓం యం వాయ్వాత్మికాయై నమః | ఓం రం అగ్న్యాత్మికాయై నమః | ఓం వం జలాత్మికాయై నమః",
            "devanagari": "ॐ लं पृथिव्यात्मिकायै नमः । ॐ हं आकाशात्मिकायै नमः । ॐ यं वाय्वात्मिकायै नमः । ॐ रं अग्न्यात्मिकायै नमः । ॐ वं जलात्मिकायै नमः"
          }
        }
      ]
    },
    {
      "id": 6,
      "title": {
        "english": "Procedure: Offerings to Main Deity",
        "telugu": "ప్రక్రియ: ప్రధాన దేవతకు నైవేద్యాలు",
        "devanagari": "प्रक्रिया: मुख्य देवता को आहुतियाँ"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Say one of the following 4 mantras and offer a drop of ghee (or sesame seeds or nuts) in the fire. Imagine that Mother Taaraa is accepting it.",
              "You can do this as many times as you can. You can also use any other mantras you are attached to.",
              "Don't rush. Imagine that the deity is in the fire, accepting your offerings and mantra. Try to develop that feeling and enjoy it, imagining that blessings are coming to you."
            ],
            "telugu": [
              "ఈ క్రింది 4 మంత్రాలలో ఒకదాన్ని చెప్పి, అగ్నిలో ఒక చుక్క నెయ్యి (లేదా నువ్వులు లేదా గింజలు) సమర్పించండి. తారా మాత దానిని స్వీకరిస్తోందని భావించండి.",
              "మీరు దీన్ని మీకు వీలైనన్ని సార్లు చేయవచ్చు. మీకు ఇష్టమైన ఇతర మంత్రాలను కూడా ఉపయోగించవచ్చు.",
              "తొందరపడకండి. దేవత అగ్నిలో ఉండి, మీ నైవేద్యాలను మరియు మంత్రాన్ని స్వీకరిస్తోందని భావించండి. ఆ అనుభూతిని పెంపొందించుకుని, ఆనందించడానికి ప్రయత్నించండి, మీకు ఆశీస్సులు వస్తున్నాయని భావించండి."
            ],
            "hindi": [
              "निम्नलिखित 4 मंत्रों में से एक का जाप करें और आग में घी की एक बूंद (या तिल या मेवे) चढ़ाएं। कल्पना कीजिए कि माँ तारा इसे स्वीकार कर रही हैं।",
              "आप इसे जितनी बार चाहें कर सकते हैं। आप किसी अन्य मंत्र का भी उपयोग कर सकते हैं जिससे आप जुड़े हुए हैं।",
              "जल्दबाजी न करें। कल्पना करें कि देवता अग्नि में हैं, आपकी आहुतियों और मंत्र को स्वीकार कर रहे हैं। उस भावना को विकसित करने और उसका आनंद लेने का प्रयास करें, यह कल्पना करते हुए कि आशीर्वाद आप तक आ रहा है।"
            ]
          },
          "slokas": {
            "english": "1. om strīṃ tārāyai namaḥ svāhā | 2. aiṃ hrīṃ śrīṃ klīṃ sauḥ ugratāre huṃ phaṭ svāhā | 3. om tāre tuttāre ture svāhā | 4. om tāre tuttāre ture mama āyuḥ puṇya jñāna puṣṭiṃ kuru svāhā",
            "telugu": "1. ఓం స్త్రీం తారాయై నమః స్వాహా | 2. ఐం హ్రీం శ్రీం క్లీం సౌః ఉగ్రతారే హుం ఫట్ స్వాహా | 3. ఓం తారే తుత్తారే తురే స్వాహా | 4. ఓం తారే తుత్తారే తురే మమ ఆయుః పుణ్య జ్ఞాన పుష్టిం కురు స్వాహా",
            "devanagari": "१. ॐ स्त्रीं तारायै नमः स्वाहा । २. ऐं ह्रीं श्रीं क्लीं सौः उग्रतारे हुं फट् स्वाहा । ३. ॐ तारे तुत्तारे तुरे स्वाहा । ४. ॐ तारे तुत्तारे तुरे मम आयुः पुण्य ज्ञान पुष्टिं कुरु स्वाहा"
          }
        }
      ]
    },
    {
      "id": 7,
      "title": {
        "english": "Procedure: Final Offerings in Fire",
        "telugu": "ప్రక్రియ: అగ్నిలో చివరి నైవేద్యాలు",
        "devanagari": "प्रक्रिया: अग्नि में अंतिम आहुतियाँ"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Offer a drop of ghee, imagining you are surrendering your physical experiences to Agni.",
              "Offer a drop of ghee, imagining you are surrendering your mental experiences to Vayu.",
              "Offer a drop of ghee, imagining you are surrendering your spiritual experiences to Surya."
            ],
            "telugu": [
              "మీ భౌతిక అనుభవాలను అగ్నికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీ మానసిక అనుభవాలను వాయువుకు సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీ ఆధ్యాత్మిక అనుభవాలను సూర్యునికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने भौतिक अनुभव अग्नि को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने मानसिक अनुभव वायु को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने आध्यात्मिक अनुभव सूर्य को समर्पित कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om bhūḥ agnaye svāhā | om bhuvaḥ vāyave svāhā | om suvaḥ sūryāya svāhā",
            "telugu": "ఓం భూః అగ్నయే స్వాహా | ఓం భువః వాయవే స్వాహా | ఓం సువః సూర్యాయ స్వాహా",
            "devanagari": "ॐ भूः अग्नये स्वाहा । ॐ भुवः वायवे स्वाहा । ॐ सुवः सूर्याय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer a drop of ghee, imagining you are surrendering everything physical, mental and spiritual being created inside you to Prajapati.",
              "Offer a drop of ghee, imagining you are surrendering everything physical, mental and spiritual being sustained inside you to Vishnu.",
              "Offer a drop of ghee, imagining you are surrendering everything physical, mental and spiritual being destroyed inside you to Rudra."
            ],
            "telugu": [
              "మీలో సృష్టించబడుతున్న భౌతిక, మానసిక మరియు ఆధ్యాత్మికమైన ప్రతిదాన్ని ప్రజాపతికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీలో నిలబెట్టబడుతున్న భౌతిక, మానసిక మరియు ఆధ్యాత్మికమైన ప్రతిదాన్ని విష్ణువుకు సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి.",
              "మీలో నాశనం చేయబడుతున్న భౌతిక, మానసిక మరియు ఆధ్యాత్మికమైన ప్రతిదాన్ని రుద్రునికి సమర్పిస్తున్నట్లు భావిస్తూ ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने भीतर सृजित हो रही हर भौतिक, मानसिक और आध्यात्मिक वस्तु प्रजापति को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने भीतर कायम रखी जा रही हर भौतिक, मानसिक और आध्यात्मिक वस्तु विष्णु को समर्पित कर रहे हैं।",
              "घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने भीतर नष्ट हो रही हर भौतिक, मानसिक और आध्यात्मिक वस्तु रुद्र को समर्पित कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om bhūrbhuvassuvaḥ svāhā | om viṣṇave svāhā | om rudrāya svāhā",
            "telugu": "ఓం భూర్భువస్సువః స్వాహా | ఓం విష్ణవే స్వాహా | ఓం రుద్రాయ స్వాహా",
            "devanagari": "ॐ भूर्भुवस्सुवः स्वाहा । ॐ विष्णवे स्वाहा । ॐ रुद्राय स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Take 6 raisins or 6 pieces of a fruit. Offer them to the ethereal associates of the deity (Paarshadas), who cannot accept via Holy Fire and prefer to consume food via the sense of smell. You can later dispose of this food in the woods, trash, or feed it to animals or birds."
            ],
            "telugu": [
              "6 ఎండుద్రాక్షలు లేదా ఒక పండు యొక్క 6 ముక్కలు తీసుకోండి. పవిత్ర అగ్ని ద్వారా స్వీకరించలేని మరియు వాసన ద్వారా ఆహారాన్ని స్వీకరించడానికి ఇష్టపడే దేవత యొక్క ఆకాశ సహచరులకు (పార్షదులకు) వాటిని సమర్పించండి. ఈ ఆహారాన్ని మీరు తరువాత అడవిలో, చెత్తలో పారవేయవచ్చు లేదా జంతువులకు లేదా పక్షులకు పెట్టవచ్చు."
            ],
            "hindi": [
              "6 किशमिश या एक फल के 6 टुकड़े लें। उन्हें देवता के सूक्ष्म सहयोगियों (पार्षदों) को अर्पित करें, जो पवित्र अग्नि के माध्यम से स्वीकार नहीं कर सकते और गंध की भावना के माध्यम से भोजन ग्रहण करना पसंद करते हैं। आप बाद में इस भोजन को जंगल में, कचरे में फेंक सकते हैं, या इसे जानवरों या पक्षियों को खिला सकते हैं।"
            ]
          },
          "slokas": {
            "english": "om pārṣadebhyo namaḥ",
            "telugu": "ఓం పార్షదేభ్యో నమః",
            "devanagari": "ॐ पार्षदेभ्यो नमः"
          }
        }
      ]
    },
    {
      "id": 8,
      "title": {
        "english": "Procedure: Poornahuti",
        "telugu": "ప్రక్రియ: పూర్ణాహుతి",
        "devanagari": "प्रक्रिया: पूर्णाहुति"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Offer a big copra piece, a nut, a twig, or a large drop of ghee into the fire while saying the mantra, imagining that you are surrendering your sense of being to Mother Taaraa."
            ],
            "telugu": [
              "మంత్రాన్ని జపిస్తూ, మీ అస్తిత్వ భావనను తారా మాతకు సమర్పిస్తున్నట్లు భావిస్తూ, అగ్నిలో ఒక పెద్ద కొబ్బరి ముక్క, ఒక గింజ, ఒక పుల్ల లేదా పెద్ద చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "मंत्र का जाप करते हुए आग में एक बड़ा खोपरे का टुकड़ा, एक मेवा, एक टहनी या घी की एक बड़ी बूंद चढ़ाएं, यह कल्पना करते हुए कि आप अपने अस्तित्व की भावना को माँ तारा को समर्पित कर रहे हैं।"
            ]
          },
          "slokas": {
            "english": "om strīṃ tārāyai namaḥ svāhā",
            "telugu": "ఓం స్త్రీం తారాయై నమః స్వాహా",
            "devanagari": "ॐ स्त्रीं तारायै नमः स्वाहा"
          }
        },
        {
          "instructions": {
            "english": [
              "Offer a drop of ghee in the fire while imagining that the Holy Fire with seven tongues is pleased."
            ],
            "telugu": [
              "ఏడు నాలుకలు గల పవిత్ర అగ్ని ప్రసన్నమైందని భావిస్తూ అగ్నిలో ఒక చుక్క నెయ్యిని సమర్పించండి."
            ],
            "hindi": [
              "आग में घी की एक बूंद चढ़ाएं, यह कल्पना करते हुए कि सात जिह्वाओं वाली पवित्र अग्नि प्रसन्न है।"
            ]
          },
          "slokas": {
            "english": "om agnaye saptavate svāhā",
            "telugu": "ఓం అగ్నయే సప్తవతే స్వాహా",
            "devanagari": "ॐ अग्नये सप्तवते स्वाहा"
          }
        }
      ]
    },
    {
      "id": 9,
      "title": {
        "english": "Meditation",
        "telugu": "ధ్యానం",
        "devanagari": "ध्यान"
      },
      "steps": [
        {
          "instructions": {
            "english": [
              "Now, meditate as long as you can, with the following mantra (or any other mantra you like)."
            ],
            "telugu": [
              "ఇప్పుడు, మీకు వీలైనంత సేపు ఈ క్రింది మంత్రంతో (లేదా మీకు నచ్చిన మరేదైనా మంత్రంతో) ధ్యానం చేయండి."
            ],
            "hindi": [
              "अब, निम्नलिखित मंत्र (या अपनी पसंद के किसी अन्य मंत्र) के साथ जब तक आप कर सकते हैं, ध्यान करें।"
            ]
          },
          "slokas": {
            "english": "om strīṃ tārāyai namaḥ",
            "telugu": "ఓం స్త్రీం తారాయై నమః",
            "devanagari": "ॐ स्त्रीं तारायै नमः"
          }
        },
        {
          "instructions": {
            "english": [
              "At the end, say this while imagining that peace descends on you and others."
            ],
            "telugu": [
              "చివరగా, మీకు మరియు ఇతరులకు శాంతి కలుగుతుందని భావిస్తూ దీనిని చెప్పండి."
            ],
            "hindi": [
              "अंत में, यह कहते हुए कल्पना करें कि आप पर और दूसरों पर शांति उतर रही है।"
            ]
          },
          "slokas": {
            "english": "om śāntiḥ śāntiḥ śāntiḥ",
            "telugu": "ఓం శాంతిః శాంతిః శాంతిః",
            "devanagari": "ॐ शान्तिः शान्तिः शान्तिः"
          }
        }
      ]
    }
  ]
}